с:Ааре	у:4	т:с	р:ж	и:0
с:Аахен	у:2	т:с	р:м	и:1	у1:a
с:Абадан	у:5	т:с	р:м	и:1	у1:a
с:Абаза	у:5	т:с	р:ж	и:1	у1:b
с:Абай	у:3	т:с	р:м	и:4	у1:a	з:город в Казахстане
с:Абай	у:3	т:с	р:м	о:о	и:4	у1:a
с:Абакан	у:5	т:с	р:м	и:1	у1:a
с:Абакум	у:5	т:с	р:м	о:о	и:1	у1:a
с:Аба	у:3	т:с	р:ж	и:1	у1:b	фп:.м
с:Абвер	у:1	т:с	р:м	и:1	у1:a	з:орган военной разведки Германии в 1919—1944 годах
с:Абдулла	у:7	т:с	р:м	рм:ж	о:о	и:1	у1:b
с:Абердин	у:6	т:с	р:м	и:1	у1:a
с:Аберзее	у:6	т:с	р:с	и:0
с:Абиджан	у:6	т:с	р:м	и:1	у1:a
с:Абинск	у:3	т:с	р:м	и:3	у1:a
с:Абрам	у:4	т:с	р:м	о:о	и:1	у1:a
с:Абрамцево	у:4	т:с	р:с	и:1	у1:a
с:Абрау-Дюрсо	у:11.4	т:с	р:м	и:0
с:Абрахам	у:6	т:с	р:м	о:о	и:1	у1:a
с:Абхазия	у:4	т:с	р:ж	и:7	у1:a
с:Абый	у:3	т:с	р:м	и:6	у1:a
с:Аввакум	у:4	т:с	р:м	о:о	и:1	у1:a
с:Августина	у:7	т:с	р:ж	о:о	и:1	у1:a
с:Августин	у:7	т:с	р:м	о:о	и:1	у1:a
с:Авель	у:1	т:с	р:м	о:о	и:2	у1:a
с:Авраам	у:5	т:с	р:м	о:о	и:1	у1:a
с:Аврелия	у:4	т:с	р:ж	о:о	и:7	у1:a
с:Аври	у:4	т:с	р:м	и:0
с:Аврора	у:4	т:с	р:ж	о:о	и:1	у1:a
с:Австралия	у:6	т:с	р:ж	и:7	у1:a
с:Австрия	у:1	т:с	р:ж	и:7	у1:a
с:Австро-Венгрия	у:9	т:с	р:ж	и:7	у1:a
с:АвтоВАЗ	у:6	т:с	р:м	и:1	у1:a
с:Автодок	у:6	т:с	р:м	и:3	у1:a
с:Агата	у:3	т:с	р:ж	о:о	и:1	у1:a
с:Агвали	у:4	т:с	р:м	и:0	з:ударение предположительно
с:Аглая	у:4	т:с	р:ж	о:о	и:1	у1:a
с:Агнесса	у:4	т:с	р:ж	о:о	и:1	у1:a
с:Адам	у:1	т:с	р:м	о:о	и:1	у1:a
с:Адам	у:3	т:с	р:м	о:о	и:1	у1:a
с:Ада	у:1	т:с	р:ж	о:о	и:1	у1:a
с:Аделина	у:5	т:с	р:ж	о:о	и:1	у1:a
с:Адель	у:3	т:с	р:ж	о:о
с:Аджария	у:4	т:с	р:ж	и:7	у1:a
с:Ади	у:1	т:с	р:м	о:о
с:Адлер	у:1	т:с	р:м	и:1	у1:a
с:Адольф	у:3	т:с	р:м	о:о	и:1	у1:a
с:Адриан	у:5	т:с	р:м	о:о	и:1	у1:a
с:Адыгея	у:5	т:с	р:ж	и:6	у1:a
с:Азат	у:3	т:с	р:м	о:о	и:1	у1:a
с:Азгат	у:4	т:с	р:м	о:о	и:1	у1:a
с:Азербайджан	у:10	т:с	р:м	и:1	у1:a
с:Азия	у:1	т:с	р:ж	и:7	у1:a
с:Азов	у:3	т:с	р:м	и:1	у1:a
с:Аида	у:2	т:с	р:ж	о:о	и:1	у1:a
с:Айболит	у:6	т:с	р:м	о:о	и:1	у1:a
с:Айгерим	у:6	т:с	р:ж	о:о	и:0
с:Айгуль	у:4	т:с	р:ж	о:о	и:0	вар:1
с:Айгуль	у:4	т:с	р:ж	о:о	и:8	у1:a	вар:2
с:Айгунь	у:4	т:с	р:ж	и:8	у1:a
с:Айгюн	у:4	т:с	р:ж	о:о	и:0
с:Айдахо	у:4	т:с	р:м	и:0
с:Айнажи	у:1	т:с	р:м	и:0	з:город в Латвии
с:Айнур	у:4	т:с	р:м	о:о	и:1	у1:a
с:Айова	у:3	т:с	р:ж	и:1	у1:a
с:Айпад	у:4	т:с	р:м	и:1	у1:a
с:Айрин	у:4	т:с	р:ж	о:о
с:Ай	у:1	т:с	р:м	и:6	у1:a	з:река
с:Айфон	у:4	т:с	р:м	и:1	у1:a
с:Айфон	у:4	т:с	р:м	и:1	у1:a
с:Айя-Напа	у:6.1	т:с	р:ж	и:1	у1:a
с:Акакий	у:3	т:с	р:м	о:о	и:6	у1:a
с:Ак-довурак	у:9	т:с	р:м	и:3	у1:a	з:http://ru.wikipedia.org/wiki/Ак-Довурак
с:Акмая	у:5	т:с	р:ж	о:о	и:1	у1:b
с:Аксарайский	у:6	т:с	т2:п	р:м	и:3	у1:a
с:Аксарка	у:4	т:с	р:ж	и:3	у1:a	ч	з:посёлок в Ямало-Ненецком автономном округе России
с:Аксинья	у:4	т:с	р:ж	о:о	и:6	у1:a	ч
с:Аксян	у:4	т:с	р:м	и:1	у1:a
с:Актау	у:4	т:с	р:м	и:0
с:Ак-Чишма	у:8	т:с	р:ж	и:1	у1:b	фп:.м
с:Алабама	у:5	т:с	р:ж	и:1	у1:a
с:Алания	у:3	т:с	р:ж	и:7	у1:a
с:Алан	у:1	т:с	р:м	о:о	и:1	у1:a
с:Алан	у:3	т:с	р:м	о:о	и:1	у1:a
с:Алахадзы	у:8	т:с	р:м	и:0
с:Албания	у:4	т:с	р:ж	и:7	у1:a
с:Алеко	у:3	т:с	р:м	о:о	и:0
с:Александра	у:6	т:с	р:ж	о:о	и:1	у1:a
с:Александр	у:6	т:с	р:м	о:о	и:1	у1:a
с:Алекса	у:3	т:с	р:ж	о:о	и:1	у1:a
с:Алексей	у:6	т:с	р:м	о:о	и:1	у1:a
с:Алекс	у:1	т:с	р:м	о:о	и:1	у1:a
с:Алеша	у:5	т:с	р:ж	о:о	и:4	у1:b
с:Алёна	у:3	т:с	р:ж	о:о	и:1	у1:a
с:Алёша	у:3	т:с	р:м	рм:ж	о:о	и:4	у1:a
с:Алжир	у:4	т:с	р:м	и:1	у1:a
с:Алибаба	у:7	т:с	р:м	рм:ж	о:о	и:1	у1:b
с:Алик	у:1	т:с	р:м	о:о	и:3	у1:a
с:Алина	у:3	т:с	р:ж	о:о	и:1	у1:a
с:Алиса	у:3	т:с	р:ж	о:о	и:1	у1:a
с:Алисия	у:3	т:с	р:ж	о:о	и:7	у1:a
с:Алис-Спрингс	у:9	т:с	р:м	и:0
с:Али	у:3	т:с	р:м	о:о
с:Алия	у:4	т:с	р:ж	о:о	и:7	у1:b
с:Аллаки	у:4	т:с	мн	р:м	и:3	у1:a
с:Аллан	у:1	т:с	р:м	о:о	и:1	у1:a
с:Алла	у:1	т:с	р:ж	о:о	и:1	у1:a
с:Аллах	у:4	т:с	р:м	о:о	и:3	у1:a
с:Аллен	у:1	т:с	р:м	о:о	и:1	у1:a
с:Алма-ата	у:8.4	т:с	р:ж	и:1	у1:b	фп:.м
с:Алма-аты	у:8.4	т:с	р:м	и:0
с:Алмаз	у:4	т:с	р:м	о:о	и:1	у1:a
с:Алматы	у:6	т:с	р:м	и:0
с:Алмондсбери	у:1	т:с	р:м	и:0
с:Алтай	у:4	т:с	р:м	и:6	у1:a
с:Алупка	у:3	т:с	р:ж	и:3	у1:a	ч
с:Алушта	у:3	т:с	р:ж	и:1	у1:a
с:Альберта	у:5	т:с	р:ж	о:о	и:1	у1:a
с:Альберто	у:5	т:с	р:м	о:о	и:0
с:Альберт	у:1	т:с	р:м	о:о	и:1	у1:a
с:Альберт	у:5	т:с	р:м	о:о	и:1	у1:a
с:Альбина	у:5	т:с	р:ж	о:о	и:1	у1:a
с:Альбукерке	у:7	т:с	р:м	и:0
с:Альметьевск	у:5	т:с	р:м	и:3	у1:a
с:Альпы	у:1	т:с	мн	р:ж	и:1	у1:a
с:Альтаир	у:6	т:с	р:м	и:1	у1:a
с:Альфа	у:1	т:с	р:ж	о:о	и:1	у1:a
с:Альфия	у:6	т:с	р:ж	о:о	и:7	у1:b
с:Альфонс	у:5	т:с	р:м	о:о	и:1	у1:a
с:Альфред	у:1	т:с	р:м	о:о	и:1	у1:a
с:Альфред	у:6	т:с	р:м	о:о	и:1	у1:a
с:Альянс	у:4	т:с	р:м	о:о	и:1	у1:a
с:Аляска	у:3	т:с	р:ж	и:3	у1:a	ч
с:Аля	у:1	т:с	р:ж	о:о	и:2	у1:a
с:Амалия	у:3	т:с	р:ж	о:о	и:7	у1:a
с:Амальфи	у:3	т:с	р:м	и:0
с:Амга	у:4	т:с	р:ж	и:1	у1:d	фп:.м	з:село
с:Америка	у:3	т:с	р:ж	и:3	у1:a
с:Амзя	у:4	т:с	р:ж	и:2	у1:b	з:ударение предположительно
с:Амка	у:1	т:с	р:ж	и:3	у1:a	ч
с:Амстердам	у:8	т:с	р:м	и:1	у1:a
с:Ам	у:1	т:с	р:м	о:о	и:1	у1:a
с:Анадырь	у:5	т:с	р:м	и:2	у1:a
с:Анапа	у:3	т:с	р:ж	и:1	у1:a
с:Анара	у:3	т:с	р:ж	о:о	и:1	у1:a
с:Анастасия	у:8	т:с	р:ж	о:о	и:7	у1:a
с:Анатолий	у:5	т:с	р:м	о:о	и:7	у1:a	до:26
с:Анатолия	у:5	т:с	р:ж	о:о	и:7	у1:a
с:Ана	у:1	т:с	р:ж	о:о	и:1	у1:a
с:Ангалло	у:4	т:с	р:м	и:0	з:город в Хабаровском крае; ударение наобум
с:Ангара	у:6	т:с	р:ж	и:1	у1:b	фп:.м
с:Ангарск	у:4	т:с	р:м	и:3	у1:a
с:Ангела	у:1	т:с	р:ж	о:о	и:1	у1:a
с:Ангела	у:4	т:с	р:ж	о:о	и:1	у1:a
с:Ангелина	у:6	т:с	р:ж	о:о	и:1	у1:a
с:Ангелов	у:1	т:п	т2:мс	и:1	у1:a	з:переулок в Москве
с:Англия	у:1	т:с	р:ж	и:7	у1:a
с:Ангола	у:4	т:с	р:ж	и:1	у1:a
с:Андалузия	у:6	т:с	р:ж	и:7	у1:a
с:Андалусия	у:6	т:с	р:ж	и:7	у1:a
с:Андерсон	у:1	т:с	р:м	о:о	и:1	у1:a
с:Анджело	у:1	т:с	р:м	о:о	и:0
с:Андорра	у:4	т:с	р:ж	и:1	у1:a
с:Андреаполь	у:6	т:с	р:м	и:2	у1:a
с:Андреас	у:5	т:с	р:м	о:о	и:1	у1:a
с:Андреа	у:5	т:с	р:ж	о:о
с:Андреевна	у:5	т:с	р:ж	о:о	и:1	у1:a	ч
с:Андреиха	у:5	т:с	р:ж	и:3	у1:a
с:Андрей	у:5	т:с	р:м	о:о	и:1	у1:a
с:Андре	у:5	т:с	р:м	о:о	и:0
с:Андроид	у:5	т:с	р:м	и:1	у1:a	з:операционная система
с:Андромеда	у:7	т:с	р:ж	и:1	у1:a
с:Андрус	у:1	т:с	р:м	о:о	и:1	у1:a
с:Андрюха	у:5	т:с	р:м	рм:ж	о:о	и:3	у1:a
с:Анжела	у:1	т:с	р:ж	о:о	и:1	у1:a
с:Анжела	у:4	т:с	р:ж	о:о	и:1	у1:a
с:Анжелика	у:6	т:с	р:ж	о:о	и:3	у1:a
с:Анжелина	у:6	т:с	р:ж	о:о	и:1	у1:a
с:Анита	у:3	т:с	р:ж	о:о	и:1	у1:a
с:Анкара	у:6	т:с	р:ж	и:1	у1:b
с:Анка	у:1	т:с	р:ж	о:о	и:3	у1:a
с:Анна	у:1	т:с	р:ж	о:о	и:1	у1:a
с:Аннета	у:4	т:с	р:ж	о:о	и:1	у1:a
с:Аннет	у:4	т:с	р:ж	о:о	и:0
с:Анника	у:1	т:с	р:ж	о:о	и:3	у1:a
с:Аннушка	у:1	т:с	р:ж	о:о	и:3	у1:a	ч
с:Анре	у:4	т:с	р:м	о:о	и:0
с:Анри	у:4	т:с	р:м	о:о	и:0
с:Анталия	у:4	т:с	р:ж	и:7	у1:a
с:Антарктида	у:8	т:с	р:ж	и:1	у1:a
с:Антарктика	у:4	т:с	р:ж	и:3	у1:a
с:Антигуа	у:4	т:с	р:м	и:0	з:остров в Карибском море
с:Антоний	у:4	т:с	р:м	о:о	и:7	у1:a	до:26
с:Антонина	у:6	т:с	р:ж	о:о	и:1	у1:a
с:Антонио	у:4	т:с	р:м	о:о	и:0
с:Антония	у:4	т:с	р:ж	о:о	и:7	у1:a
с:Антон	у:4	т:с	р:м	о:о	и:1	у1:a
с:Антуан	у:5	т:с	р:м	о:о	и:1	у1:a
с:Анчисхати	у:7	т:с	р:м	и:0	з:самая старая из сохранившихся до наших дней церквей в Тбилиси
с:Анька	у:1	т:с	р:ж	о:о	и:3	у1:a	ч	з:это имя, но если добавить во ВсеИмена, но не будет форм мн.ч.
с:Анюта	у:3	т:с	р:ж	о:о	и:1	у1:a
с:Аня	у:1	т:с	р:ж	о:о	и:2	у1:a
с:Апатиты	у:5	т:с	мн	р:м	и:1	у1:a
с:Аполлон	у:6	т:с	р:м	о:о	и:1	у1:a
с:Апрелевка	у:4	т:с	р:ж	и:3	у1:a	ч
с:Арабелла	у:5	т:с	р:ж	о:о	и:1	у1:a
с:Аравия	у:3	т:с	р:ж	и:7	у1:a
с:Аракуль	у:3	т:с	р:м	и:2	у1:a
с:Арарат	у:5	т:с	р:м	и:1	у1:a
с:Арбаж	у:4	т:с	р:м	и:4	у1:a	з:ударение предположительно
с:Арбат	у:4	т:с	р:м	и:1	у1:a
с:Аргентина	у:7	т:с	р:ж	и:1	у1:a
с:Аргос	у:1	т:с	р:м	и:1	у1:a
с:Арест	у:3	т:с	р:м	о:о	и:1	у1:a
с:Арзамас	у:6	т:с	р:м	и:1	у1:a
с:Ариадна	у:4	т:с	р:ж	о:о	и:1	у1:a
с:Аризона	у:5	т:с	р:ж	и:1	у1:a
с:Арина	у:3	т:с	р:ж	о:о	и:1	у1:a
с:Аристарх	у:6	т:с	р:м	о:о	и:3	у1:a
с:Аристотель	у:6	т:с	р:м	о:о	и:2	у1:a
с:Аркадий	у:4	т:с	р:м	о:о	и:7	у1:a	до:26
с:Аркадия	у:4	т:с	р:ж	о:о	и:7	у1:a
с:Аркаим	у:5	т:с	р:м	и:1	у1:a
с:Арканзас	у:7	т:с	р:м	и:1	у1:a
с:Арктика	у:1	т:с	р:ж	и:3	у1:a
с:Аркуль	у:4	т:с	р:м	и:2	у1:a
с:Арлен	у:4	т:с	р:м	о:о	и:1	у1:a
с:Армавир	у:6	т:с	р:м	и:1	у1:a
с:Арман	у:4	т:с	р:м	о:о	и:1	у1:a
с:Армения	у:4	т:с	р:ж	и:7	у1:a
с:Армине	у:6	т:с	р:ж	о:о	и:0
с:Арни	у:1	т:с	р:м	о:о	и:0
с:Арнольд	у:4	т:с	р:м	о:о	и:1	у1:a
с:Арно	у:4	т:с	р:м	о:о	и:0
с:Арсений	у:4	т:с	р:м	о:о	и:7	у1:a	до:26
с:Арсен	у:4	т:с	р:м	о:о	и:1	у1:a
с:Артемида	у:6	т:с	р:ж	о:о	и:1	у1:a
с:Артемий	у:4	т:с	р:м	о:о	и:7	у1:a	до:26
с:Артём	у:4	т:с	р:м	и:1	у1:a	з:город
с:Артём	у:4	т:с	р:м	о:о	и:1	у1:a	з:мужское имя
с:Арти	у:4	т:с	р:м	и:0
с:Артур	у:4	т:с	р:м	о:о	и:1	у1:a
с:Архангельск	у:4	т:с	р:м	и:3	у1:a
с:Архара	у:6	т:с	р:ж	и:1	у1:b	з:ударение предположительно
с:Аршань	у:4	т:с	р:м	и:2	у1:a
с:Асият	у:4	т:с	р:ж	о:о	и:0
с:Аскольд	у:4	т:с	р:м	о:о	и:1	у1:a
с:Аслан	у:4	т:с	р:м	о:о	и:1	у1:a
с:Астана	у:6	т:с	р:ж	и:1	у1:b
с:Астрахань	у:1	т:с	р:ж	и:8	у1:a
с:Ася	у:1	т:с	р:ж	о:о	и:2	у1:a
с:Атланта	у:4	т:с	р:ж	о:о	и:1	у1:a
с:Атлантида	у:7	т:с	р:ж	о:о	и:1	у1:a
с:Атлантика	у:4	т:с	р:ж	и:3	у1:a
с:Атос	у:3	т:с	р:м	о:о	и:1	у1:a
с:Аттила	у:4	т:с	р:ж	о:о	и:1	у1:a
с:Ауди	у:1	т:с	р:ж	и:0
с:Аура	у:1	т:с	р:ж	о:о	и:1	у1:a
с:Ауто-да-фе	у:10	т:с	р:с	и:0
с:Афанасий	у:5	т:с	р:м	о:о	и:7	у1:a	до:26
с:Афганистан	у:9	т:с	р:м	и:1	у1:a
с:Афган	у:4	т:с	р:м	и:1	у1:a
с:Афина	у:3	т:с	р:ж	о:о	и:1	у1:a
с:Афины	у:3	т:с	мн	р:ж	и:1	у1:a
с:Африка	у:1	т:с	р:ж	и:3	у1:a
с:Афродита	у:6	т:с	р:ж	о:о	и:1	у1:a
с:Ахмед	у:4	т:с	р:м	о:о	и:1	у1:a
с:Ахтуба	у:1	т:с	р:ж	и:1	у1:a
с:Ачинск	у:1	т:с	р:м	и:3	у1:a
с:Аэлита	у:4	т:с	р:ж	о:о	и:1	у1:a
с:АЭС	у:2	т:с	р:ж	и:0
с:Аяз	у:2	т:с	р:м	о:о	и:1	у1:a
с:Аяччо	у:2	т:с	р:м	и:0
с:Аяччо	у:2	т:с	р:м	и:0
с:Бабадаг	у:6	т:с	р:м	и:1	у1:a
с:Баба-Дурмаз	у:10.2	т:с	р:м	и:1	у1:a
с:Бабаиха	у:4	т:с	р:ж	и:3	у1:a
с:Бабугент	у:6	т:с	р:м	и:1	у1:a
с:Бавария	у:4	т:с	р:ж	и:7	у1:a
с:Бавлены	у:5	т:с	мн	р:ж	и:1	у1:a
с:Багамы	у:4	т:с	мн	р:ж	и:1	у1:a
с:Багратионовск	у:8	т:с	р:м	и:3	у1:a
с:Бадахос	у:6	т:с	р:м	и:1	у1:a
с:Баден-Баден	у:8.2	т:с	р:м	и:1	у1:a
с:Бад-Тацмансдорф	у:6	т:с	р:м	и:1	у1:a
с:Бадхыз	у:5	т:с	р:м	и:1	у1:a
с:Байкал	у:5	т:с	р:м	и:1	у1:a
с:Байконур	у:7	т:с	р:м	и:1	у1:a
с:Байрон	у:2	т:с	р:м	о:о	и:1	у1:a
с:Бай-Хаак	у:7.2	т:с	р:м	и:3	у1:a
с:Баку	у:4	т:с	р:м	и:0
с:Балаклава	у:7	т:с	р:ж	и:1	у1:a
с:Балаклея	у:7	т:с	р:ж	и:2	у1:a
с:Балаково	у:6	т:с	р:с	и:1	у1:a
с:Баланово	у:4	т:с	р:с	и:1	у1:a
с:Балашиха	у:6	т:с	р:ж	и:1	у1:a
с:Бали	у:4	т:с	р:м
с:Балканы	у:5	т:с	мн	р:ж	и:1	у1:a
с:Балтаси	у:5	т:с	р:м	и:0	з:ударение предположительно
с:Балтийск	у:5	т:с	р:м	и:3	у1:a
с:Балтимор	у:2	т:с	р:м	и:1	у1:a
с:Бангкок	у:6	т:с	р:м	и:3	у1:a
с:Бангладеш	у:8	т:с	р:м	и:4	у1:a	фр:E1%E0%ED%E3%EB%E0%E4%E5%F8 _)	слсч://gramota.ru/spravka/buro/search_answer/?s=
с:Барабель	у:6	т:с	р:м	и:2	у1:a	з:склонение наобум
с:Барак	у:4	т:с	р:м	о:о	и:3	у1:a
с:Барбадос	у:5	т:с	р:м	и:1	у1:a
с:Барбара	у:2	т:с	р:ж	о:о	и:1	у1:a
с:Барби	у:2	т:с	р:ж	и:0
с:Бардеёв	у:6	т:с	р:м	и:1	у1:a
с:Бари	у:2	т:с	р:м	и:0	з:город в Италии
с:Барнаул	у:6	т:с	р:м	и:1	у1:a
с:Барри	у:2	т:с	р:м	о:о
с:Барселона	у:7	т:с	р:ж	и:1	у1:a
с:Бастилия	у:5	т:с	р:ж	и:7	у1:a
с:Батайск	у:4	т:с	р:м	и:3	у1:a
с:Батуми	у:4	т:с	р:м	и:0
с:Батый	у:4	т:с	р:м	о:о	и:1	у1:a
с:Батырева	у:4	т:с	р:ж	и:1	у1:a	з:город, ударение предположительно
с:Бахрейн	у:5	т:с	р:м	и:1	у1:a	з:ударение по Википедии
с:Бахыт	у:4	т:с	р:ж	о:о
с:Бахыт	у:4	т:с	р:м	о:о	и:1	у1:a
с:Баян	у:3	т:с	р:ж	о:о
с:Бежецк	у:2	т:с	р:м	и:3	у1:a
с:Безенчук	у:7	т:с	р:м	и:3	у1:b	з:город
с:Бейонсе	у:4	т:с	р:ж	о:о	и:0
с:Бейрут	у:5	т:с	р:м	и:1	у1:a
с:Беларусь	у:6	т:с	р:ж	и:8	у1:a
с:Белгород	у:2	т:с	р:м	и:1	у1:a
с:Белебей	у:6	т:с	р:м	и:6	у1:a
с:Белек	у:4	т:с	р:м	и:3	у1:a	з:город-курорт в Турции
с:Белёв	у:4	т:с	р:м	и:1	у1:a
с:Белз	у:2	т:с	р:м	и:1	у1:a
с:Беливо	у:2	т:с	р:с	и:0	з:ударение наобум
с:Белиз	у:4	т:с	р:м	и:1	у1:a
с:Белинский	у:4	т:с	т2:п	р:м	и:3	у1:a	фн:^с
с:Белитено	у:4	т:с	р:с	и:0	з:ударение наобум
с:Белла	у:2	т:с	р:ж	о:о	и:1	у1:a
с:Белогорск	у:6	т:с	р:м	и:3	у1:a
с:Белокуриха	у:6	т:с	р:ж	и:3	у1:a
с:Беломорканал	у:11	т:с	р:м	и:1	у1:a
с:Беломорск	у:6	т:с	р:м	и:3	у1:a
с:Белорецкий	у:6	т:с	т2:п	р:м	и:3	у1:a
с:Белорецк	у:6	т:с	р:м	и:3	у1:a
с:Белоруссия	у:6	т:с	р:ж	и:7	у1:a
с:Белоснежка	у:7	т:с	р:ж	и:3	у1:a	ч
с:Белоусов	у:5	т:п	т2:мс	и:1	у1:a	слсч:Белоусов бор
с:Белоярский	у:5	т:с	т2:п	р:м	и:3	у1:a
с:Белоярск	у:5	т:с	р:м	и:3	у1:a
с:Бельгия	у:2	т:с	р:ж	и:7	у1:a
с:Бельско	у:2	т:с	р:с	и:0
с:Бельцы	у:2	т:с	мн	р:ж	и:5	у1:a
с:Бенджамин	у:8	т:с	р:м	о:о	и:1	у1:a
с:Бенедикт	у:6	т:с	р:м	о:о	и:1	у1:a
с:Бенин	у:4	т:с	р:м	и:1	у1:c	з:республика
с:Бени-Суэйф	у:8.2	т:с	р:м	и:1	у1:a
с:Бентли	у:2	т:с	р:ж	и:0
с:Бердск	у:2	т:с	р:м	и:3	у1:a
с:Бердюжье	у:5	т:с	р:с	и:6	у1:a	ч
с:Береговое	у:8	т:с	т2:п	р:с	и:1	у1:a
с:Бережаны	у:6	т:с	мн	р:ж	и:1	у1:a	з:ударение предположительно
с:Березники	у:9	т:с	мн	р:м	и:3	у1:b
с:Беркли	у:2	т:с	р:м	и:0
с:Берлин	у:5	т:с	р:м	и:1	у1:a
с:Бермуды	у:5	т:с	мн	р:ж	и:1	у1:a
с:Бернард	у:2	т:с	р:м	о:о	и:1	у1:a
с:Бернард	у:5	т:с	р:м	о:о	и:1	у1:a
с:Бернар	у:5	т:с	р:м	о:о	и:1	у1:a
с:Бернли	у:2	т:с	р:м	и:0
с:Берн	у:2	т:с	р:м	и:1	у1:a
с:Берта	у:2	т:с	р:ж	о:о	и:1	у1:a
с:Берти	у:2	т:с	р:ж	о:о	и:0
с:Бессарабия	у:7	т:с	р:ж	и:7	у1:a
с:Бетти	у:2	т:с	р:ж	о:о
с:Бет	у:2	т:с	р:ж	о:о
с:Бёрёлёх	у:6	т:с	р:м	и:3	у1:a
с:Бибирево	у:2	т:с	р:с	и:1	у1:a
с:Бийск	у:2	т:с	р:м	и:3	у1:a
с:Билли	у:2	т:с	р:м	о:о
с:Билл	у:2	т:с	р:м	о:о	и:1	у1:a
с:Бильбао	у:6	т:с	р:м	и:0
с:Бим	у:2	т:с	р:м	о:о	и:1	у1:a	з:кличка собаки
с:Бирма	у:2	т:с	р:ж	и:1	у1:a
с:Бирмингем	у:8	т:с	р:м	и:1	у1:a
с:Биробиджан	у:9	т:с	р:м	и:1	у1:a
с:Бирюлёво	у:6	т:с	р:с	и:1	у1:a
с:Битлы	у:5	т:с	мн	р:м	о:о	и:1	у1:a
с:Бишкек	у:5	т:с	р:м	и:3	у1:a
с:Бишкинь	у:2	т:с	р:м	и:2	у1:a
с:Бишкинь	у:5	т:с	р:ж	и:8	у1:a	з:склонение по наитию; ударение по аналогии с украинским названием: Бишкінь, где і очевидно ударно
с:Благовещенск	у:7	т:с	р:м	и:1	у1:a
с:Блетчли	у:3	т:с	р:м	и:0
с:Блокли	у:3	т:с	р:м	и:0
с:Блэкби	у:3	т:с	р:ж	и:0
с:Блэкби	у:3	т:с	р:м	и:0
с:Блэк-Хилс	у:7	т:с	р:м	и:0
с:Бобби	у:2	т:с	р:м	о:о
с:Боб	у:2	т:с	р:м	о:о	и:1	у1:a
с:Богдана	у:5	т:с	р:ж	о:о	и:1	у1:a
с:Богдан	у:5	т:с	р:м	о:о	и:1	у1:a
с:Бодайбо	у:4	т:с	р:м	и:0
с:Боинг	у:2	т:с	р:м	и:3	у1:a
с:Болгария	у:5	т:с	р:ж	и:7	у1:a
с:Боливия	у:4	т:с	р:ж	и:7	у1:a
с:Бологое	у:6	т:с	т2:п	р:с	и:1	у1:b
с:Болонь	у:4	т:с	р:ж	и:8	у1:a
с:Болонья	у:4	т:с	р:ж	и:6	у1:a	ч
с:Бонни	у:2	т:с	р:ж	о:о
с:Бордо	у:5	т:с	р:м	и:0
с:Борзя	у:5	т:с	р:ж	и:1	у1:b
с:Борисоглебск	у:9.4	т:с	р:м	и:3	у1:a
с:Борис	у:4	т:с	р:м	о:о	и:1	у1:a
с:Борнмут	у:2	т:с	р:м	и:1	у1:a
с:Боровск	у:2	т:с	р:м	и:3	у1:a
с:Борогонцы	у:6	т:с	мн	р:м	и:5	у1:a
с:Бородино	у:8	т:с	р:с	и:1	у1:b
с:Босния	у:2	т:с	р:ж	и:7	у1:a
с:Бостон	у:2	т:с	р:м	и:1	у1:a
с:Ботли	у:2	т:с	р:м	и:0
с:Ботлих	у:2	т:с	р:м	и:3	у1:a
с:Ботсвана	у:6	т:с	р:ж	и:1	у1:a
с:Ботучаны	у:6	т:с	мн	р:ж	и:1	у1:a
с:Бразилия	у:5	т:с	р:ж	и:7	у1:a
с:Браилов	у:4	т:с	р:м	и:1	у1:a	з:поселок городского типа в Жмеринском районе Винницкой области Украины
с:Брайан	у:3	т:с	р:м	о:о	и:1	у1:a
с:Брайан	у:3	т:с	р:м	о:о	и:1	у1:a
с:Братислава	у:8	т:с	р:ж	и:1	у1:a
с:Братск	у:3	т:с	р:м	и:3	у1:a
с:Бреды	у:3	т:с	мн	р:м	и:1	у1:a
с:Бренда	у:3	т:с	р:ж	о:о	и:1	у1:a
с:Бренди	у:3	т:с	р:ж	о:о
с:Брент	у:3	т:с	р:м	о:о	и:1	у1:a
с:Британия	у:5	т:с	р:ж	и:7	у1:a
с:Брно	у:4	т:с	р:м	и:0
с:Бромли	у:3	т:с	р:м	и:0
с:Бромсгроув	у:3	т:с	р:м	и:1	у1:a	з:город в Англии
с:Бронницы	у:3	т:с	мн	р:ж	и:5	у1:a
с:Бруклин	у:3	т:с	р:м	и:1	у1:a
с:Бруней	у:5	т:с	р:м	и:6	у1:a
с:Бруно	у:3	т:с	р:м	о:о	и:0
с:Брэд	у:3	т:с	р:м	о:о	и:1	у1:a
с:Брюссель	у:6	т:с	р:м	и:2	у1:a
с:Брюс	у:3	т:с	р:м	о:о	и:1	у1:a
с:Брянск	у:3	т:с	р:м	и:3	у1:a
с:Бугульма	у:8	т:с	р:ж	и:1	у1:b	фп:.м
с:Будапешт	у:6	т:с	р:м	и:1	у1:a
с:Будённовск	у:4	т:с	р:м	и:3	у1:a
с:Буйнакск	у:5	т:с	р:м	и:3	у1:a
с:Буки	у:2	т:с	мн	р:ж	и:3	у1:a
с:Булат	у:4	т:с	р:м	о:о	и:1	у1:a
с:Бурасы	у:4	т:с	мн	р:ж	и:1	у1:a
с:Буратино	у:6	т:с	р:м	о:о	и:0	з:сказочный герой
с:Бурен-Бай-Хаак	у:13.8	т:с	р:м	и:3	у1:a
с:Буркина-Фасо	у:12.7	т:с	р:ж	и:0
с:Бурла	у:5	т:с	р:ж	и:1	у1:c
с:Бурли	у:5	т:с	р:м
с:Бурятия	у:4	т:с	р:ж	и:7	у1:a
с:Бухара	у:6	т:с	р:ж	и:1	у1:b	фп:.м
с:Бухарест	у:6	т:с	р:м	и:1	у1:a
с:Бучач	у:2	т:с	р:м	и:4	у1:a	з:ударение по википедии: http://ru.wikipedia.org/wiki/Бучач
с:Бушмено	у:2	т:с	р:с	и:0	з:ударение наобум
с:Буэнос-Айрес	у:8.3	т:с	р:м	и:1	у1:a
с:быстро	у:2	т:н	и:0
с:Бытошь	у:4	т:с	р:ж	и:8	у1:a
с:Бэла	у:2	т:с	р:ж	о:о	и:1	у1:a
с:Бэлла	у:2	т:с	р:ж	о:о	и:1	у1:a
с:Вагнер	у:2	т:с	р:м	о:о	и:1	у1:a
с:Вадик	у:2	т:с	р:м	о:о	и:3	у1:a
с:Вадим	у:4	т:с	р:м	о:о	и:1	у1:a
с:Вайоминг	у:4	т:с	р:м	и:3	у1:a
с:Вайс	у:2	т:с	р:м	о:о	и:1	у1:a
с:Валаам	у:5	т:с	р:м	и:1	у1:a	з:остров
с:Валаам	у:5	т:с	р:м	и:1	у1:a	з:поселок
с:Валентина	у:7	т:с	р:ж	о:о	и:1	у1:a
с:Валентин	у:7	т:с	р:м	о:о	и:1	у1:a
с:Валера	у:4	т:с	р:м	рм:ж	о:о	и:1	у1:a
с:Валерий	у:4	т:с	р:м	о:о	и:7	у1:a	до:26
с:Валерия	у:4	т:с	р:ж	о:о	и:7	у1:a
с:Валива	у:2	т:с	р:ж	и:1	у1:a
с:Валуйки	у:4	т:с	мн	р:ж	и:3	у1:a	ч
с:Вальдемар	у:8	т:с	р:м	о:о	и:1	у1:a
с:Вальтер	у:2	т:с	р:м	о:о	и:1	у1:a
с:Ванда	у:2	т:с	р:ж	о:о	и:1	у1:a
с:Ванкувер	у:5	т:с	р:м	и:1	у1:a
с:Ванька	у:2	т:с	р:м	рм:ж	о:о	и:3	у1:a	ч
с:Ваня	у:2	т:с	р:м	рм:ж	о:о	и:2	у1:a
с:Варвара	у:5	т:с	р:ж	о:о	и:1	у1:a
с:Варшава	у:5	т:с	р:ж	и:1	у1:a
с:Варька	у:2	т:с	р:ж	о:о	и:3	у1:a	ч
с:Варя	у:2	т:с	р:ж	о:о	и:2	у1:a
с:Василий	у:4	т:с	р:м	о:о	и:7	у1:a	до:26
с:Василиса	у:6	т:с	р:ж	о:о	и:1	у1:a
с:Вася	у:2	т:с	р:м	рм:ж	о:о	и:2	у1:a
с:Вахруши	у:2	т:с	мн	р:м	и:4	у1:a
с:Вацлав	у:2	т:с	р:м	о:о	и:1	у1:a
с:Вашингтон	у:8	т:с	р:м	и:1	у1:a
с:Ведомости	у:2	т:с	мн	р:ж	и:8	у1:a
с:Вектор	у:2	т:с	р:м	о:о	и:1	у1:a
с:Великобритания	у:11	т:с	р:ж	и:7	у1:a
с:Велья	у:2	т:с	р:ж	и:6	у1:a	ч	з:ударение по Википедии
с:Венгрия	у:2	т:с	р:ж	и:7	у1:a
с:Венди	у:2	т:с	р:ж	о:о
с:Венера	у:4	т:с	р:ж	и:1	у1:a
с:Венера	у:4	т:с	р:ж	о:о	и:1	у1:a
с:Венесуэла	у:7	т:с	р:ж	и:1	у1:a
с:Венеция	у:4	т:с	р:ж	и:7	у1:a
с:Вениамин	у:7	т:с	р:м	о:о	и:1	у1:a
с:Вера	у:2	т:с	р:ж	о:о	и:1	у1:a
с:Верея	у:5	т:с	р:ж	и:6	у1:b	фп:.м
с:Вермонт	у:5	т:с	р:м	и:1	у1:a
с:Вернер	у:2	т:с	р:м	о:о	и:1	у1:a
с:Вероника	у:4	т:с	р:ж	о:о	и:3	у1:a
с:Вероника	у:6	т:с	р:ж	о:о	и:3	у1:a
с:Версаль	у:5	т:с	р:м	и:2	у1:a
с:Верхнеуральск	у:9	т:с	р:м	и:3	у1:a
с:Верховажье	у:7	т:с	р:с	и:6	у1:a	ч
с:Верховина	у:7	т:с	р:ж	и:1	у1:a	фр:D0%92%D0%B5%D1%80%D1%85%D0%BE%D0%B2%D0%B8%D0%BD%D0%B0_)	слсч://ru.wikipedia.org/wiki/
с:Верхотурье	у:7	т:с	р:с	и:6	у1:a	ч
с:Ветлужский	у:5	т:с	т2:п	р:м	и:3	у1:a
с:Вёшенская	у:2	т:с	т2:п	р:ж	и:3	у1:a	фн:^с
с:Видин	у:2	т:с	р:м	и:1	у1:a	фр:D0%92%D0%B8%D0%B4%D0%B8%D0%BD_)	слсч://ru.wikipedia.org/wiki/
с:Видное	у:2	т:с	т2:п	р:с	и:1	у1:a
с:Викарий	у:4	т:с	р:м	о:о	и:7	у1:a	до:26
с:Википедия	у:6	т:с	р:ж	и:7	у1:a
с:Викисловарь	у:9	т:с	р:м	и:2	у1:b
с:Викитека	у:6	т:с	р:ж	и:1	у1:a
с:Вики	у:2	т:с	р:ж	о:о
с:Виктория	у:5	т:с	р:ж	о:о	и:7	у1:a
с:Виктор	у:2	т:с	р:м	о:о	и:1	у1:a
с:Вилли	у:2	т:с	р:м	о:о
с:Виллози	у:2	т:с	р:ж	фр:D0%92%D0%B8%D0%BB%D0%BB%D0%BE%D0%B7%D0%B8 _)	слсч:http://ru.wikipedia.org/wiki/
с:Виллози	у:7	т:с	р:м	и:0
с:Вилл	у:2	т:с	р:м	о:о	и:1	у1:a
с:Вильгельм	у:6	т:с	р:м	о:о	и:1	у1:a
с:Вильнюс	у:2	т:с	р:м	и:1	у1:a
с:Вильям	у:2	т:с	р:м	о:о	и:1	у1:a
с:Винзили	у:7	т:с	мн	р:м	и:2	у1:b	з:http://ru.wikipedia.org/wiki/Винзили
с:Винярки	у:4	т:с	мн	р:ж	и:3	у1:a	ч
с:Виргиния	у:5	т:с	р:ж	и:7	у1:a
с:Вирджиния	у:6	т:с	р:ж	о:о	и:7	у1:a
с:Висконсин	у:5	т:с	р:м	и:1	у1:a
с:Вислава	у:2	т:с	р:ж	и:1	у1:a
с:Виталий	у:4	т:с	р:м	о:о	и:7	у1:a	до:26
с:Витальевна	у:4	т:с	р:ж	о:о	и:1	у1:a	ч
с:Вита	у:2	т:с	р:ж	о:о	и:1	у1:a
с:Витино	у:2	т:с	р:с	и:1	у1:a
с:Вит	у:2	т:с	р:м	о:о	и:1	у1:a
с:Витязь	у:2	т:с	р:м	о:о	и:2	у1:a
с:Витя	у:2	т:с	р:м	рм:ж	о:о	и:2	у1:a
с:Вишера	у:2	т:с	р:ж	и:1	у1:a
с:ВКонтакте	у:6	т:с	р:ж	и:0
с:Влада	у:3	т:с	р:ж	о:о	и:1	у1:a
с:Владивосток	у:10	т:с	р:м	и:3	у1:a
с:Владикавказ	у:10	т:с	р:м	и:1	у1:a
с:Владик	у:3	т:с	р:м	о:о	и:3	у1:a
с:Владимир-Волынский	у:13.5	т:п	и:3	у1:a	гпр:Владимир-Волынский	фз:^к	фн:^с
с:Владимир	у:5	т:с	р:м	о:о	и:1	у1:a
с:Владислав	у:8	т:с	р:м	о:о	и:1	у1:a
с:Влад	у:3	т:с	р:м	о:о	и:1	у1:a
с:Власиха	у:3	т:с	р:ж	и:3	у1:a
с:Властелина	у:8	т:с	р:ж	о:о	и:1	у1:a
с:Внуково	у:3	т:с	р:с	и:1	у1:a
с:Вова	у:2	т:с	р:м	рм:ж	о:о	и:1	у1:a
с:Водоканал	у:8	т:с	р:м	и:1	у1:a
с:Вожаёль	у:5	т:с	р:ж	и:8	у1:a	з:поселок сельского типа, Княжпогостский район Республики Коми
с:Волга	у:2	т:с	р:ж	и:3	у1:a
с:Волгоград	у:8	т:с	р:м	и:1	у1:a
с:Волгодонск	у:7	т:с	р:м	и:3	у1:a
с:Волгореченск	у:7	т:с	р:м	и:1	у1:a
с:Вологда	у:2	т:с	р:ж	и:1	у1:a	фп:.м
с:Володя	у:4	т:с	р:м	рм:ж	о:о	и:2	у1:a
с:Волоколамск	у:8	т:с	р:м	и:3	у1:a
с:Волхов	у:2	т:с	р:м	и:1	у1:a	з:город, ударение по Википедии
с:Вольво	у:2	т:с	р:ж	и:0
с:Вольск	у:2	т:с	р:м	и:3	у1:a
с:Вольфганг	у:2	т:с	р:м	о:о	и:3	у1:a
с:Вольф	у:2	т:с	р:м	о:о	и:1	у1:a
с:Воркута	у:7	т:с	р:ж	и:1	у1:b	фп:.м
с:Воронеж	у:4	т:с	р:м	и:4	у1:a
с:Вороново	у:2	т:с	р:с	и:1	у1:a
с:Всеволод	у:3	т:с	р:м	о:о	и:1	у1:a
с:Всеслав	у:6	т:с	р:м	о:о	и:1	у1:a
с:Вурнары	у:5	т:с	мн	р:ж	и:1	у1:a
с:Выборг	у:2	т:с	р:м	и:3	у1:a
с:Выкса	у:2	т:с	р:ж	и:1	у1:a
с:Вытегра	у:2	т:с	р:ж	и:1	у1:a
с:Вычегда	у:2	т:с	р:ж	и:1	у1:a
с:Вышгород	у:2	т:с	р:м	и:1	у1:a
с:Вьетнам	у:6	т:с	р:м	и:1	у1:a
с:Вязники	у:2	т:с	мн	р:м	и:3	у1:a	з:ударение предположительно
с:Вязьма	у:2	т:с	р:ж	и:1	у1:a	ч
с:Вячеслав	у:7	т:с	р:м	о:о	и:1	у1:a	до:27
с:Гаага	у:3	т:с	р:ж	и:3	у1:a
с:Гавайи	у:4	т:с	мн	р:м	и:6	у1:a
с:Гавана	у:4	т:с	р:ж	и:1	у1:a
с:Гавриил	у:6	т:с	р:м	о:о	и:1	у1:a
с:Гаврила	у:5	т:с	р:м	рм:ж	о:о	и:1	у1:a
с:Гаврилов	у:5	т:п	т2:мс	и:1	у1:a
с:Гаити	у:3	т:с	р:м	и:0
с:Гай	у:2	т:с	р:м	о:о	и:1	у1:a
с:Галина	у:4	т:с	р:ж	о:о	и:1	у1:a
с:Галич	у:2	т:с	р:м	и:4	у1:a
с:Галя	у:2	т:с	р:ж	о:о	и:2	у1:a
с:Гамлет	у:2	т:с	р:м	о:о	и:1	у1:a
с:Ганза	у:2	т:с	р:ж	и:1	у1:a
с:Ганна	у:2	т:с	р:ж	о:о	и:1	у1:a
с:Ганнибал	у:7	т:с	р:м	о:о	и:1	у1:a
с:Ганс	у:2	т:с	р:м	о:о	и:1	у1:a
с:Гарик	у:2	т:с	р:м	о:о	и:3	у1:a
с:Гари	у:2	т:с	р:м	о:о	и:0
с:Гарольд	у:2	т:с	р:м	о:о	и:1	у1:a
с:Гаррисон	у:2	т:с	р:м	о:о	и:1	у1:a
с:Гаррис	у:2	т:с	р:м	о:о	и:1	у1:a
с:Гарри	у:2	т:с	р:м	о:о
с:Гаспра	у:2	т:с	р:ж	и:1	у1:a
с:Гатчина	у:2	т:с	р:ж	и:1	у1:a
с:Гваделупа	у:7	т:с	р:ж	и:1	у1:a
с:Гватемала	у:7	т:с	р:ж	и:1	у1:a
с:Гвинея	у:5	т:с	р:ж	и:6	у1:a
с:Гдов	у:3	т:с	р:м	и:1	у1:a
с:Гедеон	у:5	т:с	р:м	о:о	и:1	у1:a
с:Гектор	у:2	т:с	р:м	о:о	и:1	у1:a
с:Геленджик	у:8	т:с	р:м	и:3	у1:b
с:Гельсингфорс	у:10	т:с	р:м	и:1	у1:a
с:Гена	у:2	т:с	р:м	рм:ж	о:о	и:1	у1:a
с:Геннадий	у:5	т:с	р:м	о:о	и:7	у1:a	до:26
с:Генриетта	у:6	т:с	р:ж	о:о	и:1	у1:a
с:Генрих	у:2	т:с	р:м	о:о	и:3	у1:a
с:Генуя	у:2	т:с	р:ж	и:7	у1:a
с:Георгий	у:3	т:с	р:м	о:о	и:7	у1:a
с:Георг	у:3	т:с	р:м	о:о	и:3	у1:a
с:Геракл	у:4	т:с	р:м	о:о	и:1	у1:a
с:Герберт	у:2	т:с	р:м	о:о	и:1	у1:a
с:Герда	у:2	т:с	р:ж	о:о	и:1	у1:a
с:Германия	у:5	т:с	р:ж	и:7	у1:a
с:Герман	у:2	т:с	р:м	о:о	и:1	у1:a
с:Гермес	у:5	т:с	р:м	о:о	и:1	у1:a
с:Герта	у:2	т:с	р:ж	о:о	и:1	у1:a
с:Герт	у:2	т:с	р:м	о:о	и:1	у1:a
с:Герцеговина	у:9	т:с	р:ж	и:1	у1:a
с:Герц	у:2	т:с	р:м	о:о	и:1	у1:a
с:Гжель	у:3	т:с	р:ж	и:8	у1:a
с:Гибралтар	у:8	т:с	р:м	и:1	у1:a
с:Гималаи	у:6	т:с	мн	р:м	и:7	у1:a
с:Гита	у:2	т:с	р:ж	о:о	и:1	у1:a
с:Гладковщина	у:3	т:с	р:ж	и:1	у1:a
с:Глазго	у:3	т:с	р:м	и:0
с:Глебовское	у:3	т:с	т2:п	р:с	и:1	у1:a
с:Глеб	у:3	т:с	р:м	о:о	и:1	у1:a
с:Глогув	у:3	т:с	р:м	и:1	у1:a
с:ГЛОНАСС	у:5	т:с	р:м	и:1	у1:a
с:Глория	у:3	т:с	р:ж	о:о	и:7	у1:a
с:Глухарёв	у:7	т:п	т2:мс	и:1	у1:a	з:переулок в Москве
с:Говард	у:2	т:с	р:м	о:о	и:1	у1:a
с:Гога	у:2	т:с	р:м	рм:ж	о:о	и:3	у1:a
с:Голицыно	у:4	т:с	р:с	и:1	у1:a
с:Голландия	у:5	т:с	р:ж	и:7	у1:a
с:Голливуд	у:7	т:с	р:м	и:1	у1:a
с:Гомель	у:2	т:с	р:м	и:2	у1:a
с:Гондурас	у:7	т:с	р:м	и:1	у1:a
с:Гонконг	у:5	т:с	р:м	и:3	у1:a
с:Гораций	у:4	т:с	р:м	о:о	и:7	у1:a
с:Гордон	у:2	т:с	р:м	о:о	и:1	у1:a
с:Горно-Алтайск	у:10.2	т:с	р:м	и:3	у1:a
с:Горький	у:2	т:с	т2:п	р:м	и:3	у1:a
с:Госдеп	у:5	т:с	р:м	и:1	у1:a
с:Госдума	у:5	т:с	р:ж	и:1	у1:a
с:Гостомель	у:5	т:с	р:м	и:2	у1:a
с:Гоша	у:2	т:с	р:м	рм:ж	о:о	и:4	у1:a
с:Грайворон	у:3	т:с	р:м	и:1	у1:a
с:Грамотеино	у:7	т:с	р:с	и:1	у1:a
с:Грац	у:3	т:с	р:м	и:5	у1:a
с:Грегори	у:3	т:с	р:м	о:о	и:0
с:Грег	у:3	т:с	р:м	о:о	и:3	у1:a
с:Грейс	у:3	т:с	р:ж	о:о
с:Гренландия	у:6	т:с	р:ж	и:7	у1:a
с:Грета	у:3	т:с	р:ж	о:о	и:1	у1:a
с:Гретхен	у:3	т:с	р:ж	о:о	и:0
с:Греция	у:3	т:с	р:ж	и:7	у1:a
с:Григорий	у:5	т:с	р:м	о:о	и:7	у1:a	до:26
с:Григория	у:5	т:с	р:ж	о:о	и:7	у1:a
с:Гринпис	у:6	т:с	р:м	и:1	у1:a
с:Гриша	у:3	т:с	р:м	рм:ж	о:о	и:4	у1:a
с:Гродно	у:3	т:с	р:м	и:0
с:Грозный	у:3	т:с	т2:п	р:м	и:1	у1:a	ч
с:Грузия	у:3	т:с	р:ж	и:7	у1:a
с:Гуам	у:3	т:с	р:м	и:1	у1:a
с:Гузель	у:4	т:с	р:ж	о:о	и:0	вар:1
с:Гузель	у:4	т:с	р:ж	о:о	и:8	у1:a	вар:2
с:ГУИН	у:3	т:с	р:с
с:Гуляй-поле	у:8.4	т:с	р:с	и:2	у1:c	фп:.м
с:Гурзуф	у:5	т:с	р:м	и:1	у1:a
с:Густав	у:2	т:с	р:м	о:о	и:1	у1:a
с:Густомой	у:7	т:с	р:м	и:6	у1:a
с:Гусь-Железный	у:7.2	т:с	т2:п	р:м	и:1	у1:a	фр:D0%93%D1%83%D1%81%D1%8C-%D0%96%D0%B5%D0%BB%D0%B5%D0%B7%D0%BD%D1%8B%D0%B9_)	слсч://ru.wikipedia.org/wiki/
с:Гусь-Хрустальный	у:11.2	т:с	т2:п	р:м	и:1	у1:a	ч
с:Гусятников	у:4	т:п	т2:мс	и:1	у1:a	з:переулок в Москве
с:ГУФСИН	у:5	т:с	р:с
с:ГЭС	у:2	т:с	р:ж	и:0
с:Гюльчатай	у:8	т:с	р:ж	о:о	и:0
с:Давид-Городок	у:12.4	т:с	р:м	и:3	у1:b	ч
с:Давид	у:4	т:с	р:м	о:о	и:1	у1:a
с:Давлет	у:5	т:с	р:м	о:о	и:1	у1:a
с:Дагестан	у:7	т:с	р:м	и:1	у1:a
с:Даламан	у:6	т:с	р:м	и:1	у1:a	з:район и город в Турции
с:Дали	у:2	т:с	р:м	и:0	з:город в Китае
с:Даллас	у:2	т:с	р:м	и:1	у1:a
с:Далмация	у:5	т:с	р:ж	и:7	у1:a
с:Далянь	у:4	т:с	р:м	и:2	у1:a	з:город в Китае
с:Дамаск	у:4	т:с	р:м	и:3	у1:a
с:Дамир	у:4	т:с	р:м	о:о	и:1	у1:a
с:Дана	у:2	т:с	р:ж	о:о	и:1	у1:a
с:Данбери	у:2	т:с	р:м	и:0
с:Даниел	у:5	т:с	р:м	о:о	и:1	у1:a
с:Даниель	у:5	т:с	р:м	о:о	и:2	у1:a
с:Даниил	у:5	т:с	р:м	о:о	и:1	у1:a
с:Данила	у:4	т:с	р:м	рм:ж	о:о	и:1	у1:a
с:Данилов	у:4	т:с	р:м	и:1	у1:a
с:Данило	у:4	т:с	р:м	о:о	и:0
с:Даниэль	у:5	т:с	р:м	о:о	и:2	у1:a
с:Дания	у:2	т:с	р:ж	и:7	у1:a
с:Данков	у:5	т:с	р:м	и:1	у1:a	з:ударение по википедии: http://ru.wikipedia.org/wiki/Данков
с:Дарий	у:2	т:с	р:м	о:о	и:7	у1:a
с:Дарина	у:4	т:с	р:ж	о:о	и:1	у1:a
с:Дармштадт	у:7	т:с	р:м	и:1	у1:a
с:Дарья	у:2	т:с	р:ж	о:о	и:6	у1:a
с:Даугавпилс	у:2	т:с	р:м	и:1	у1:a
с:Даша	у:2	т:с	р:ж	о:о	и:4	у1:a
с:Двуречье	у:5	т:с	р:с	и:6	у1:a	ч
с:Дебби	у:2	т:с	р:ж	о:о
с:Дебёсы	у:4	т:с	мн	р:ж	и:1	у1:a	з:село в России, административный центр Дебёсского района Удмуртской республики
с:Делавэр	у:6	т:с	р:м	и:1	у1:a
с:Дели	у:2	т:с	р:м	и:0
с:Демид	у:4	т:с	р:м	о:о	и:1	у1:a
с:Демосфен	у:7	т:с	р:м	о:о	и:1	у1:a
с:Демьян	у:5	т:с	р:м	о:о	и:1	у1:a
с:Денвер	у:2	т:с	р:м	и:1	у1:a
с:Денем	у:2	т:с	р:м	и:1	у1:a
с:Дениз	у:4	т:с	р:ж	о:о
с:Денис	у:4	т:с	р:м	о:о	и:1	у1:a
с:Денни	у:2	т:с	р:м	о:о	и:0
с:Ден	у:2	т:с	р:м	о:о	и:1	у1:a
с:Дербент	у:5	т:с	р:м	и:1	у1:a
с:Дерек	у:2	т:с	р:м	о:о	и:3	у1:a
с:Детройт	у:5	т:с	р:м	и:1	у1:a
с:Джава	у:3	т:с	р:ж	и:1	у1:a	з:язык программирования
с:Джакомо	у:5	т:с	р:м	о:о	и:0
с:Джамбулат	у:8	т:с	р:м	о:о	и:1	у1:a
с:Джанет	у:3	т:с	р:ж	о:о
с:Джафар	у:5	т:с	р:м	о:о	и:1	у1:a
с:Джейд	у:3	т:с	р:ж	о:о
с:Джейк	у:3	т:с	р:м	о:о	и:3	у1:a
с:Джеймс	у:3	т:с	р:м	о:о	и:1	у1:a
с:Джейн	у:3	т:с	р:ж	о:о
с:Джейсон	у:3	т:с	р:м	о:о	и:1	у1:a
с:Джексон	у:3	т:с	р:м	о:о	и:1	у1:a
с:Дженифер	у:3	т:с	р:ж	о:о
с:Дженни	у:3	т:с	р:ж	о:о
с:Дженнифер	у:3	т:с	р:ж	о:о
с:Джеральд	у:3	т:с	р:м	о:о	и:1	у1:a
с:Джером	у:5	т:с	р:м	о:о	и:1	у1:a
с:Джерри	у:3	т:с	р:м	о:о
с:Джессика	у:3	т:с	р:ж	о:о	и:3	у1:a
с:Джесси	у:3	т:с	р:ж	о:о
с:Джеф	у:3	т:с	р:м	о:о	и:1	у1:a
с:Джеффри	у:3	т:с	р:м	о:о	и:0
с:Джефф	у:3	т:с	р:м	о:о	и:1	у1:a
с:Джибути	у:7	т:с	р:ж	и:0	з:республика
с:Джилл	у:3	т:с	р:ж	о:о
с:Джима	у:3	т:с	р:ж	о:о	и:1	у1:a
с:Джим	у:3	т:с	р:м	о:о	и:1	у1:a
с:Джина	у:3	т:с	р:ж	о:о	и:1	у1:a
с:Джоанна	у:4	т:с	р:ж	о:о	и:1	у1:a
с:Джоан	у:4	т:с	р:ж	о:о
с:Джозеф	у:3	т:с	р:м	о:о	и:1	у1:a
с:Джонатан	у:3	т:с	р:м	о:о	и:1	у1:a
с:Джонни	у:3	т:с	р:м	о:о
с:Джонсон	у:3	т:с	р:м	о:о	и:1	у1:a
с:Джонс	у:3	т:с	р:м	о:о	и:1	у1:a
с:Джон	у:3	т:с	р:м	о:о	и:1	у1:a
с:Джорджия	у:3	т:с	р:ж	и:7	у1:a
с:Джордж	у:3	т:с	р:м	о:о	и:1	у1:a
с:Джошуа	у:3	т:с	р:м	о:о	и:0
с:Джудит	у:3	т:с	р:ж	о:о
с:Джуди	у:3	т:с	р:ж	о:о
с:Джузеппе	у:5	т:с	р:м	о:о	и:0
с:Джули	у:3	т:с	р:ж	о:о
с:Джулия	у:3	т:с	р:ж	о:о	и:7	у1:a
с:Джульетта	у:6	т:с	р:ж	о:о	и:1	у1:a
с:Джун	у:3	т:с	р:ж	о:о
с:Джэксонвилл	у:3	т:с	р:м	и:1	у1:a
с:Дзержинск	у:6	т:с	р:м	и:3	у1:a
с:Диана	у:3	т:с	р:ж	о:о	и:1	у1:a
с:Диего	у:3	т:с	р:м	о:о	и:0
с:Дилан	у:2	т:с	р:м	о:о	и:1	у1:a
с:Дилия	у:5	т:с	р:ж	о:о	и:7	у1:b
с:Диллан	у:2	т:с	р:м	о:о	и:1	у1:a
с:Диллон	у:2	т:с	р:м	о:о	и:1	у1:a
с:Дима	у:2	т:с	р:м	рм:ж	о:о	и:1	у1:a
с:Димитрий	у:4	т:с	р:м	о:о	и:7	у1:a
с:Димитровград	у:11	т:с	р:м	и:1	у1:a
с:Дим	у:2	т:с	р:м	о:о	и:1	у1:a
с:Дина	у:2	т:с	р:ж	о:о	и:1	у1:a
с:Дионис	у:5	т:с	р:м	о:о	и:1	у1:a
с:Дисли	у:2	т:с	р:м	и:0
с:Диснейленд	у:8	т:с	р:м	и:1	у1:a
с:Дисней	у:5	т:с	р:м	и:6	у1:a
с:Дмитриев	у:3	т:с	р:м	и:1	у1:a	з:дмитриев-льговский
с:Дмитрий	у:3	т:с	р:м	о:о	и:7	у1:a
с:Дмитров	у:3	т:с	р:м	и:1	у1:a
с:Днепродзержинск	у:12.3	т:с	р:м	и:3	у1:a
с:Днепропетровск	у:11.3	т:с	р:м	и:3	у1:a
с:Днепр	у:3	т:с	р:м	и:1	у1:f
с:Добрыня	у:5	т:с	р:м	рм:ж	о:о	и:2	у1:a
с:Дойч-Кальтенбрун	у:7.2	т:с	р:м	и:1	у1:a
с:Дойч-Шютцен-Айзенберг	у:13.7	т:с	р:м	и:3	у1:a
с:Долгопрудный	у:8	т:с	т2:п	р:м	и:1	у1:a	ч
с:Долорес	у:4	т:с	р:ж	о:о	и:0
с:Доминик	у:6	т:с	р:м	о:о	и:3	у1:a
с:Домодедово	у:6	т:с	р:с	и:1	у1:a
с:Дональд	у:2	т:с	р:м	о:о	и:1	у1:a
с:Донбасс	у:5	т:с	р:м	и:1	у1:a
с:Донецк	у:4	т:с	р:м	и:3	у1:a
с:Донна	у:2	т:с	р:ж	о:о	и:1	у1:a
с:Дон	у:2	т:с	р:м	и:1	у1:a
с:Дора	у:2	т:с	р:ж	о:о	и:1	у1:a
с:Дорис	у:2	т:с	р:ж	о:о
с:Дороти	у:2	т:с	р:ж	о:о
с:Дорсет	у:2	т:с	р:м	и:1	у1:a
с:Дракула	у:3	т:с	р:м	рм:ж	о:о	и:1	у1:a
с:Дрезден	у:3	т:с	р:м	и:1	у1:a
с:Дрезна	у:3	т:с	р:ж	и:1	у1:a	ч
с:Дубай	у:4	т:с	р:м	и:4	у1:a
с:Дублин	у:2	т:с	р:м	и:1	у1:a
с:Дубна	у:5	т:с	р:ж	и:1	у1:d	фп:.м
с:Дубно	у:5	т:с	р:м	и:0
с:Дубно	у:5	т:с	р:с	и:0
с:Дубровка	у:5	т:с	р:ж	и:3	у1:a	ч
с:Дуванкуль	у:7	т:с	р:м	и:2	у1:a
с:Дуглас	у:2	т:с	р:м	о:о	и:1	у1:a
с:Дуня	у:2	т:с	р:ж	о:о	и:2	у1:a
с:Духовщина	у:7	т:с	р:ж	и:1	у1:a	з:город в России, административный центр Духовщинского района Смоленской области
с:Душанбе	у:7	т:с	р:м	и:0
с:Дэвид	у:2	т:с	р:м	о:о	и:1	у1:a
с:Дэвис	у:2	т:с	р:м	о:о	и:1	у1:a
с:Дэйв	у:2	т:с	р:м	о:о	и:1	у1:a
с:Дэниел	у:2	т:с	р:м	о:о	и:1	у1:a
с:Дэнни	у:2	т:с	р:м	о:о
с:Дэн	у:2	т:с	р:м	о:о	и:1	у1:a
с:Дэу	у:2	т:с	р:ж	и:0
с:Дюртюли	у:7	т:с	мн	р:м	и:2	у1:b	з:город в России, административный центр Дюртюлинского района Башкортостана
с:Дюссельдорф	у:9	т:с	р:м	и:1	у1:a
с:Дятьково	у:2	т:с	р:с	и:1	у1:a
с:Ева	у:1	т:с	р:ж	о:о	и:1	у1:a
с:Евгений	у:4	т:с	р:м	о:о	и:7	у1:a	до:26
с:Евгения	у:4	т:с	р:ж	о:о	и:7	у1:a
с:Евклид	у:5	т:с	р:м	о:о	и:1	у1:a
с:Евпатий	у:4	т:с	р:м	о:о	и:7	у1:a	до:26
с:Евпатория	у:6	т:с	р:ж	и:7	у1:a
с:Евразия	у:4	т:с	р:ж	и:7	у1:a
с:Евровидение	у:6.1	т:с	р:с	и:7	у1:a
с:Еврокомиссия	у:8.1	т:с	р:ж	и:7	у1:a
с:Евромайдан	у:9.1	т:с	р:м	и:1	у1:a
с:Евронет	у:6	т:с	р:м	и:1	у1:a
с:Евроньюс	у:7	т:с	р:м	и:1	у1:a
с:Европа	у:4	т:с	р:ж	и:1	у1:a
с:Евросеть	у:6	т:с	р:ж	и:8	у1:e
с:Евросовет	у:8.1	т:с	р:м	и:1	у1:a
с:Евросоюз	у:7.1	т:с	р:м	и:1	у1:a
с:Египет	у:3	т:с	р:м	и:1	у1:a	ч
с:Егла	у:4	т:с	р:ж	и:1	у1:d
с:Егор	у:3	т:с	р:м	о:о	и:1	у1:a
с:Егорьевск	у:3	т:с	р:м	и:3	у1:a
с:Ейск	у:1	т:с	р:м	и:3	у1:a
с:Екатерина	у:7	т:с	р:ж	о:о	и:1	у1:a
с:Екатеринбург	у:10	т:с	р:м	и:3	у1:a
с:Елабуга	у:3	т:с	р:ж	и:3	у1:a
с:Елань-Коленовский	у:12.3	т:с	т2:п	р:м	и:1	у1:a
с:Елань	у:3	т:с	р:ж	и:8	у1:a
с:Елена	у:3	т:с	р:ж	о:о	и:1	у1:a
с:Елизавета	у:7	т:с	р:ж	о:о	и:1	у1:a
с:Елисей	у:5	т:с	р:м	о:о	и:1	у1:a
с:Еманжелинск	у:8	т:с	р:м	и:1	у1:a
с:Емеля	у:3	т:с	р:м	рм:ж	о:о	и:2	у1:a
с:Енисей	у:5	т:с	р:м	и:6	у1:a
с:Ереван	у:5	т:с	р:м	и:1	у1:a
с:Ермак	у:4	т:с	р:м	о:о	и:3	у1:a
с:Ернур	у:4	т:с	р:м	о:о	и:1	у1:a
с:Ефим	у:3	т:с	р:м	о:о	и:1	у1:a
с:Жак	у:2	т:с	р:м	о:о	и:3	у1:a
с:Жанат	у:4	т:с	р:ж	о:о	и:0
с:Жан-Клод	у:7	т:с	р:м	о:о	и:1	у1:a
с:Жанна	у:2	т:с	р:ж	о:о	и:1	у1:a
с:Жан	у:2	т:с	р:м	о:о	и:1	у1:a
с:Жасмина	у:5	т:с	р:ж	о:о	и:1	у1:a
с:Женева	у:4	т:с	р:ж	и:1	у1:a
с:Женя	у:2	т:с	р:ж	о:о	и:2	у1:a
с:Женя	у:2	т:с	р:м	рм:ж	о:о	и:2	у1:a
с:Жозефина	у:6	т:с	р:ж	о:о	и:1	у1:a
с:Жора	у:2	т:с	р:м	рм:ж	о:о	и:1	у1:a
с:Жорж	у:2	т:с	р:м	о:о	и:1	у1:a
с:Жостово	у:2	т:с	р:с	и:1	у1:a
с:Жуковский	у:4	т:с	т2:п	р:м	и:3	у1:a
с:Жюль	у:2	т:с	р:м	о:о	и:2	у1:a
с:Жюстина	у:5	т:с	р:ж	о:о	и:1	у1:a
с:Забава	у:4	т:с	р:ж	о:о	и:1	у1:a
с:Забайкалье	у:7	т:с	р:с	и:5	у1:a	ч
с:Заборово	у:4	т:с	р:с
с:Заводское	у:8	т:с	т2:п	р:с	и:1	у1:a
с:Закубежье	у:6	т:с	р:с	и:6	у1:a	ч
с:Залина	у:4	т:с	р:ж	о:о	и:1	у1:a
с:Зальцбург	у:2	т:с	р:м	и:3	у1:a
с:Замленье	у:5	т:с	р:с	и:6	у1:a	ч	з:ударение проставлено по наитию
с:Замоскворечье	у:10	т:с	р:с	и:6	у1:a	ч
с:Заозёрное	у:5	т:с	т2:п	р:с	и:1	у1:a
с:Заплюсье	у:5	т:с	р:с	и:6	у1:a	ч
с:Заполярпромгражданстрой	у:22.6.10.17	т:с	р:м	и:6	у1:a
с:Запорожье	у:6	т:с	р:с	и:6	у1:a	ч
с:Зара	у:2	т:с	р:ж	о:о	и:1	у1:a
с:Заречье	у:4	т:с	р:с	и:6	у1:a	ч
с:Зарина	у:4	т:с	р:ж	о:о	и:1	у1:a
с:Заубер	у:2	т:с	р:м	и:1	у1:a
с:Захария	у:4	т:с	р:м	рм:ж	о:о	и:7	у1:a
с:Захар	у:4	т:с	р:м	о:о	и:1	у1:a
с:Звенигород	у:5	т:с	р:м	и:1	у1:a
с:Зеландия	у:4	т:с	р:ж	и:7	у1:a
с:Зеленогорск	у:8	т:с	р:м	и:3	у1:a
с:Земляничное	у:7	т:с	т2:п	р:с	и:1	у1:a
с:Зея	у:2	т:с	р:ж	и:6	у1:a	з:город в Амурской области России
с:Зимбабве	у:5	т:с	р:с	и:0
с:Зинаида	у:5	т:с	р:ж	о:о	и:1	у1:a
с:Зина	у:2	т:с	р:ж	о:о	и:1	у1:a
с:Зинка	у:2	т:с	р:ж	о:о	и:3	у1:a	ч
с:Зиновий	у:4	т:с	р:м	о:о	и:6	у1:a	до:26
с:Злата	у:3	т:с	р:ж	о:о	и:1	у1:a
с:Златоуст	у:6	т:с	р:м	и:1	у1:a
с:Злынка	у:3	т:с	р:ж	и:3	у1:a	ч
с:Знаменка	у:3	т:с	р:ж	и:3	у1:a	ч
с:Знобь-Новгородское	у:13.3	т:с	т2:п	р:с	и:3	у1:a
с:Золушка	у:2	т:с	р:ж	о:о	и:3	у1:a
с:Зося	у:2	т:с	р:ж	о:о	и:2	у1:a
с:Зоя	у:2	т:с	р:ж	о:о	и:2	у1:a
с:Зубен	у:2	т:с	р:м	и:1	у1:a
с:Зугдиди	у:5	т:с	р:м	и:0
с:Зугрэс	у:5	т:с	р:м	и:1	у1:a
с:Зюраткуль	у:4	т:с	р:м	и:2	у1:e
с:Ибрагим	у:6	т:с	р:м	о:о	и:1	у1:a
с:Ибреси	у:4	т:с	р:м	и:0	з:посёлок, административный центр Ибресинского района Чувашии
с:Иванков	у:3	т:с	р:м	и:1	у1:a	з:ударение по википедии
с:Иванко	у:3	т:с	р:м	о:о	и:0
с:Иваново	у:3	т:с	р:с	и:1	у1:a
с:Иван	у:3	т:с	р:м	о:о	и:1	у1:a
с:Ивдель	у:1	т:с	р:м	и:2	у1:a	з:город
с:Игнатий	у:4	т:с	р:м	о:о	и:7	у1:a	до:26
с:Игнат	у:4	т:с	р:м	о:о	и:1	у1:a
с:Игорь	у:1	т:с	р:м	о:о	и:2	у1:a
с:Ида	у:1	т:с	р:ж	о:о	и:1	у1:a
с:Идель	у:3	т:с	р:ж	и:8	у1:a	з:топоним, склонение предположительно
с:Иегова	у:4	т:с	р:м	рм:ж	о:о	и:1	у1:a
с:Иероним	у:6	т:с	р:м	о:о	и:1	у1:a
с:Иерусалим	у:8	т:с	р:м	и:1	у1:a
с:Ижевск	у:3	т:с	р:м	и:3	у1:a
с:Изабелла	у:5	т:с	р:ж	о:о	и:1	у1:a
с:Изабель	у:5	т:с	р:ж	о:о	и:0
с:Износки	у:4	т:с	мн	р:м	и:3	у1:a	з:село в Калужской области
с:Израиль	у:4	т:с	р:м	и:2	у1:a
с:Изяслав	у:6	т:с	р:м	о:о	и:1	у1:a
с:Изя	у:1	т:с	р:м	рм:ж	о:о	и:2	у1:a
с:Иисус	у:4	т:с	р:м	о:о	и:1	у1:a
с:Икша	у:1	т:с	р:ж	и:4	у1:a
с:Илек	у:3	т:с	р:м	и:3	у1:a	з:село в Оренбургской области на реке Илек
с:Илларион	у:7	т:с	р:м	о:о	и:1	у1:a
с:Иллинойс	у:6	т:с	р:м	и:1	у1:a
с:Ильдан	у:5	т:с	р:м	о:о	и:1	у1:a
с:Илья	у:4	т:с	р:м	рм:ж	о:о	и:6	у1:b	ч	до:29
с:Иммануил	у:7	т:с	р:м	о:о	и:1	у1:a
с:Инвернесс	у:7	т:с	р:м	и:1	у1:a
с:Инга	у:1	т:с	р:ж	о:о	и:3	у1:a
с:Ингрид	у:1	т:с	р:ж	о:о	и:0
с:Ингушетия	у:6	т:с	р:ж	и:7	у1:a
с:Индианаполис	у:7	т:с	р:м	и:1	у1:a
с:Индиана	у:5	т:с	р:ж	и:1	у1:a
с:Индия	у:1	т:с	р:ж	и:7	у1:a
с:Индонезия	у:6	т:с	р:ж	и:7	у1:a
с:Инесса	у:3	т:с	р:ж	о:о	и:1	у1:a
с:Инна	у:1	т:с	р:ж	о:о	и:1	у1:a
с:Иннокентий	у:6	т:с	р:м	о:о	и:7	у1:a	до:26
с:Инсбрук	у:1	т:с	р:м	и:3	у1:a
с:Инской	у:5	т:с	т2:п	р:м	и:3	у1:b
с:Инстаграм	у:8	т:с	р:м	и:1	у1:a
с:Инта	у:1	т:с	р:ж	и:1	у1:a
с:Интерфакс	у:7	т:с	р:м	и:1	у1:a
с:Иоанна	у:3	т:с	р:ж	о:о	и:1	у1:a
с:Иоанн	у:3	т:с	р:м	о:о	и:1	у1:a
с:Иоганна	у:4	т:с	р:ж	о:о	и:1	у1:a
с:Иоганн	у:4	т:с	р:м	о:о	и:1	у1:a
с:Иоланда	у:4	т:с	р:ж	о:о	и:1	у1:a
с:Иона	у:2	т:с	р:м	рм:ж	о:о	и:1	у1:a
с:Иордан	у:5	т:с	р:м	и:1	у1:a
с:Иосиф	у:2	т:с	р:м	о:о	и:1	у1:a
с:Ипполит	у:6	т:с	р:м	о:о	и:1	у1:a
с:Ираёль	у:4	т:с	р:м	и:2	у1:a	з:посёлок городского типа в Коми
с:Ирак	у:3	т:с	р:м	и:1	у1:a
с:Иран	у:3	т:с	р:м	и:1	у1:a
с:Ира	у:1	т:с	р:ж	о:о	и:1	у1:a
с:Ирена	у:3	т:с	р:ж	о:о	и:1	у1:a
с:Ирен	у:3	т:с	р:ж	о:о	и:0
с:Ирина	у:3	т:с	р:ж	о:о	и:1	у1:a
с:Иркутск	у:4	т:с	р:м	и:3	у1:a
с:Иркут	у:4	т:с	р:м	и:1	у1:a
с:Ирландия	у:4	т:с	р:ж	и:7	у1:a
с:Иртыш	у:4	т:с	р:м	и:4	у1:b
с:Ирэн	у:3	т:с	р:ж	о:о
с:Исаак	у:4	т:с	р:м	о:о	и:3	у1:a
с:Исаклы	у:6	т:с	мн	р:м	и:1	у1:a
с:Исеть	у:3	т:с	р:ж	и:8	у1:a
с:Искья	у:1	т:с	р:ж	и:6	у1:a	ч
с:Исландия	у:4	т:с	р:ж	и:7	у1:a
с:Исмаил	у:5	т:с	р:м	о:о	и:1	у1:a
с:Испания	у:4	т:с	р:ж	и:7	у1:a
с:Иссык-Куль	у:8.4	т:с	р:м	и:2	у1:a
с:Истра	у:1	т:с	р:ж	и:1	у1:a
с:Италия	у:3	т:с	р:ж	и:7	у1:a
с:ИТК	у:1	т:с	р:ж
с:ИФНС	у:1	т:с	р:ж	и:0
с:Ишимбай	у:6	т:с	р:м	и:6	у1:a
с:Ишим	у:3	т:с	р:м	и:1	у1:a
с:Ия	у:1	т:с	р:ж	о:о	и:2	у1:a
с:Йемен	у:2	т:с	р:м	и:1	у1:a
с:Йоль	у:2	т:с	р:м	и:2	у1:a	з:средневековый праздник зимнего солнцеворота у германских народов
с:Йошкар-Ола	у:10.5	т:с	р:ж	и:1	у1:b
с:Йыхви	у:2	т:с	р:м	и:0
с:Кабардино-Балкария	у:15.7	т:с	р:ж	и:7	у1:a
с:Кабачи	у:6	т:с	мн	р:м	и:4	у1:b
с:Каблуково	у:7	т:с	р:с	и:1	у1:a
с:Кабмин	у:5	т:с	р:м	и:1	у1:a	з:Кабинет министров
с:Кавказ	у:5	т:с	р:м	и:1	у1:a
с:Кадиллак	у:7	т:с	р:м	и:3	у1:a
с:Кадый	у:4	т:с	р:м	и:1	у1:a	з:посёлок городского типа в Костромской области России
с:Казань	у:4	т:с	р:ж	и:8	у1:a
с:Казахстан	у:8	т:с	р:м	и:1	у1:a
с:Казимира	у:6	т:с	р:ж	о:о	и:1	у1:a
с:Казимир	у:6	т:с	р:м	о:о	и:1	у1:a
с:Казым-Мыс	у:8.4	т:с	р:м	и:1	у1:a
с:Каинкуль	у:6	т:с	р:м	и:2	у1:a
с:Кайкос	у:2	т:с	р:м	и:1	у1:a
с:Кайманов	у:5	т:п	т2:мс	и:1	у1:a	з:Каймановы острова
с:Калахари	у:6	т:с	р:ж	и:0
с:Калининград	у:10	т:с	р:м	и:1	у1:a
с:Калиновка	у:4	т:с	р:ж	и:3	у1:a	ч
с:Калифорния	у:6	т:с	р:ж	и:7	у1:a
с:Каллисто	у:8	т:с	р:ж	и:0
с:Калуга	у:4	т:с	р:ж	и:3	у1:a
с:Калязин	у:4	т:с	р:м	и:1	у1:a
с:КАМАЗ	у:4	т:с	р:м	и:1	у1:a
с:Кама	у:2	т:с	р:ж	и:1	у1:a
с:Каменец-Подольский	у:12.6	т:п	и:3	у1:a	гпр:Каменец-Подольский	фз:^к	фн:^с
с:Камень-Рыболов	у:13.2	т:с	р:м	и:1	у1:a
с:Камерун	у:6	т:с	р:м	и:1	у1:a
с:Камешково	у:2	т:с	р:с	и:1	у1:a
с:Камилла	у:4	т:с	р:ж	о:о	и:1	у1:a
с:Камиль	у:4	т:с	р:м	о:о	и:2	у1:a
с:Камчатка	у:5	т:с	р:ж	и:3	у1:a	ч
с:Камыш-заря	у:10.4	т:с	р:ж	и:2	у1:a	фп:.м
с:Камышин	у:4	т:с	р:м	и:1	у1:a
с:Камышла	у:4	т:с	р:ж	и:1	у1:a	з:село в Самарской области
с:Канада	у:4	т:с	р:ж	и:1	у1:a
с:Канака	у:4	т:с	р:ж	и:3	у1:a
с:Канары	у:4	т:с	мн	р:ж	и:1	у1:a
с:Кангалассы	у:7	т:с	мн	р:м	и:1	у1:a	з:посёлок городского типа в Якутии; ударение предположительно
с:Канзас	у:5	т:с	р:м	и:1	у1:a
с:Канны	у:2	т:с	мн	р:ж	и:1	у1:a
с:Карабашмедь	у:9.6	т:с	р:ж	и:8	у1:a
с:Карабаш	у:6	т:с	р:м	и:4	у1:b
с:Караганда	у:9	т:с	р:ж	и:1	у1:b	фп:.м
с:Каракас	у:4	т:с	р:м	и:1	у1:a	з:столица Венесуэлы
с:Карата	у:4	т:с	р:ж	и:1	у1:a
с:Карачаево-Черкессия	у:15.6	т:с	р:ж	и:7	у1:a
с:Карачи	у:4	т:с	р:м	и:0
с:Карелия	у:4	т:с	р:ж	и:7	у1:a
с:Карен	у:2	т:с	р:ж	о:о
с:Карен	у:4	т:с	р:ж	о:о	и:0
с:Карен	у:4	т:с	р:м	о:о	и:1	у1:a
с:Карибы	у:4	т:с	мн	р:ж	и:1	у1:a
с:Карлос	у:2	т:с	р:м	о:о	и:1	у1:a
с:Карло	у:2	т:с	р:м	о:о	и:0
с:Карл	у:2	т:с	р:м	о:о	и:1	у1:a
с:Кармен	у:2	т:с	р:ж	о:о
с:Кармен	у:5	т:с	р:ж	о:о	и:0
с:Каролина	у:6	т:с	р:ж	о:о	и:1	у1:a
с:Карпаты	у:5	т:с	мн	р:ж	и:1	у1:a
с:Карпогоры	у:7	т:с	мн	р:м	и:1	у1:a
с:Карп	у:2	т:с	р:м	о:о	и:1	у1:a
с:Карсы	у:2	т:с	мн	р:м	и:1	у1:a
с:Картахенского	у:7	т:с	р:м	и:0
с:Касли	у:5	т:с	мн	р:м	и:2	у1:b	з:город в Челябинской области
с:Каспийск	у:5	т:с	р:м	и:3	у1:a
с:Кася	у:2	т:с	р:ж	о:о	и:2	у1:a
с:Катав-ивановск	у:9.4	т:с	р:м	и:3	у1:a
с:Каталония	у:6	т:с	р:ж	и:7	у1:a
с:Катангли	у:8	т:с	р:м	и:0
с:Катарина	у:6	т:с	р:ж	о:о	и:1	у1:a
с:Катерина	у:6	т:с	р:ж	о:о	и:1	у1:a
с:Катовице	у:6	т:с	р:м	и:0
с:Катрин	у:5	т:с	р:ж	о:о	и:0
с:Катунки	у:7	т:с	мн	р:м	и:3	у1:b	ч	з:рабочий посёлок в Чкаловском районе Нижегородской области России
с:Кахетия 	у:4	т:с	р:ж	и:7	у1:a
с:Кацивели	у:6	т:с	р:м	и:0
с:Кача	у:2	т:с	р:ж	и:4	у1:a
с:Качканар	у:7	т:с	р:м	и:1	у1:a
с:Кашары	у:4	т:с	мн	р:ж	и:1	у1:a	з:ударение предположительно
с:Квебек	у:5	т:с	р:м	и:3	у1:a
с:Кевин	у:2	т:с	р:м	о:о	и:1	у1:a
с:Кейкос	у:2	т:с	р:м	и:1	у1:a
с:Кейн	у:2	т:с	р:м	о:о	и:1	у1:a
с:Кейт	у:2	т:с	р:ж	о:о
с:Келли	у:2	т:с	р:ж	о:о
с:Кембридж	у:2	т:с	р:м	и:4	у1:a	з:город в Англии
с:Кемерово	у:2	т:с	р:с	и:1	у1:a
с:Кенай	у:4	т:с	р:м	и:6	у1:a
с:Кентербери	у:2	т:с	р:м	и:0
с:Кентукки	у:5	т:с	р:м	и:0
с:Кен	у:2	т:с	р:м	о:о	и:1	у1:a
с:Керженец	у:2	т:с	р:м	и:5	у1:a	ч
с:Керкира	у:2	т:с	р:ж	и:1	у1:a
с:Керчь	у:2	т:с	р:ж	и:8	у1:f2	фп:.м
с:Кесов	у:2	т:п	т2:мс	и:1	у1:a	з:Кесова Гора
с:Кзыл-Орда	у:9.3	т:с	р:ж	и:1	у1:b
с:Киев	у:2	т:с	р:м	и:1	у1:a
с:Кизел	у:2	т:с	р:м	и:1	у1:a
с:Килемары	у:6	т:с	мн	р:ж	и:1	у1:a	з:посёлок городского типа в России, административный центр Килемарского района Марий Эл
с:Кильмезь	у:6	т:с	р:ж	и:8	у1:a
с:Кимры	у:2	т:с	мн	р:ж	и:1	у1:a	з:http://ru.wikipedia.org/wiki/Кимры
с:Ким	у:2	т:с	р:ж	о:о
с:Ким	у:2	т:с	р:м	о:о	и:1	у1:a
с:Кингисепп	у:7	т:с	р:м	и:1	у1:a	з:город в Ленинградской области
с:Кинель-Черкассы	у:12.4	т:с	мн	р:ж	и:1	у1:a
с:Кинешма	у:2	т:с	р:ж	и:1	у1:a
с:Кипр	у:2	т:с	р:м	и:1	у1:a
с:Кира	у:2	т:с	р:ж	о:о	и:1	у1:a
с:Киргизия	у:5	т:с	р:ж	и:7	у1:a
с:Киргиз-Мияки	у:12.5	т:с	мн	р:м	и:3	у1:b
с:Киржач	у:5	т:с	р:м	и:7	у1:b
с:Кирибати	у:6	т:с	р:ж	и:0	з:ударение по Википедии
с:Кирилл	у:4	т:с	р:м	о:о	и:1	у1:a
с:Кириши	у:2	т:с	мн	р:м	и:4	у1:a
с:Кировград	у:8	т:с	р:м	и:1	у1:a
с:Кирово-чепецк 	у:9.2	т:с	р:м	и:3	у1:a
с:Киров	у:2	т:с	р:м	и:1	у1:a
с:Кисегач	у:6	т:с	р:м	и:4	у1:b
с:Кисегач	у:6	т:с	р:м	и:4	у1:b
с:Кисловодск	у:7	т:с	р:м	и:3	у1:a
с:Китай-город	у:8.4	т:с	р:м	и:1	у1:c	ос:1	фп:.м
с:Китай	у:4	т:с	р:м	и:6	у1:a
с:Кито	у:2	т:с	р:м	и:0
с:Кишинёв	у:6	т:с	р:м	и:1	у1:a
с:Клава	у:3	т:с	р:ж	о:о	и:1	у1:a
с:Клавдий	у:3	т:с	р:м	о:о	и:7	у1:a
с:Клавдия	у:3	т:с	р:ж	о:о	и:7	у1:a
с:Клайд	у:3	т:с	р:м	о:о	и:1	у1:a
с:Клара	у:3	т:с	р:ж	о:о	и:1	у1:a
с:Клаудия	у:3	т:с	р:ж	о:о	и:7	у1:a
с:Клаус	у:3	т:с	р:м	о:о	и:1	у1:a
с:Клеопатра	у:6	т:с	р:ж	о:о	и:1	у1:a
с:Клер	у:3	т:с	р:ж	о:о	и:0
с:Клим	у:3	т:с	р:м	о:о	и:1	у1:a
с:Клинт	у:3	т:с	р:м	о:о	и:1	у1:a
с:Клинцы	у:6	т:с	мн	р:м	и:5	у1:b	ч	з:город в России, административный центр Клинцовского района Брянской области
с:Клэр	у:3	т:с	р:ж	о:о
с:Ключи	у:5	т:с	мн:от	р:м	и:4	у1:b
с:Кобелячек	у:6	т:с	р:м	и:3	у1:a	ч
с:Кобулети	у:6	т:с	р:м	и:0
с:Ковент-Гарден	у:9.2	т:с	р:м	и:1	у1:a
с:Ковров	у:5	т:с	р:м	и:1	у1:a	з:город во Владимирской области
с:Когалымавиа	у:8.6	т:с	р:ж	и:0
с:Когалым	у:6	т:с	р:м	и:1	у1:a
с:Козельщина	у:4	т:с	р:ж	и:1	у1:a
с:Коктебель	у:7	т:с	р:м	и:2	у1:a
с:Колашин	у:4	т:с	р:м	и:1	у1:a
с:Коломна	у:4	т:с	р:ж	и:1	у1:a	ч
с:Колорадо	у:6	т:с	р:м	и:0
с:Колпны	у:2	т:с	мн	р:м	и:1	у1:a
с:Колумбия	у:4	т:с	р:ж	и:7	у1:a
с:Колумбус	у:4	т:с	р:м	и:1	у1:a
с:Колывань	у:6	т:с	р:ж	и:8	у1:a
с:Коля	у:2	т:с	р:м	рм:ж	о:о	и:2	у1:a
с:Ком-Омбо	у:5.2	т:с	р:м	и:0
с:Конго	у:2	т:с	р:м	и:0
с:Конг	у:2	т:с	р:м	о:о	и:3	у1:a
с:Кондоль	у:2	т:с	р:м	и:2	у1:a
с:Кондопога	у:2	т:с	р:ж	и:3	у1:a
с:Кондопога	у:7	т:с	р:ж	и:3	у1:a
с:Кондратий	у:6	т:с	р:м	о:о	и:7	у1:a	до:26
с:Кондрат	у:6	т:с	р:м	о:о	и:1	у1:a
с:Коннектикут	у:5	т:с	р:м	и:1	у1:a
с:Конни	у:2	т:с	р:ж	о:о
с:Конни	у:2	т:с	р:м	о:о
с:Конотоп	у:6	т:с	р:м	и:1	у1:a	з:город на Украине
с:Конрад	у:2	т:с	р:м	о:о	и:1	у1:a
с:Констанс	у:6	т:с	р:ж	о:о
с:Константинополь	у:11	т:с	р:м	и:2	у1:a
с:Константин	у:9	т:с	р:м	о:о	и:1	у1:a
с:Констанца	у:6	т:с	р:ж	и:5	у1:a
с:Копейск	у:4	т:с	р:м	и:3	у1:a
с:Кордова	у:2	т:с	р:ж	и:1	у1:a	з:город в Испании
с:Кореиз	у:5	т:с	р:м	и:1	у1:a
с:Корея	у:4	т:с	р:ж	и:6	у1:a
с:Корней	у:5	т:с	р:м	о:о	и:1	у1:a
с:Корнелий	у:5	т:с	р:м	о:о	и:7	у1:a	до:26
с:Корнелиус	у:5	т:с	р:м	о:о	и:1	у1:a
с:Корогод	у:6	т:с	р:м	и:1	у1:a
с:Королёв	у:6	т:с	р:м	и:1	у1:a
с:Короча	у:6	т:с	р:ж	и:4	у1:b	фп:.м
с:Корсика	у:2	т:с	р:ж	и:3	у1:a
с:Корсика	у:2	т:с	р:ж	и:3	у1:a
с:Корфу	у:2	т:с	р:с	и:0
с:Корфу	у:5	т:с	р:с	и:0
с:Коряжма	у:4	т:с	р:ж	и:1	у1:a	ч	фп:.м
с:Косово	у:2	т:с	р:с	и:1	у1:a
с:Коста-Рика	у:8.2	т:с	р:ж	и:3	у1:a
с:Кострома	у:8	т:с	р:ж	и:1	у1:b	фп:.м
с:Костя	у:2	т:с	р:м	рм:ж	о:о	и:2	у1:a
с:Кот-д-Ивуар	у:10.2	т:с	р:м	и:1	у1:a
с:Коттенем	у:2	т:с	р:м	и:1	у1:a
с:Коувола	у:2	т:с	р:ж	и:1	у1:a	з:город в Финляндии
с:Кохма	у:2	т:с	р:ж	и:1	у1:a
с:Кош-Агач	у:7.2	т:с	р:м	и:4	у1:a
с:Кошехабль	у:6	т:с	р:м	и:2	у1:a	з:аул в Адыгее
с:Кошице	у:2	т:с	р:м	и:0
с:Крайслер	у:3	т:с	р:м	и:1	у1:a
с:Красногорск	у:8	т:с	р:м	и:3	у1:a
с:Краснодар	у:8	т:с	р:м	и:1	у1:a
с:Краснотурьинск	у:8.3	т:с	р:м	и:3	у1:a
с:Красноярск	у:7	т:с	р:м	и:3	у1:a
с:Кременчуг	у:8	т:с	р:м	и:3	у1:b
с:Кристиан	у:7	т:с	р:м	о:о	и:1	у1:a
с:Кристийна	у:6	т:с	р:ж	и:1	у1:a
с:Кристина	у:6	т:с	р:ж	о:о	и:1	у1:a
с:Кристин	у:6	т:с	р:ж	о:о
с:Кристи	у:3	т:с	р:ж	о:о
с:Кристофер	у:3	т:с	р:м	о:о	и:1	у1:a
с:Крис	у:3	т:с	р:ж	о:о
с:Крис	у:3	т:с	р:м	о:о	и:1	у1:a
с:Кромы	у:3	т:с	мн	р:м	и:1	у1:a
с:Крым	у:3	т:с	р:м	и:1	у1:a	п2
с:Ксения	у:3	т:с	р:ж	о:о	и:7	у1:a
с:Кстово	у:4	т:с	р:с	и:1	у1:a
с:Куала-Лумпур	у:8.3	т:с	р:м	и:1	у1:a
с:Кубань	у:4	т:с	р:ж	и:8	у1:a
с:Куба	у:2	т:с	р:ж	и:1	у1:a
с:Кувейт	у:4	т:с	р:м	и:1	у1:a
с:Кугеси	у:4	т:с	мн	р:м	и:2	у1:b	з:http://ru.wikipedia.org/wiki/Кугеси
с:Кудымкар	у:7	т:с	р:м	и:1	у1:a	з:город
с:Куеда	у:5	т:с	р:ж	и:1	у1:d	фп:.м	з:поселок и река в Пермском крае
с:Кузьма	у:6	т:с	р:м	рм:ж	о:о	и:1	у1:b	до:29
с:Куйбышев	у:2	т:с	р:м	и:1	у1:a	з:город
с:Кулебаки	у:6	т:с	мн	р:ж	и:3	у1:a	з:http://ru.wikipedia.org/wiki/Кулебаки
с:Кулевчи	у:4	т:с	мн	р:м	и:4	у1:a
с:Кумертау	у:7	т:с	р:м	и:0
с:Кумёны	у:4	т:с	мн	р:м	и:1	у1:a	з:http://ru.wikipedia.org/wiki/Куменский_район_Кировской_области; окончание род.п. предположительно
с:Кунгур	у:5	т:с	р:м	и:1	у1:a
с:Куньмин	у:6	т:с	р:м	и:1	у1:a	з:город в Китае
с:Кунья	у:2	т:с	р:ж	и:6	у1:a	з:http://ru.wikipedia.org/wiki/Кунья
с:Курея	у:5	т:с	р:ж	и:6	у1:b	з:речка
с:Курортное	у:4	т:с	т2:п	р:с	и:1	у1:a
с:Курск	у:2	т:с	р:м	и:3	у1:a
с:Курт	у:2	т:с	р:м	о:о	и:1	у1:a
с:Куса	у:4	т:с	р:ж	и:1	у1:c	з:http://ru.wikipedia.org/wiki/Куса
с:Кутаиси	у:5	т:с	р:м	и:0
с:Кызыл-Орда	у:10.4	т:с	р:ж	и:1	у1:c
с:Кызыл	у:4	т:с	р:м	и:1	у1:a
с:Кыргызстан	у:9	т:с	р:м	и:1	у1:a
с:Кырджали	у:2	т:с	р:м	и:0
с:Кыштым	у:5	т:с	р:м	и:1	у1:a
с:Кэндис	у:2	т:с	р:ж	о:о
с:Кэролайн	у:2	т:с	р:ж	о:о
с:Кэрол	у:2	т:с	р:ж	о:о
с:Кэти	у:2	т:с	р:ж	о:о
с:Кэти	у:2	т:с	р:ж	о:о
с:Кэти	у:2	т:с	р:ж	о:о
с:Кэтлин	у:2	т:с	р:ж	о:о
с:Кэтрин	у:2	т:с	р:ж	о:о
с:Кяхта	у:2	т:с	р:ж	и:1	у1:a
с:Лабытнанги	у:7	т:с	р:м	и:0	з:http://ru.wikipedia.org/wiki/Лабытнанги
с:Лавр	у:2	т:с	р:м	о:о	и:1	у1:a
с:Лагань	у:4	т:с	р:ж	и:8	у1:a	з:склонение по гуглу; ударение предположительно
с:Лада	у:2	т:с	р:ж	о:о	и:1	у1:a
с:Ладога	у:2	т:с	р:ж	и:3	у1:a
с:Лазарь	у:2	т:с	р:м	о:о	и:2	у1:a
с:Лана	у:2	т:с	р:ж	о:о	и:1	у1:a
с:Лантарь	у:5	т:с	р:ж	и:8	у1:a
с:Лаос	у:3	т:с	р:м	и:1	у1:a
с:Лариса	у:4	т:с	р:ж	о:о	и:1	у1:a
с:Ларри	у:2	т:с	р:м	о:о	и:0
с:Лас-Вегас	у:6.2	т:с	р:м	и:1	у1:a
с:Латвия	у:2	т:с	р:ж	и:7	у1:a
с:Лаура	у:2	т:с	р:ж	о:о	и:1	у1:a
с:Лаура	у:3	т:с	р:ж	о:о	и:1	у1:a
с:Лая	у:2	т:с	р:ж	и:6	у1:a	з:http://ru.wikipedia.org/wiki/Лая
с:Леа	у:2	т:с	р:ж	о:о	и:0
с:Лебедянь	у:6	т:с	р:ж	и:8	у1:a	з:http://ru.wikipedia.org/wiki/Лебедянь
с:Лев	у:2	т:с	р:м	о:о	и:1	у1:b	ч
с:Лейпциг	у:2	т:с	р:м	и:3	у1:a
с:Лексус	у:2	т:с	р:м	и:1	у1:a
с:Лена	у:2	т:с	р:ж	о:о	и:1	у1:a
с:Ленина	у:4	т:с	р:ж	о:о	и:1	у1:a
с:Ленинград	у:8	т:с	р:м	и:1	у1:a
с:Лениногорск	у:8	т:с	р:м	и:3	у1:a
с:Ленино	у:2	т:с	р:с	и:1	у1:a
с:Леонардо	у:5	т:с	р:м	о:о	и:0
с:Леонард	у:5	т:с	р:м	о:о	и:1	у1:a
с:Леона	у:3	т:с	р:ж	о:о	и:1	у1:a
с:Леонид	у:5	т:с	р:м	о:о	и:1	у1:a
с:Леон	у:3	т:с	р:м	о:о	и:1	у1:a
с:Леопольд	у:5	т:с	р:м	о:о	и:1	у1:a
с:Лео	у:2	т:с	р:м	о:о
с:Лера	у:2	т:с	р:ж	о:о	и:1	у1:a
с:Лея	у:2	т:с	р:ж	о:о	и:2	у1:a
с:Лианна	у:3	т:с	р:ж	о:о	и:1	у1:a
с:Либерия	у:4	т:с	р:ж	и:7	у1:a
с:Ливадия	у:4	т:с	р:ж	и:7	у1:a
с:Ливерпуль	у:7	т:с	р:м	и:2	у1:a
с:Ливия	у:2	т:с	р:ж	и:7	у1:a
с:Ливны	у:2	т:с	мн	р:ж	и:1	у1:a	ч
с:Лида	у:2	т:с	р:ж	о:о	и:1	у1:a
с:Лидия	у:2	т:с	р:ж	о:о	и:7	у1:a
с:Лиза	у:2	т:с	р:ж	о:о	и:1	у1:a
с:Лизетта	у:4	т:с	р:ж	о:о	и:1	у1:a
с:Лиз	у:2	т:с	р:ж	о:о	и:0
с:Лика	у:2	т:с	р:ж	о:о	и:3	у1:a
с:Лилиан	у:2	т:с	р:ж	о:о
с:Лилиан	у:5	т:с	р:ж	о:о	и:0
с:Лилит	у:4	т:с	р:ж	о:о
с:Лилия	у:2	т:с	р:ж	о:о	и:7	у1:a
с:Лиля	у:2	т:с	р:ж	о:о	и:2	у1:a
с:Лимасол	у:6	т:с	р:м	и:1	у1:a	вар:1
с:Лимассол	у:7	т:с	р:м	и:1	у1:a	вар:2
с:Лина	у:2	т:с	р:ж	о:о	и:1	у1:a
с:Линда	у:2	т:с	р:ж	о:о	и:1	у1:a
с:Линн	у:2	т:с	р:м	о:о	и:1	у1:a
с:Липецк	у:2	т:с	р:м	и:3	у1:a
с:Лира	у:2	т:с	р:ж	о:о	и:1	у1:a
с:Лиссабон	у:7	т:с	р:м	и:1	у1:a
с:Литва	у:5	т:с	р:ж	и:1	у1:b
с:Литин	у:2	т:с	р:м	и:1	у1:a
с:Лихтенштейн	у:9	т:с	р:м	и:1	у1:a
с:Лия	у:2	т:с	р:ж	о:о	и:7	у1:a
с:Лобня	у:2	т:с	р:ж	и:2	у1:a	ч
с:Лозовая	у:4	т:с	т2:п	р:ж	и:1	у1:a
с:Лола	у:2	т:с	р:ж	о:о	и:1	у1:a
с:Лолита	у:4	т:с	р:ж	о:о	и:1	у1:a
с:Лондон-Бридж	у:10.2	т:с	р:м	и:4	у1:a
с:Лондон	у:2	т:с	р:м	и:1	у1:a
с:Лора	у:2	т:с	р:ж	о:о	и:1	у1:a
с:Лорен	у:2	т:с	р:ж	о:о
с:Лорен	у:4	т:с	р:ж	о:о	и:0
с:Лорето	у:4	т:с	р:м	и:0	з:город в Италии
с:Лори	у:2	т:с	р:ж	о:о
с:Лори	у:2	т:с	р:ж	о:о
с:Лос-Анджелес	у:5.2	т:с	р:м	и:1	у1:a
с:Лувр	у:2	т:с	р:м	и:1	у1:a
с:Луганск	у:4	т:с	р:м	и:1	у1:a
с:Луга	у:2	т:с	р:ж	и:3	у1:a
с:Луиджи	у:3	т:с	р:м	о:о	и:0
с:Луиза	у:3	т:с	р:ж	о:о	и:1	у1:a
с:Луизиана	у:6	т:с	р:ж	и:1	у1:a
с:Луис	у:3	т:с	р:м	о:о	и:1	у1:a
с:Луи	у:3	т:с	р:м	о:о	и:0
с:Лука	у:4	т:с	р:м	рм:ж	о:о	и:3	у1:b	до:29
с:Лусия	у:4	т:с	р:ж	о:о	и:7	у1:a
с:Лысьва	у:2	т:с	р:ж	и:1	у1:a
с:Лыхны	у:2	т:с	р:м	и:0	з:село в Абхазии
с:Львов	у:4	т:с	р:м	и:1	у1:a
с:Льгов	у:4	т:с	р:м	и:1	у1:a	з:http://ru.wikipedia.org/wiki/Льгов
с:Льюис	у:3	т:с	р:м	о:о	и:1	у1:a
с:Любань	у:2	т:с	р:ж	и:8	у1:a	з:в Белоруссии
с:Любань	у:4	т:с	р:ж	и:8	у1:a	з:в России
с:Люба	у:2	т:с	р:ж	о:о	и:1	у1:a
с:Люберцы	у:2	т:с	мн	р:ж	и:5	у1:a	ч
с:Люблино	у:7	т:с	р:с	и:1	у1:b
с:Любовь	у:4	т:с	р:ж	о:о	и:8	у1:a
с:Любомир	у:6	т:с	р:м	о:о	и:1	у1:a
с:Любомль	у:4	т:с	р:м	и:2	у1:a
с:Людвиг	у:2	т:с	р:м	о:о	и:3	у1:a
с:Людмила	у:5	т:с	р:ж	о:о	и:1	у1:a
с:Люксембург	у:8	т:с	р:м	и:3	у1:a
с:Люси	у:4	т:с	р:ж	о:о
с:Люся	у:2	т:с	р:ж	о:о	и:2	у1:a
с:Мавритания	у:7	т:с	р:ж	и:7	у1:a
с:Магадан	у:6	т:с	р:м	и:1	у1:a
с:Магда	у:2	т:с	р:ж	о:о	и:1	у1:a
с:Магнитогорск	у:9	т:с	р:м	и:3	у1:a
с:Магомет	у:6	т:с	р:м	о:о	и:1	у1:a
с:Мадагаскар	у:9	т:с	р:м	и:1	у1:a
с:Мадейра	у:4	т:с	р:ж	и:1	у1:a
с:Мадлен	у:5	т:с	р:ж	о:о	и:0
с:Мадонна	у:4	т:с	р:ж	о:о	и:1	у1:a
с:Мадрид	у:5	т:с	р:м	и:1	у1:a
с:Майкл	у:2	т:с	р:м	о:о	и:1	у1:a
с:Майкоп	у:5	т:с	р:м	и:1	у1:a
с:Майкрософт	у:2	т:с	р:м	и:1	у1:a
с:Майк	у:2	т:с	р:м	о:о	и:3	у1:a
с:Майнц	у:2	т:с	р:м	о:о	и:5	у1:a
с:Май	у:2	т:с	р:м	о:о	и:1	у1:a
с:Майя	у:2	т:с	р:ж	о:о	и:2	у1:a
с:Макарска	у:4	т:с	р:ж	и:3	у1:a	ч	з:город в Хорватии
с:Макар	у:4	т:с	р:м	о:о	и:1	у1:a
с:Макарьев	у:4	т:с	р:м	и:1	у1:a
с:Макдоналдс	у:5	т:с	р:м	и:1	у1:a
с:Македония	у:6	т:с	р:ж	и:7	у1:a
с:Макеевка	у:4	т:с	р:ж	и:3	у1:a	ч
с:Максим	у:5	т:с	р:м	о:о	и:1	у1:a
с:Макс	у:2	т:с	р:м	о:о	и:1	у1:a
с:Малави	у:4	т:с	р:ж	и:0	з:республика
с:Малага	у:2	т:с	р:ж	и:3	у1:a
с:Малайзия	у:4	т:с	р:ж	и:7	у1:a
с:Малибу	у:6	т:с	р:м	и:0
с:Мали	у:4	т:с	р:ж	и:0	з:республика
с:Малореченское	у:6	т:с	т2:п	р:с	и:3	у1:a
с:Мальвина	у:6	т:с	р:ж	о:о	и:1	у1:a
с:Мальдивы	у:6	т:с	мн	р:ж	и:1	у1:a
с:Мальта	у:2	т:с	р:ж	и:1	у1:a
с:Манама	у:4	т:с	р:ж	и:1	у1:a	з:столица Бахрейна
с:Маневичи	у:4	т:с	мн	р:м	и:4	у1:a
с:Манежка	у:4	т:с	р:ж	и:3	у1:a	ч	з:разг._ Манежная площадь
с:Мануэль	у:5	т:с	р:м	о:о	и:2	у1:a
с:Манхэттен	у:5	т:с	р:м	и:1	у1:a
с:Манчестер	у:5	т:с	р:м	и:1	у1:a
с:Маньчжурия	у:7	т:с	р:ж	и:7	у1:a
с:Маня	у:2	т:с	р:ж	о:о	и:2	у1:a
с:Мао	у:2	т:с	р:м	о:о	и:0
с:Марат	у:4	т:с	р:м	о:о	и:1	у1:a
с:Марбелья	у:5	т:с	р:ж	и:6	у1:a	ч	з:город в Испании, ударение по Википедии
с:Марвин	у:2	т:с	р:м	о:о	и:1	у1:a
с:Маргарет	у:2	т:с	р:ж	о:о	и:0
с:Маргарита	у:7	т:с	р:ж	о:о	и:1	у1:a
с:Марго	у:5	т:с	р:ж	о:о	и:0
с:Маргрета	у:6	т:с	р:ж	о:о	и:1	у1:a
с:Мардохей	у:7	т:с	р:м	о:о	и:6	у1:a	з:библейский персонаж
с:Марек	у:2	т:с	р:м	о:о	и:3	у1:a
с:Мариам	у:5	т:с	р:ж	о:о	и:0
с:Марианна	у:5	т:с	р:ж	о:о	и:1	у1:a
с:Марина	у:4	т:с	р:ж	о:о	и:1	у1:a
с:Маринка	у:4	т:с	р:ж	о:о	и:3	у1:a
с:Марио	у:2	т:с	р:м	о:о	и:0
с:Мари	у:4	т:с	р:ж	о:о	и:0
с:Мария	у:4	т:с	р:ж	о:о	и:7	у1:a
с:Марко	у:2	т:с	р:м	о:о	и:0
с:Маркс	у:2	т:с	р:м	о:о	и:1	у1:a
с:Марк	у:2	т:с	р:м	о:о	и:3	у1:a
с:Маркус	у:2	т:с	р:м	о:о	и:1	у1:a
с:Марлен	у:5	т:с	р:ж	о:о
с:Марлен	у:5	т:с	р:м	о:о	и:1	у1:a
с:Марокко	у:4	т:с	р:м	и:0
с:Марсель	у:5	т:с	р:м	о:о	и:2	у1:a
с:Марс	у:2	т:с	р:м	и:1	у1:a
с:Марта	у:2	т:с	р:ж	о:о	и:1	у1:a
с:Мартина	у:5	т:с	р:ж	о:о	и:1	у1:a
с:Мартинес	у:5	т:с	р:м	о:о	и:1	у1:a
с:Мартин	у:2	т:с	р:м	о:о	и:1	у1:a
с:Маруся	у:4	т:с	р:ж	о:о	и:2	у1:a
с:Марфа	у:2	т:с	р:ж	о:о	и:1	у1:a
с:Маршаллов	у:5	т:п	т2:мс	и:1	у1:a	з:Маршалловы острова
с:Мары	у:4	т:с	р:м
с:Марьям	у:5	т:с	р:ж	о:о	и:0
с:Марьяна	у:5	т:с	р:ж	о:о	и:1	у1:a
с:Марья	у:2	т:с	р:ж	о:о	и:6	у1:a
с:Массандра	у:5	т:с	р:ж	и:1	у1:a
с:Массачусетс	у:7	т:с	р:м	и:1	у1:a
с:Матаки	у:6	т:с	мн	р:м	и:1	у1:b	з:Базарные Матаки
с:Матвей	у:5	т:с	р:м	о:о	и:1	у1:a
с:Матильда	у:4	т:с	р:ж	о:о	и:1	у1:a
с:Матфей	у:5	т:с	р:м	о:о	и:6	у1:a
с:Махачкала	у:9	т:с	р:ж	и:1	у1:b
с:Махмуд	у:5	т:с	р:м	о:о	и:1	у1:a
с:Маша	у:2	т:с	р:ж	о:о	и:4	у1:a
с:Мглин	у:4	т:с	р:м	и:1	у1:a
с:Меган	у:2	т:с	р:ж	о:о
с:Мегион	у:5	т:с	р:м	и:1	у1:a
с:Медея	у:4	т:с	р:ж	о:о	и:2	у1:a
с:Медынь	у:4	т:с	р:ж	и:8	у1:a	з:http://ru.wikipedia.org/wiki/Медынь
с:Межводное	у:5	т:с	т2:п	р:с	и:1	у1:a
с:Межгорье	у:5	т:с	р:с	и:6	у1:a	ч
с:Мезень	у:4	т:с	р:ж	и:8	у1:a	з:http://ru.wikipedia.org/wiki/Мезень
с:Мексика	у:2	т:с	р:ж	и:3	у1:a
с:Мелани	у:2	т:с	р:ж	о:о
с:Мельбурн	у:2	т:с	р:м	и:1	у1:a
с:Мемфис	у:2	т:с	р:м	и:1	у1:a
с:Менатеп	у:6	т:с	р:м	и:1	у1:a
с:Менкеря	у:5	т:с	р:ж	и:2	у1:a	з:ударение предположительно
с:Мери	у:2	т:с	р:ж	о:о
с:Меркурий	у:5	т:с	р:м	и:7	у1:a
с:Мерседес	у:7	т:с	р:м	и:1	у1:a
с:Мефодий	у:4	т:с	р:м	о:о	и:7	у1:a	до:26
с:Мехди	у:5	т:с	р:м	о:о	и:0
с:Мехико	у:2	т:с	р:м	и:0
с:Мец	у:2	т:с	р:м	и:5	у1:a
с:Миасс	у:3	т:с	р:м	и:1	у1:a
с:Мигия	у:5	т:с	р:ж	и:7	у1:b
с:Микки-Маус	у:8.2	т:с	р:м	о:о	и:1	у1:a
с:Микки	у:2	т:с	р:м	о:о	и:0
с:Микола	у:4	т:с	р:м	рм:ж	о:о	и:1	у1:a
с:Милан	у:4	т:с	р:м	и:1	у1:a
с:Мила	у:2	т:с	р:ж	о:о	и:1	у1:a
с:Милочка	у:2	т:с	р:ж	о:о	и:3	у1:a
с:Миляуша	у:5	т:с	р:ж	о:о	и:4	у1:a
с:Минас-Жерайс	у:10.2	т:с	р:м	и:1	у1:a	з:штат Бразилии
с:Мина	у:2	т:с	р:ж	о:о	и:1	у1:a
с:Минздравсоцразвития	у:16.7	т:с	р:с	и:0
с:Минздрав	у:7	т:с	р:м	и:1	у1:a
с:Минкомсвязи	у:9	т:с	р:с	и:0	вар:1
с:Минкомсвязь	у:9	т:с	р:ж	и:8	у1:a	вар:2
с:Миннесота	у:7	т:с	р:ж	и:1	у1:a
с:Минск	у:2	т:с	р:м	и:3	у1:a
с:Минусинск	у:6	т:с	р:м	и:3	у1:a
с:Минэкономразвития	у:14	т:с	р:с	и:0
с:Мирон	у:4	т:с	р:м	о:о	и:1	у1:a
с:Мирра	у:2	т:с	р:ж	о:о	и:1	у1:a
с:Миссисипи	у:7	т:с	р:ж	и:0	з:река
с:Миссисипи	у:7	т:с	р:м	и:0	з:штат США
с:Миссури	у:5	т:с	р:м	и:0
с:Мисхор	у:5	т:с	р:м	и:1	у1:a
с:Михаил	у:5	т:с	р:м	о:о	и:1	у1:a
с:Михайлов	у:4	т:с	р:м	и:1	у1:a
с:Михали	у:6	т:с	мн	р:м	и:2	у1:b	з:деревня в Московской области
с:Мицубиси	у:6	т:с	р:м	и:0
с:Мицуо	у:4	т:с	р:м	о:о	и:0
с:Мичиган	у:6	т:с	р:м	и:1	у1:a
с:Миша	у:2	т:с	р:м	рм:ж	о:о	и:4	у1:a
с:Мишель	у:4	т:с	р:ж	о:о
с:Могилёв	у:6	т:с	р:м	и:1	у1:a
с:Модульбанк	у:8	т:с	р:м	и:3	у1:a
с:Мозамбик	у:7	т:с	р:м	и:3	у1:a
с:Моздок	у:5	т:с	р:м	и:3	у1:a
с:Мозырь	у:2	т:с	р:м	и:2	у1:a	з:ударение по википедии: http://ru.wikipedia.org/wiki/Мозырь
с:Моисей	у:5	т:с	р:м	о:о	и:6	у1:a
с:Мойнаки	у:5	т:с	мн	р:ж	и:3	у1:a
с:Молдавия	у:5	т:с	р:ж	и:7	у1:a
с:Молдова	у:5	т:с	р:ж	и:1	у1:a
с:Молли	у:2	т:с	р:ж	о:о
с:Молодечно	у:6	т:с	р:с	и:0
с:Монако	у:4	т:с	р:с	и:0
с:Монастырщина	у:7	т:с	р:ж	и:1	у1:a	фр:D0%9C%D0%BE%D0%BD%D0%B0%D1%81%D1%82%D1%8B%D1%80%D1%89%D0%B8%D0%BD%D0%B0_)	слсч://ru.wikipedia.org/wiki/
с:Мона	у:2	т:с	р:ж	о:о	и:1	у1:a
с:Монголия	у:5	т:с	р:ж	и:7	у1:a
с:Моника	у:2	т:с	р:ж	о:о	и:3	у1:a
с:Монтана	у:5	т:с	р:ж	и:1	у1:a
с:Монтсеррат	у:9	т:с	р:м	и:1	у1:a
с:Мордовия	у:5	т:с	р:ж	и:7	у1:a
с:Мориарти	у:5	т:с	р:м	о:о	и:0
с:Морис	у:4	т:с	р:м	о:о	и:1	у1:a
с:Морки	у:2	т:с	мн	р:м	и:1	у1:a
с:Морское	у:6	т:с	т2:п	р:с	и:3	у1:a
с:Москва	у:6	т:с	р:ж	и:1	у1:b	ч
с:Мосфилоти	у:7	т:с	р:м	и:0	з:нас. пункт в Греции
с:Моше	у:4	т:с	р:м	о:о
с:Мста	у:4	т:с	р:ж	и:1	у1:b	фр:D0%9C%D1%81%D1%82%D0%B0)	слсч:http://ru.wikipedia.org/wiki/
с:Мстислав	у:7	т:с	р:м	о:о	и:1	у1:a
с:Мумбаи	у:5	т:с	р:м	и:0
с:Мумбай	у:5	т:с	р:м	и:6	у1:a
с:Мурат	у:4	т:с	р:м	о:о	и:1	у1:a
с:Мурманск	у:2	т:с	р:м	и:3	у1:a
с:Мурмаши	у:7	т:с	мн	р:м	и:4	у1:b
с:Муром	у:2	т:с	р:м	и:1	у1:a
с:Мурта	у:5	т:с	р:ж	и:1	у1:c	з:город Большая Мурта; ударение предположительно
с:Муса	у:4	т:с	р:м	рм:ж	о:о	и:1	у1:b	до:30
с:Мухаммед	у:7	т:с	р:м	о:о	и:1	у1:a
с:Мухоршибирь	у:7	т:с	р:ж	и:8	у1:a	з:ударение предположительно
с:МФУ	у:3	т:с	р:см	о:н
с:Мытищи	у:4	т:с	мн	р:ж	и:4	у1:a
с:Мышкин	у:2	т:с	р:м	и:1	у1:a
с:Мэн	у:2	т:с	р:м	и:1	у1:a
с:Мэриленд	у:2	т:с	р:м	и:1	у1:a
с:Мэри	у:2	т:с	р:ж	о:о
с:Мэтью	у:2	т:с	р:м	о:о	и:0
с:Мюнхен	у:2	т:с	р:м	и:1	у1:a
с:Нагасаки	у:6	т:с	р:м	и:0
с:Надежда	у:4	т:с	р:ж	о:о	и:1	у1:a
с:Надя	у:2	т:с	р:ж	о:о	и:2	у1:a
с:Назар	у:4	т:с	р:м	о:о	и:1	у1:a
с:Назрань	у:5	т:с	р:ж	и:8	у1:a
с:Наиля	у:5	т:с	р:ж	о:о	и:2	у1:b
с:Найроби	у:5	т:с	р:м	и:0
с:Нальчик	у:2	т:с	р:м	и:3	у1:a
с:Нана	у:2	т:с	р:ж	о:о	и:1	у1:a
с:Наполеон	у:7	т:с	р:м	о:о	и:1	у1:a
с:Нарва	у:2	т:с	р:ж	и:1	у1:a
с:Наро-Фоминск	у:9.2	т:с	р:м	и:1	у1:a
с:Нарьян-Мар	у:9.5	т:с	р:м	и:1	у1:a
с:НАСА	у:2	т:с	р:с
с:Насреддин	у:8	т:с	р:м	о:о	и:1	у1:a
с:Настасья	у:5	т:с	р:ж	о:о	и:6	у1:a
с:Натали	у:2	т:с	р:ж	о:о
с:Натали	у:6	т:с	р:ж	о:о	и:0
с:Наталья	у:4	т:с	р:ж	о:о	и:6	у1:a
с:Наташа	у:4	т:с	р:ж	о:о	и:4	у1:a
с:НАТО	у:2	т:с	р:с	и:0
с:Наум	у:3	т:с	р:м	о:о	и:1	у1:a
с:Неаполь	у:3	т:с	р:м	и:2	у1:a
с:Небраска	у:5	т:с	р:ж	и:3	у1:a	ч
с:Невада	у:4	т:с	р:ж	и:1	у1:a
с:Нева	у:4	т:с	р:ж	и:1	у1:d	фп:.м
с:Невель	у:2	т:с	р:м	и:2	у1:a	з:город
с:Невинномысск	у:9	т:с	р:м	и:3	у1:a
с:Некрасовка	у:5	т:с	р:ж	и:3	у1:a	ч
с:Нелли	у:2	т:с	р:ж	о:о	и:0
с:Немиров	у:4	т:с	р:м	и:1	у1:a
с:Немо	у:2	т:с	р:м	о:о	и:0
с:Непал	у:4	т:с	р:м	и:1	у1:a
с:Нептун	у:5	т:с	р:м	и:1	у1:a
с:Нерехта	у:2	т:с	р:ж	и:1	у1:a
с:Нерюнгри	у:2	т:с	р:м	и:0	з:http://ru.wikipedia.org/wiki/Нерюнгри
с:Нестле	у:6	т:с	р:ж	и:0
с:Нестор	у:2	т:с	р:м	о:о	и:1	у1:a
с:Неукен	у:5	т:с	р:м	и:1	у1:a	з:город в Аргентине
с:Нефтекамск	у:7	т:с	р:м	и:3	у1:a
с:Нефтеюганск	у:8	т:с	р:м	и:3	у1:a
с:Нечаевка	у:4	т:с	р:ж	и:3	у1:a	ч
с:Нея	у:2	т:с	р:ж	и:6	у1:a
с:Нигерия	у:4	т:с	р:ж	и:7	у1:a
с:Нигер	у:4	т:с	р:м	и:1	у1:a
с:Нидерланды	у:7	т:с	мн	р:м	и:1	у1:a
с:Нижневартовск	у:7	т:с	р:м	и:3	у1:a
с:Нижнекамск	у:7	т:с	р:м	и:3	у1:a
с:Нижнеудинск	у:6	т:с	р:м	и:3	у1:a
с:Никандров	у:4	т:п	т2:мс	и:1	у1:a	з:Никандрова Святоблаговещенская пустынь
с:Никарагуа	у:6	т:с	р:м	и:0
с:Ника	у:2	т:с	р:ж	о:о	и:3	у1:a
с:Никита	у:4	т:с	р:ж	и:1	у1:a	з:посёлок городского типа на южном берегу Крыма
с:Никита	у:4	т:с	р:м	рм:ж	о:о	и:1	у1:a	до:28
с:Никита	у:6	т:с	р:ж	о:о	и:0
с:Никифор	у:4	т:с	р:м	о:о	и:1	у1:a
с:Никки	у:2	т:с	р:ж	о:о
с:Николаевка	у:6	т:с	р:ж	и:3	у1:a	ч
с:Николай	у:6	т:с	р:м	о:о	и:1	у1:a
с:Никола	у:4	т:с	р:м	рм:ж	о:о	и:1	у1:a
с:Николози	у:6	т:с	р:м	о:о
с:Николо-Погост	у:11.4	т:с	р:м	и:1	у1:a
с:Никольский	у:4	т:п	и:3	у1:a	фз:^к	фн:^с	з:фамилия, улица, переулок
с:Николь	у:4	т:с	р:ж	о:о
с:Ник	у:2	т:с	р:м	о:о	и:3	у1:a
с:Нил	у:2	т:с	р:м	о:о	и:1	у1:a
с:Нилуфар	у:6	т:с	р:ж	о:о	и:0
с:Нина	у:2	т:с	р:ж	о:о	и:1	у1:a
с:Нино	у:4	т:с	р:ж	о:о	и:0
с:Ницца	у:2	т:с	р:ж	и:5	у1:a
с:Нова-Соль	у:7	т:с	р:ж	и:8	у1:a
с:Нова-Суль	у:7	т:с	р:ж	и:8	у1:a
с:Новгород	у:2	т:с	р:м	и:1	у1:a
с:Новоазовск	у:7	т:с	р:м	и:3	у1:a
с:Новоалтайск	у:8	т:с	р:м	и:3	у1:a
с:Новогрудок	у:7	т:с	р:м	и:1	у1:a	ч
с:Новокузнецк	у:9	т:с	р:м	и:3	у1:a
с:Новокуйбышевск	у:6	т:с	р:м	и:3	у1:a
с:Новомосковск	у:9	т:с	р:м	и:3	у1:a
с:Новоозёрное	у:7.2	т:с	т2:п	р:с	и:1	у1:a
с:Новороссийск	у:9	т:с	р:м	и:3	у1:a
с:Новосибирск	у:8	т:с	р:м	и:3	у1:a
с:Новоуральск	у:7	т:с	р:м	и:3	у1:a
с:Новофёдоровка	у:6.2	т:с	р:ж	и:3	у1:a	ч
с:Новочебоксарск	у:11	т:с	р:м	и:3	у1:a
с:Новошахтинск	у:6	т:с	р:м	и:3	у1:a
с:Ногинск	у:4	т:с	р:м	и:3	у1:a
с:Ножай-юрт	у:7.4	т:с	р:м	и:1	у1:a
с:Ной	у:2	т:с	р:м	о:о	и:1	у1:a
с:Нолинск	у:4	т:с	р:м	и:1	у1:a
с:Нора	у:2	т:с	р:ж	о:о	и:1	у1:a
с:Норвегия	у:5	т:с	р:ж	и:7	у1:a
с:Норильск	у:4	т:с	р:м	и:3	у1:a
с:Нормандия	у:5	т:с	р:ж	и:7	у1:a
с:Норман	у:2	т:с	р:м	о:о	и:1	у1:a
с:Норма	у:2	т:с	р:ж	о:о	и:1	у1:a
с:Норфолк	у:2	т:с	р:м	и:3	у1:a
с:Ноттингем	у:8	т:с	р:м	и:1	у1:a
с:Ноябрьск	у:3	т:с	р:м	и:3	у1:a
с:Нудоль	у:2	т:с	р:м	и:2	у1:a	з:посёлок в Московской области
с:Нурсултан	у:8	т:с	р:м	о:о	и:1	у1:a
с:Нью-Гэмпшир	у:6	т:с	р:м	и:1	у1:a
с:Нью-Джерси	у:7	т:с	р:м	и:0
с:Нью-Йорк	у:6	т:с	р:м	и:3	у1:a
с:Ньюкасл	у:5	т:с	р:м	и:1	у1:a
с:Нью-Мексико	у:6	т:с	р:м	и:0
с:Нэнси	у:2	т:с	р:ж	о:о
с:Няндома	у:2	т:с	р:ж	и:1	у1:a
с:Облучье	у:4	т:с	р:с	и:6	у1:a	ч
с:Обнинск	у:1	т:с	р:м	и:3	у1:a
с:Обоянь	у:4	т:с	р:ж	и:8	у1:a
с:Обь	у:1	т:с	р:ж	и:8	у1:f2	фп:.м
с:Овадья	у:3	т:с	р:м	рм:ж	о:о	и:6	у1:a	ч
с:Огайо	у:3	т:с	р:м	и:0
с:Одесса	у:3	т:с	р:ж	и:1	у1:a
с:Одинцово	у:6	т:с	р:с	и:1	у1:a
с:Одиссей	у:6	т:с	р:м	о:о	и:1	у1:a
с:Одри	у:1	т:с	р:ж	о:о
с:Ожерелье	у:5	т:с	р:с	и:6	у1:a	ч
с:Озёрск	у:3	т:с	р:м	и:3	у1:a
с:Озёры	у:3	т:с	мн	р:ж	и:1	у1:a
с:Ока	у:3	т:с	р:ж	и:3	у1:d	фп:.м
с:Океания	у:4	т:с	р:ж	и:7	у1:a
с:Оклахома	у:6	т:с	р:ж	и:1	у1:a
с:Оксана	у:4	т:с	р:ж	о:о	и:1	у1:a
с:Октавия	у:4	т:с	р:ж	о:о	и:7	у1:a
с:Олбани	у:1	т:с	р:м	и:0
с:Олег	у:3	т:с	р:м	о:о	и:3	у1:a
с:Оленевка	у:3	т:с	р:ж	и:3	у1:a	ч
с:Оливер	у:1	т:с	р:м	о:о	и:1	у1:a
с:Оливия	у:3	т:с	р:ж	о:о	и:7	у1:a
с:Ольга	у:1	т:с	р:ж	о:о	и:3	у1:a
с:Ольгин	у:5	т:с	р:м	и:1	у1:a
с:Ольховка	у:5	т:с	р:ж	и:3	у1:a	ч
с:Оля	у:1	т:с	р:ж	о:о	и:2	у1:a
с:Оман	у:3	т:с	р:м	и:1	у1:a	з:ударение по Википедии
с:Омар	у:3	т:с	р:м	о:о	и:1	у1:a
с:Омехи	у:3	т:с	р:м	о:о
с:Омка	у:1	т:с	р:ж	и:3	у1:a
с:Омск	у:1	т:с	р:м	и:3	у1:a
с:Онега	у:3	т:с	р:ж	и:1	у1:a
с:Онотоле	у:5	т:с	р:м	и:0	з:прозвище Анатолия Вассермана
с:Опель	у:1	т:с	р:м	и:2	у1:a
с:Опочка	у:3	т:с	р:ж	и:3	у1:a	ч
с:Оратов	у:3	т:с	р:м	и:1	у1:a
с:Орда	у:4	т:с	р:ж	и:1	у1:d
с:Орджоникидзе	у:9	т:с	р:с	и:0
с:Ореанда	у:4	т:с	р:ж	и:1	у1:a
с:Орегон	у:5	т:с	р:м	и:1	у1:a
с:Оренбург	у:6	т:с	р:м	и:3	у1:a
с:Орёл	у:3	т:с	р:м	и:1	у1:b	ч
с:Орион	у:4	т:с	р:м	о:о	и:1	у1:a
с:Орловщина	у:4	т:с	р:ж	и:1	у1:a
с:Орск	у:1	т:с	р:м	и:3	у1:a
с:Орфей	у:4	т:с	р:м	о:о	и:1	у1:a
с:Орша	у:4	т:с	р:ж	и:4	у1:b	фп:.м
с:Осака	у:1	т:с	р:ж	и:3	у1:a	з:город в Японии
с:Освальд	у:1	т:с	р:м	о:о	и:1	у1:a
с:Осетия	у:3	т:с	р:ж	и:7	у1:a
с:Осип	у:1	т:с	р:м	о:о	и:1	у1:a
с:Оскар	у:1	т:с	р:м	о:но	и:1	у1:a	з:премия
с:Оскар	у:1	т:с	р:м	о:о	и:1	у1:a
с:Останкино	у:4	т:с	р:с	и:1	у1:a
с:Остап	у:4	т:с	р:м	о:о	и:1	у1:a
с:Остин	у:1	т:с	р:м	и:1	у1:a
с:Остин	у:1	т:с	р:м	о:о	и:1	у1:a
с:Острогожск	у:7	т:с	р:м	и:3	у1:a
с:Отрадное	у:4	т:с	т2:п	р:с	и:1	у1:a
с:Отто	у:1	т:с	р:м	о:о	и:0
с:Оуэн	у:1	т:с	р:м	о:о	и:1	у1:a
с:ОФСИН	у:4	т:с	р:м
с:Оха	у:3	т:с	р:ж	и:3	у1:d	фп:.м
с:Охта	у:1	т:с	р:ж	и:1	у1:a
с:Павел	у:2	т:с	р:м	о:о	и:1	у1:a	ч
с:Павлово-Посадский	у:12.2	т:п	и:3	у1:a	фз:^к	фн:^с	з:прилагательное от Павловский Посад
с:Пакистан	у:7	т:с	р:м	и:1	у1:a
с:Паланга	у:4	т:с	р:ж	и:3	у1:a	з:ударение по Агеенко, хотя в литовском ударение на последний слог
с:Палеахори	у:7	т:с	р:м	и:0	з:нас. пункт в Греции
с:Палермо	у:4	т:с	р:м	и:0
с:Палестина	у:7	т:с	р:ж	и:1	у1:a
с:Паллада	у:5	т:с	р:ж	о:о	и:1	у1:a
с:Памир	у:4	т:с	р:м	и:1	у1:a
с:Паоло	у:2	т:с	р:м	о:о	и:0
с:Папуа	у:2	т:с	р:ж	и:0
с:Парабель	у:6	т:с	р:ж	и:8	у1:a	з:ударение наобум, род по Википедии
с:Париж	у:4	т:с	р:м	и:4	у1:a
с:Парковое	у:2	т:с	т2:п	р:с	и:1	у1:a
с:Партенит	у:7	т:с	р:м	и:1	у1:a
с:Патрик	у:2	т:с	р:м	о:о	и:3	у1:a
с:Патриция	у:5	т:с	р:ж	о:о	и:7	у1:a
с:Паттая	у:5	т:с	р:ж	и:6	у1:a
с:Пат	у:2	т:с	р:ж	о:о
с:Пауль	у:2	т:с	р:м	о:о	и:2	у1:a
с:Паша	у:2	т:с	р:м	рм:ж	о:о	и:4	у1:a
с:Пегги	у:2	т:с	р:ж	о:о
с:Педро	у:2	т:с	р:м	о:о	и:0
с:Пежо	у:4	т:с	р:м	и:0
с:Пекин	у:4	т:с	р:м	и:1	у1:a
с:Пелагея	у:6	т:с	р:ж	о:о	и:6	у1:a
с:Пенелопа	у:6	т:с	р:ж	о:о	и:1	у1:a
с:Пенза	у:2	т:с	р:ж	и:1	у1:a
с:Пенсильвания	у:9	т:с	р:ж	и:7	у1:a
с:Пентагон	у:7	т:с	р:м	и:1	у1:a
с:Первоуральск	у:8	т:с	р:м	и:3	у1:a
с:Перемышль	у:6	т:с	р:м	и:2	у1:a	з:http://ru.wikipedia.org/wiki/Перемышль
с:Переяслав-Хмельницкий	у:17.5	т:п	и:3	у1:a	гпр:Переяслав-Хмельницкий	фз:^к	фн:^с
с:Пермь	у:2	т:с	р:ж	и:8	у1:f2	фп:.м
с:Персия	у:2	т:с	р:ж	и:7	у1:a
с:Перу	у:4	т:с	р:с	и:0
с:Песочня	у:4	т:с	р:ж	и:2	у1:a	ч
с:Песчаное	у:5	т:с	т2:п	р:с	и:1	у1:a
с:Петербург	у:7	т:с	р:м	и:3	у1:a
с:Петергоф	у:7	т:с	р:м	и:1	у1:a
с:Петер	у:2	т:с	р:м	о:о	и:1	у1:a
с:Петра	у:2	т:с	р:ж	о:о	и:1	у1:a
с:Петроград	у:8	т:с	р:м	и:1	у1:a
с:Петрозаводск	у:9	т:с	р:м	и:3	у1:a
с:Петро	у:5	т:с	р:м	рм:с	о:о	и:1	у1:b
с:Петушки	у:7	т:с	мн	р:м	и:3	у1:b	ч
с:Петька	у:2	т:с	р:м	рм:ж	о:о	и:3	у1:a	ч
с:Петя	у:2	т:с	р:м	рм:ж	о:о	и:2	у1:a
с:Пёно	у:2	т:с	р:м	и:0	з:http://ru.wikipedia.org/wiki/Пено
с:Пётр	у:2	т:с	р:м	о:о	и:1	у1:b
с:Пиза	у:2	т:с	р:ж	и:1	у1:a
с:Пинья	у:2	т:с	р:ж	и:6	у1:a	ч
с:Писаревка	у:2	т:с	р:ж	и:3	у1:a	ч
с:Питер	у:2	т:с	р:м	о:о	и:1	у1:a
с:Питкяранта	у:7	т:с	р:ж	и:1	у1:a
с:Пит	у:2	т:с	р:м	о:о	и:1	у1:a
с:Пласт	у:3	т:с	р:м	и:1	у1:a
с:Платон	у:5	т:с	р:м	о:о	и:1	у1:a
с:Плевен	у:3	т:с	р:м	и:1	у1:a
с:Плесецк	у:5	т:с	р:м	и:3	у1:a
с:Плимут	у:3	т:с	р:м	и:1	у1:a
с:Плутон	у:5	т:с	р:м	и:1	у1:a	з:о звуке
с:Пльзень	у:5	т:с	р:м	и:2	у1:a
с:Подольск	у:4	т:с	р:м	и:3	у1:a
с:Подпорожье	у:7	т:с	р:с	и:6	у1:a	ч
с:Полевской	у:8	т:с	т2:п	р:м	и:3	у1:b
с:Полина	у:4	т:с	р:ж	о:о	и:1	у1:a
с:Поль	у:2	т:с	р:м	о:о	и:2	у1:a
с:Польша	у:2	т:с	р:ж	и:4	у1:a
с:Помокли	у:7	т:с	мн	р:ж	и:2	у1:b	з:село на Украине; информация об ударении и склонении построена на основе статьи в Википедии на украинском
с:Пон-дю-Гар	у:9	т:с	р:м	и:1	у1:a
с:Понизовка	у:6	т:с	р:ж	и:3	у1:a	ч
с:Попельня	у:4	т:с	р:ж	и:2	у1:a	ч
с:Поповка	у:4	т:с	р:ж	и:3	у1:a	ч
с:Пополь-вух	у:9.2	т:с	р:м	и:3	у1:a
с:Пореч	у:2	т:с	р:м	и:4	у1:a
с:Порт-Артур	у:9.2	т:с	р:м	и:1	у1:a
с:Португалия	у:7	т:с	р:ж	и:7	у1:a
с:Порфирий	у:5	т:с	р:м	о:о	и:7	у1:a	до:26
с:Поставы	у:5	т:с	мн	р:ж	и:1	у1:a	з:ударение по википедии: http://ru.wikipedia.org/wiki/Поставы; склонение по гуглу
с:Почеп	у:2	т:с	р:м	и:1	у1:a
с:Починки	у:4	т:с	мн	р:ж	и:3	у1:a	ч	з:http://ru.wikipedia.org/wiki/Починки
с:Прага	у:3	т:с	р:ж	и:3	у1:a
с:Пра	у:3	т:с	р:ж	и:1	у1:b	з:река
с:Пресня	у:3	т:с	р:ж	и:2	у1:a
с:Прибайкалье	у:8	т:с	р:с	и:5	у1:a	ч
с:Прибалтика	у:5	т:с	р:ж	и:3	у1:a
с:Прибрежное	у:6	т:с	т2:п	р:с	и:1	у1:a
с:ПриватБанк	у:8.5	т:с	р:м	и:3	у1:a
с:Приветное	у:5	т:с	т2:п	р:с	и:1	у1:a
с:Приволжск	у:5	т:с	р:м	и:3	у1:a
с:Приднестровье	у:10	т:с	р:с	и:6	у1:a	ч
с:Приморский	у:5	т:с	т2:п	р:м	и:3	у1:a
с:Приобье	у:4	т:с	р:с	и:6	у1:a	ч
с:Приокск	у:4	т:с	р:м	и:3	у1:a
с:Припять	у:3	т:с	р:ж	и:8	у1:a
с:Пристень	у:6	т:с	р:ж	и:8	у1:a	з:ударение предположительно
с:Прованс	у:5	т:с	р:м	и:1	у1:a
с:Провидения	у:7	т:с	р:м	и:0	з:http://www.provideniya.ru/
с:Прокопьевск	у:5	т:с	р:м	и:3	у1:a
с:Прокофий	у:5	т:с	р:м	о:о	и:7	у1:a	до:26
с:Прохор	у:3	т:с	р:м	о:о	и:1	у1:a
с:Псков	у:4	т:с	р:м	и:1	у1:a
с:Псковщина	у:4	т:с	р:ж	и:1	у1:a
с:Пульхерия	у:6	т:с	р:ж	о:о	и:7	у1:a
с:Пучеж	у:2	т:с	р:м	и:4	у1:a
с:Пушкино	у:2	т:с	р:с	и:1	у1:a
с:Пушкин	у:2	т:с	р:м	и:1	у1:a	з:город
с:Пфальц	у:3	т:с	р:м	и:5	у1:a
с:Пхеньян	у:6	т:с	р:м	и:1	у1:a
с:Пхи-Пхи	у:7	т:с	р:м	з:остров в Таиланде
с:Пхукет	у:5	т:с	р:м	и:1	у1:a
с:Пыть-ях	у:6	т:с	р:м	и:3	у1:a
с:Пышма	у:5	т:с	р:ж	и:1	у1:b	з:Верхняя Пышма
с:Пьеро	у:5	т:с	р:м	о:о	и:0
с:Пьер	у:3	т:с	р:м	о:о	и:1	у1:a
с:Пэт	у:2	т:с	р:ж	о:о
с:Пятигорск	у:6	т:с	р:м	и:3	у1:a
с:Равиль	у:4	т:с	р:м	о:о	и:2	у1:a
с:Рада	у:2	т:с	р:ж	о:о	и:1	у1:a
с:Раджа	у:5	т:с	р:м	рм:ж	о:о	и:4	у1:b
с:Радищево	у:4	т:с	р:с
с:Радонеж	у:2	т:с	р:м	и:4	у1:a
с:Раёк	у:3	т:с	р:м	и:3	у1:b	ч
с:Разиль	у:4	т:с	р:м	о:о	и:2	у1:a
с:Раиса	у:3	т:с	р:ж	о:о	и:1	у1:a
с:Рай-Александровка	у:10.2	т:с	р:ж	и:3	у1:a	ч
с:Раймонд	у:2	т:с	р:м	о:о	и:1	у1:a
с:Ральф	у:2	т:с	р:м	о:о	и:1	у1:a
с:Рамблер	у:2	т:с	р:м	и:1	у1:a
с:Рамешки	у:2	т:с	мн	р:м	и:3	у1:a	ч	з:ударение по википедии; окончание -ов - по гуглу
с:Рамиль	у:4	т:с	р:м	о:о	и:2	у1:a
с:Рамирес	у:4	т:с	р:м	о:о	и:1	у1:a
с:Рамона	у:4	т:с	р:ж	о:о	и:1	у1:a
с:Расиля	у:6	т:с	р:ж	о:о	и:2	у1:b
с:Рауль	у:3	т:с	р:м	о:о	и:2	у1:a
с:Рафаэль	у:5	т:с	р:м	о:о	и:2	у1:a
с:Рахиль	у:4	т:с	р:ж	о:о	и:8	у1:a
с:Рашель	у:4	т:с	р:ж	о:о	и:8	у1:a	з:http://www.gramota.ru/slovari/info/ag/sklon/
с:Рашид	у:4	т:с	р:м	о:о	и:1	у1:a
с:Рая	у:2	т:с	р:ж	о:о	и:2	у1:a
с:Ребекка	у:4	т:с	р:ж	о:о	и:3	у1:a
с:Ревекка	у:4	т:с	р:ж	о:о	и:3	у1:a
с:Регина	у:4	т:с	р:ж	о:о	и:1	у1:a
с:Рейн	у:2	т:с	р:м	о:о	и:1	у1:a
с:Рейчел	у:2	т:с	р:ж	о:о
с:Рене	у:4	т:с	р:ж	о:о
с:Рено	у:4	т:с	р:м	и:0
с:Реунион	у:6	т:с	р:м	и:1	у1:a	з:ударение по Википедии, Реуньон
с:Реутов	у:2	т:с	р:м	и:1	у1:a	фр:D0%A0%D0%B5%D1%83%D1%82%D0%BE%D0%B2_)	слсч://ru.wikipedia.org/wiki/
с:Ржев	у:3	т:с	р:м	и:1	у1:a
с:Рига	у:2	т:с	р:ж	и:3	у1:a
с:Рико	у:2	т:с	р:м	о:о	и:0
с:Рик	у:2	т:с	р:м	о:о	и:3	у1:a
с:Римантас	у:2	т:с	р:м	о:о	и:1	у1:a
с:Рима	у:2	т:с	р:ж	о:о	и:1	у1:a
с:Рим	у:2	т:с	р:м	и:1	у1:a
с:Рина	у:2	т:с	р:ж	о:о	и:1	у1:a
с:Рио-де-Жанейро	у:11.2	т:с	р:м	и:0
с:Рита	у:2	т:с	р:ж	о:о	и:1	у1:a
с:Ритфаль	у:5	т:с	р:м	о:о	и:2	у1:a
с:Рифкат	у:5	т:с	р:м	о:о	и:1	у1:a
с:Ричард	у:2	т:с	р:м	о:о	и:1	у1:a
с:Ричмонд	у:2	т:с	р:м	и:1	у1:a
с:Роберт	у:2	т:с	р:м	о:о	и:1	у1:a
с:Робин	у:2	т:с	р:м	о:о	и:1	у1:a
с:Роб	у:2	т:с	р:м	о:о	и:1	у1:a
с:Ровеньки	у:8	т:с	мн	р:м	и:3	у1:a	ч	з:ударение по википедии
с:Ровно	у:2	т:с	р:м	и:0
с:Род-Айленд	у:5.2	т:с	р:м	и:1	у1:a
с:Роджер	у:2	т:с	р:м	о:о	и:1	у1:a
с:Родион	у:5	т:с	р:м	о:о	и:1	у1:a
с:Родники	у:7	т:с	мн	р:м	и:1	у1:b
с:Родя	у:2	т:с	р:м	рм:ж	о:о	и:2	у1:a
с:Розалинда	у:6	т:с	р:ж	о:о	и:1	у1:a
с:Роза	у:2	т:с	р:ж	о:о	и:1	у1:a
с:Розмари	у:7	т:с	р:ж	о:о	и:0
с:Рой	у:2	т:с	р:м	о:о	и:1	у1:a
с:Роланда	у:4	т:с	р:ж	о:о	и:1	у1:a
с:Ролан	у:4	т:с	р:м	о:о	и:1	у1:a
с:Роман	у:4	т:с	р:м	о:о	и:1	у1:a
с:Ромео	у:4	т:с	р:м	о:о	и:0
с:Ромка	у:2	т:с	р:м	рм:ж	о:о	и:3	у1:a	ч
с:Ромны	у:2	т:с	мн	р:ж	и:1	у1:a	ч	з:ударение по наитию, нулевое окончание в родительном - по википедии: http://ru.wikipedia.org/wiki/Ромны, хотя по запросам к Гуглу больше "Ромнов"
с:Ромуальд	у:5	т:с	р:м	о:о	и:1	у1:a
с:Рональд	у:2	т:с	р:м	о:о	и:1	у1:a
с:Ронни	у:2	т:с	р:м	о:о
с:Рон	у:2	т:с	р:м	о:о	и:1	у1:a
с:Росгидромет	у:10	т:с	р:м	и:1	у1:a
с:Роскомнадзор	у:11.2	т:с	р:м	и:1	у1:a
с:Роскосмос	у:5	т:с	р:м	и:1	у1:a
с:Роснефть	у:5	т:с	р:ж	и:8	у1:a
с:Роспотребнадзор	у:14.2	т:с	р:м	и:1	у1:a
с:Россия	у:5	т:с	р:ж	и:7	у1:a
с:Россотрудничество	у:8.2	т:с	р:с	и:1	у1:a
с:Россошь	у:2	т:с	р:ж	и:8	у1:a
с:Росстат	у:6	т:с	р:м	и:1	у1:a
с:Ростех	у:5	т:с	р:м	и:3	у1:a
с:Ростислав	у:8	т:с	р:м	о:о	и:1	у1:a
с:Ростов	у:5	т:с	р:м	и:1	у1:a
с:Росток	у:2	т:с	р:м	и:3	у1:a
с:Роуз	у:2	т:с	р:ж	о:о
с:Руби	у:2	т:с	р:ж	о:о
с:Рубцовск	у:5	т:с	р:м	и:3	у1:a
с:Рудня	у:2	т:с	р:ж	и:1	у1:a
с:Рудольф	у:4	т:с	р:м	о:о	и:1	у1:a
с:Руза	у:2	т:с	р:ж	и:1	у1:a
с:Рузиль	у:4	т:с	р:м	о:о	и:2	у1:a
с:Румыния	у:4	т:с	р:ж	и:7	у1:a
с:Руслан	у:5	т:с	р:м	о:о	и:1	у1:a
с:Русса	у:2	т:с	р:ж	и:1	у1:a	з:ударение по википедии: http://ru.wikipedia.org/wiki/Старая_Русса
с:Русудан	у:6	т:с	р:ж	о:о	и:0
с:Русь	у:2	т:с	р:ж	и:8	у1:a
с:Рута	у:2	т:с	р:ж	о:о	и:1	у1:a
с:Рут	у:2	т:с	р:ж	о:о
с:Руфь	у:2	т:с	р:ж	о:о	и:8	у1:a
с:Рыбинск	у:2	т:с	р:м	и:3	у1:a
с:Рэм	у:2	т:с	р:м	о:о	и:1	у1:a
с:Рэнди	у:2	т:с	р:м	о:о
с:Рюрик	у:2	т:с	р:м	о:о	и:3	у1:a
с:Рязань	у:4	т:с	р:ж	и:8	у1:a
с:Саарбрюккен	у:7	т:с	р:м	и:1	у1:a	з:город на западе Германии
с:Сабина	у:4	т:с	р:ж	о:о	и:1	у1:a
с:Савва	у:2	т:с	р:м	рм:ж	о:о	и:1	у1:a	до:28
с:Савелий	у:4	т:с	р:м	о:о	и:7	у1:a	до:26
с:Савёлки	у:4	т:с	мн	р:ж	и:3	у1:a	ч
с:Савонлинна	у:2	т:с	р:ж	и:1	у1:a
с:Саймон	у:2	т:с	р:м	о:о	и:1	у1:a
с:Саки	у:2	т:с	мн	р:ж	и:3	у1:a
с:Салават	у:6	т:с	р:м	и:1	у1:a
с:Салерно	у:4	т:с	р:м	и:0	з:город в Италии
с:Салехард	у:6	т:с	р:м	и:1	у1:a
с:Салли	у:2	т:с	р:ж	о:о
с:Салоники	у:4	т:с	мн	р:м	и:3	у1:a	з:город в Греции, в Википедии склоняется
с:Саманта	у:4	т:с	р:ж	о:о	и:1	у1:a
с:Самара	у:4	т:с	р:ж	и:1	у1:a
с:Самсон	у:5	т:с	р:м	о:о	и:1	у1:a
с:Самуил	у:5	т:с	р:м	о:о	и:1	у1:a
с:Самуи	у:5	т:с	р:м	и:0
с:Сан-Антонио	у:8	т:с	р:м	и:0
с:Санаторное	у:6	т:с	т2:п	р:с	и:1	у1:a
с:Сан-Диего	у:7	т:с	р:м	и:0
с:Санди	у:2	т:с	р:ж	о:о
с:Сандра	у:2	т:с	р:ж	о:о	и:1	у1:a
с:Сандро	у:2	т:с	р:м	о:о	и:0
с:Санкт-Петербург	у:13	т:с	р:м	и:3	у1:a
с:Сан-Луис	у:7	т:с	р:м	и:1	у1:a
с:Санни	у:2	т:с	р:м	о:о	и:0
с:Санта-Клаус	у:9.2	т:с	р:м	о:о	и:1	у1:a
с:Сан-Томе	у:8	т:с	р:с	и:0
с:Сан-Франциско	у:10	т:с	р:м	и:0
с:Сан-Хосе	у:8	т:с	р:м	и:0
с:Сан-Хуан	у:7	т:с	р:м	и:1	у1:a
с:Сараево	у:4	т:с	р:с	и:1	у1:a
с:Саранск	у:4	т:с	р:м	и:3	у1:a
с:Сарапул	у:4	т:с	р:м	и:1	у1:a
с:Саратов	у:4	т:с	р:м	и:1	у1:a
с:Сара	у:2	т:с	р:ж	о:о	и:1	у1:a
с:Саров	у:4	т:с	р:м	и:1	у1:a
с:Сарыг-Сеп	у:8.4	т:с	р:м	и:1	у1:a
с:Сатка	у:2	т:с	р:ж	и:3	у1:a	ч
с:Сатпаев	у:5	т:с	р:м	и:1	у1:a
с:Сатурн	у:4	т:с	р:м	и:1	у1:a
с:Сахалин	у:6	т:с	р:м	и:1	у1:a
с:Сахара	у:4	т:с	р:ж	и:1	у1:a
с:Саха	у:4	т:с	р:ж	и:3	у1:b
с:Саша	у:2	т:с	р:ж	о:о	и:4	у1:a
с:Саша	у:2	т:с	р:м	рм:ж	о:о	и:4	у1:a
с:Саяногорск	у:7.3	т:с	р:м	и:3	у1:a
с:Свазиленд	у:3	т:с	р:м	и:1	у1:a
с:Свен	у:3	т:с	р:м	о:о	и:1	у1:a
с:Светлана	у:6	т:с	р:ж	о:о	и:1	у1:a
с:свободно	у:5	т:н	и:0
с:Святогорье	у:7	т:с	р:с	и:6	у1:a	ч
с:Святополк	у:7	т:с	р:м	о:о	и:3	у1:a
с:Святослава	у:8	т:с	р:ж	о:о	и:1	у1:a
с:Святослав	у:8	т:с	р:м	о:о	и:1	у1:a
с:Себастьян	у:8	т:с	р:м	о:о	и:1	у1:a
с:Севастополь	у:7	т:с	р:м	и:2	у1:a
с:Сева	у:2	т:с	р:м	рм:ж	о:о	и:1	у1:a
с:Северодвинск	у:9	т:с	р:м	и:3	у1:a
с:Северск	у:2	т:с	р:м	и:3	у1:a
с:Севилья	у:4	т:с	р:ж	и:6	у1:a	ч
с:Седрик	у:2	т:с	р:м	о:о	и:3	у1:a
с:Сейны	у:2	т:с	мн	р:ж	и:1	у1:a
с:Селена	у:4	т:с	р:ж	о:о	и:1	у1:a
с:Селты	у:5	т:с	мн	р:м	и:1	у1:a
с:Сельма	у:2	т:с	р:ж	о:о	и:1	у1:a
с:Семаль	у:4	т:с	р:м	и:2	у1:a	з:фамилия
с:Семёна	у:4	т:с	р:ж	о:о	и:1	у1:a
с:Семён	у:4	т:с	р:м	о:о	и:1	у1:a
с:Семиключье	у:7	т:с	р:с	и:6	у1:a	ч
с:Семилуки	у:6	т:с	мн	р:м	и:3	у1:a
с:Сенаки	у:4	т:с	р:м	и:0
с:Сена	у:2	т:с	р:ж	и:1	у1:a
с:Сенгилей	у:7	т:с	р:м	и:6	у1:a
с:Сент-Катаринс	у:11.2	т:с	р:м	и:1	у1:a
с:Сера	у:2	т:с	р:ж	о:о	и:1	у1:a
с:Серафима	у:6	т:с	р:ж	о:о	и:1	у1:a
с:Серафим	у:6	т:с	р:м	о:о	и:1	у1:a
с:Сербия	у:2	т:с	р:ж	и:7	у1:a
с:Сергей	у:5	т:с	р:м	о:о	и:1	у1:a
с:Сергиев-Посадский	у:12.2	т:п	и:3	у1:a	фз:^к	фн:^с	з:прилагательное от Сергиев Посад
с:Сергиев	у:2	т:п	т2:мс	и:1	у1:a
с:Сергий	у:2	т:с	р:м	о:о	и:7	у1:a
с:Сердар	у:5	т:с	р:м	о:о	и:1	у1:a
с:Серёжа	у:4	т:с	р:м	рм:ж	о:о	и:4	у1:a
с:Серик	у:4	т:с	р:м	о:о	и:3	у1:a
с:Сернур	у:5	т:с	р:м	и:1	у1:a	з:http://ru.wikipedia.org/wiki/Сернур
с:Серпухов	у:2	т:с	р:м	и:1	у1:a
с:Сеул	у:3	т:с	р:м	и:1	у1:a
с:Сибай	у:4	т:с	р:м	и:4	у1:a
с:Сибирь	у:4	т:с	р:ж	и:8	у1:a
с:СИДиСР	у:2	т:с	р:ж
с:Сидней	у:5	т:с	р:м	и:6	у1:a
с:Сид	у:2	т:с	р:м	о:о	и:1	у1:a
с:Сикачи-Алян	у:10.6	т:с	р:м	и:1	у1:a
с:Сильва	у:2	т:с	р:ж	о:о	и:1	у1:a
с:Сильвестр	у:6	т:с	р:м	о:о	и:1	у1:a
с:Сильвио	у:2	т:с	р:м	о:о	и:0
с:Сильвия	у:2	т:с	р:ж	о:о	и:7	у1:a
с:Симеиз	у:5	т:с	р:м	и:1	у1:a
с:Симеон	у:5	т:с	р:м	о:о	и:1	у1:a
с:Симона	у:4	т:с	р:ж	о:о	и:1	у1:a
с:Симон	у:4	т:с	р:м	о:о	и:1	у1:a
с:Симферополь	у:7	т:с	р:м	и:2	у1:a
с:Синай	у:4	т:с	р:м	и:6	у1:a
с:Сингапур	у:7	т:с	р:м	и:1	у1:a
с:Синтия	у:2	т:с	р:ж	о:о	и:7	у1:a
с:Сирия	у:2	т:с	р:ж	и:7	у1:a
с:Ситроен	у:6	т:с	р:м	и:1	у1:a
с:Сиэтл	у:3	т:с	р:м	и:1	у1:a
с:Скай	у:3	т:с	р:ж	о:о	и:0
с:Скарлетт	у:3	т:с	р:ж	о:о
с:Славик	у:3	т:с	р:м	о:о	и:3	у1:a
с:Славянск	у:5	т:с	р:м	и:1	у1:a
с:Сливен	у:3	т:с	р:м	и:1	у1:a	з:ударение по Википедии
с:Словакия	у:5	т:с	р:ж	и:7	у1:a
с:Словения	у:5	т:с	р:ж	и:7	у1:a
с:Смоленск	у:5	т:с	р:м	и:1	у1:a
с:Смоленщина	у:5	т:с	р:ж	и:1	у1:a
с:Сморгонь	у:6	т:с	р:ж	и:8	у1:a
с:Снежинск	у:3	т:с	р:м	и:3	у1:a
с:Снятын	у:3	т:с	р:м	и:1	у1:a	з:город районного значения в Ивано-Франковской области Украины, административный центр Снятынского района
с:Собинбанк	у:7	т:с	р:м	и:3	у1:a
с:Сократ	у:5	т:с	р:м	о:о	и:1	у1:a
с:Соликамск	у:6	т:с	р:м	и:3	у1:a
с:Солнечногорское	у:10	т:с	т2:п	р:с	и:3	у1:a
с:Соловки	у:7	т:с	мн	р:м	и:3	у1:b
с:Соломон	у:6	т:с	р:м	о:о	и:1	у1:a
с:Сольвычегодск	у:10	т:с	р:м	и:3	у1:a
с:Соль-Илецк	у:8.2	т:с	р:м	и:3	у1:a
с:Сольцы	у:6	т:с	мн	р:м	и:6	у1:b	з:ударение и окончание по википедии: http://ru.wikipedia.org/wiki/Сольцы
с:Сомали	у:6	т:с	р:с	и:0	з:государство
с:Соня	у:2	т:с	р:ж	о:о	и:2	у1:a
с:Сорбонна	у:5	т:с	р:ж	и:1	у1:a
с:Сорренто	у:5	т:с	р:м	и:0
с:Сосновка	у:5	т:с	р:ж	и:3	у1:a	ч
с:Софи	у:2	т:с	р:ж	о:о
с:Софи	у:4	т:с	р:ж	о:о	и:0
с:Софият	у:5	т:с	р:ж	о:о	и:0
с:София	у:4	т:с	р:ж	о:о	и:7	у1:a
с:Софрон	у:5	т:с	р:м	о:о	и:1	у1:a
с:Софтлайн	у:6	т:с	р:м	и:1	у1:a
с:Софья	у:2	т:с	р:ж	о:о	и:6	у1:a
с:Сочи	у:2	т:с	р:м	и:0
с:Спартак	у:6	т:с	р:м	о:о	и:3	у1:a
с:Спарта	у:3	т:с	р:ж	и:1	у1:a
с:Спас-Клепики	у:8	т:с	мн	р:м	и:3	у1:a	з:город в Рязанской области
с:Спасск-Рязанский	у:11.3	т:с	т2:п	р:м	с2ч	и:3	у1:a
с:Спас-Угол	у:6	т:с	р:м	и:1	у1:b	ч	фз:^..	искл::{'ие'=>[{'с'=>'Спас-Угол','у'=>'6'}]}
с:Спиридон	у:7	т:с	р:м	о:о	и:1	у1:a
с:Сплит	у:4	т:с	р:м	и:1	у1:a	з:город в Хорватии
с:Ставангер	у:5	т:с	р:м	и:1	у1:a	з:город в Норвегии
с:Ставропольпромстройбанк	у:21.3.13.18	т:с	р:м	и:3	у1:a
с:Ставрополь	у:3	т:с	р:м	и:2	у1:a
с:Сталина	у:5	т:с	р:ж	о:о	и:1	у1:a
с:Сталинград	у:9	т:с	р:м	и:1	у1:a
с:Стамбул	у:6	т:с	р:м	и:1	у1:a	з:город в Турции
с:Станислав	у:8	т:с	р:м	о:о	и:1	у1:a
с:Стародуб	у:7	т:с	р:м	и:1	у1:a
с:Староласпа	у:7	т:с	р:ж	и:1	у1:a	з:ударение по наитию
с:Старощербиновская	у:12.3	т:с	т2:п	р:ж	и:3	у1:a
с:Стейси	у:3	т:с	р:ж	о:о
с:Стелла	у:3	т:с	р:ж	о:о	и:1	у1:a
с:Степанакерт	у:9	т:с	р:м	и:1	у1:a
с:Степанида	у:7	т:с	р:ж	о:о	и:1	у1:a
с:Степан	у:5	т:с	р:м	о:о	и:1	у1:a
с:Стерегущее	у:7	т:с	т2:п	р:с	и:4	у1:a
с:Стерлитамак	у:10	т:с	р:м	и:1	у1:a
с:Стефани	у:3	т:с	р:ж	о:о
с:Стефан	у:5	т:с	р:м	о:о	и:1	у1:a
с:Стивен	у:3	т:с	р:м	о:о	и:1	у1:a
с:Стив	у:3	т:с	р:м	о:о	и:1	у1:a
с:Стокгольм	у:6	т:с	р:м	и:1	у1:a
с:Стоунхендж	у:7.3	т:с	р:м	и:4	у1:a
с:Страсбург	у:4	т:с	р:м	и:3	у1:a
с:Стратфорд	у:4	т:с	р:м	и:1	у1:a
с:Строймонтаж	у:10.4	т:с	р:м	и:4	у1:a
с:Струги	у:4	т:с	мн	р:ж	и:3	у1:a	з:http://strugi.ru/
с:Стрый	у:4	т:с	р:м	и:6	у1:a
с:Сувалки	у:4	т:с	мн	р:ж	и:3	у1:a	ч
с:Судак	у:4	т:с	р:м	и:3	у1:b
с:Судак	у:4	т:с	р:м	и:3	у1:b	з:город в Крыму
с:Судан	у:4	т:с	р:м	и:1	у1:a
с:Судогда	у:2	т:с	р:ж	и:1	у1:a	ч
с:Суздаль	у:2	т:с	р:м	и:2	у1:a
с:Сулавеси	у:6	т:с	р:м	и:0	з:остров, принадлежащий Индонезии
с:Султан	у:5	т:с	р:м	о:о	и:1	у1:a
с:Сумы	у:2	т:с	мн	р:ж	и:1	у1:a
с:Супрасль	у:2	т:с	р:м	и:2	у1:a
с:Сургут	у:5	т:с	р:м	и:1	у1:a
с:Сут-Хольский	у:6	т:п	и:3	у1:a	гпр:Сут-Холь	фз:^к	фн:^с
с:Суть-Холь	у:7.2	т:с	р:ж	и:8	у1:a	з:склонение предположительно
с:Сухуми	у:4	т:с	р:м	и:0
с:США	у:3	мн	и:0
с:Сызрань	у:2	т:с	р:ж	и:8	у1:e
с:Сыктывкар	у:8	т:с	р:м	и:1	у1:a
с:Сьерра-Леоне	у:10.3	т:с	р:ж	и:0
с:Сьюзан	у:3	т:с	р:ж	о:о	вар:2
с:Сьюзен	у:3	т:с	р:ж	о:о	вар:1
с:Сьюзи	у:3	т:с	р:ж	о:о	и:0
с:Сью	у:3	т:с	р:ж	о:о
с:Сэлли	у:2	т:с	р:ж	о:о
с:Сэм	у:2	т:с	р:м	о:о	и:1	у1:a
с:Сэнди	у:2	т:с	р:ж	о:о
с:Сюзанна	у:4	т:с	р:ж	о:о	и:1	у1:a
с:Сюскюя	у:5	т:с	р:ж	и:6	у1:a	з:единственное склонение нашел на сайте rp5.ru: Погода в Сюскюе; ударение предположительно
с:Тавда	у:5	т:с	р:ж	и:1	у1:c
с:Таганрог	у:7	т:с	р:м	и:3	у1:a
с:Тагил	у:4	т:с	р:м	и:1	у1:a
с:Тадеуш	у:4	т:с	р:м	о:о	и:1	у1:a
с:Таджикистан	у:10	т:с	р:м	и:1	у1:a
с:Таиланд	у:5	т:с	р:м	и:1	у1:a
с:Таисия	у:3	т:с	р:ж	о:о	и:7	у1:a
с:Таити	у:3	т:с	р:м
с:Тайбэй	у:5	т:с	р:м	и:6	у1:a
с:Тайвань	у:5	т:с	р:м	и:2	у1:a
с:Тайланд	у:5	т:с	р:м	и:1	у1:a
с:Таймс	у:2	т:с	р:ж
с:Таймыр	у:5	т:с	р:м	и:1	у1:a
с:Таллинн	у:2	т:с	р:м	и:1	у1:a	вар:2
с:Таллин	у:2	т:с	р:м	и:1	у1:a	вар:1
с:Тальхайм-Вельс	у:11.2	т:с	р:м	и:1	у1:a
с:Тамара	у:4	т:с	р:ж	о:о	и:1	у1:a
с:Тамбов	у:5	т:с	р:м	и:1	у1:a
с:Тандер-Бей	у:9.2	т:с	р:м	и:6	у1:a	фр:D0%A2%D0%B0%D0%BD%D0%B4%D0%B5%D1%80-%D0%91%D0%B5%D0%B9_)	слсч:http://ru.wikipedia.org/wiki/
с:Танзания	у:5	т:с	р:ж	и:7	у1:a
с:Таня	у:2	т:с	р:ж	о:о	и:2	у1:a
с:Тарас	у:4	т:с	р:м	о:о	и:1	у1:a
с:Тарту	у:2	т:с	р:м	и:0
с:Таруса	у:4	т:с	р:ж	и:1	у1:a	з:ударение предположительно
с:Татарстан	у:8	т:с	р:м	и:1	у1:a
с:Татышлы	у:4	т:с	мн	р:м	и:1	у1:a	з:Верхние Татышлы
с:Татьяна	у:5	т:с	р:ж	о:о	и:1	у1:a
с:Тахтамукай	у:9	т:с	р:м	и:6	у1:a	з:аул в Адыгее
с:Ташкент	у:5	т:с	р:м	и:1	у1:a
с:Тая	у:2	т:с	р:ж	о:о	и:2	у1:a
с:Тбилиси	у:5	т:с	р:м	и:0
с:Тверь	у:3	т:с	р:ж	и:8	у1:f2	фп:.м
с:Тегеран	у:6	т:с	р:м	и:1	у1:a
с:Тед	у:2	т:с	р:м	о:о	и:1	у1:a
с:Тель-Авив	у:8.2	т:с	р:м	и:1	у1:a
с:Тенгиз	у:5	т:с	р:м	о:о	и:1	у1:a
с:Тенерифе	у:6	т:с	р:м	и:0
с:Теннесси	у:2	т:с	р:м	и:0
с:Теодоро	у:5	т:с	р:м	о:о	и:0
с:Теодор	у:5	т:с	р:м	о:о	и:1	у1:a
с:Тереза	у:4	т:с	р:ж	о:о	и:1	у1:a
с:Терентий	у:4	т:с	р:м	о:о	и:7	у1:a	до:26
с:Тернополь	у:5	т:с	р:м	и:2	у1:a
с:Терри	у:2	т:с	р:ж	о:о
с:Терри	у:2	т:с	р:м	о:о
с:Тетово	у:2	т:с	р:с	и:1	у1:a
с:Тетюши	у:4	т:с	мн	р:м	и:4	у1:a	з:ударение по википедии: http://ru.wikipedia.org/wiki/Тетюши; окончание предположительно
с:Техас	у:4	т:с	р:м	и:1	у1:a
с:Тёркс	у:2	т:с	р:м	и:1	у1:a
с:Тибет	у:4	т:с	р:м	и:1	у1:a
с:Тигиль	у:4	т:с	р:м	и:2	у1:b	з:ударение предположительно; склонение по гуглу
с:Тиличики	у:4	т:с	мн	р:ж	и:3	у1:a	з:упоминаний в Гугле "из Тиличик" - 739	вар:1
с:Тиличики	у:4	т:с	мн	р:м	и:3	у1:a	з:упоминаний в Гугле "из Тиличиков" - 285	вар:2
с:Тимоти	у:2	т:с	р:м	о:о	и:0
с:Тимофей	у:6	т:с	р:м	о:о	и:1	у1:a
с:Тим	у:2	т:с	р:м	о:о	и:1	у1:a
с:Тимур	у:4	т:с	р:м	о:о	и:1	у1:a
с:Тина	у:2	т:с	р:ж	о:о	и:1	у1:a
с:Тисаагтелек	у:10	т:с	р:м	и:1	у1:a	з:ударение проставлено по наитию
с:Тисуль	у:4	т:с	р:ж	и:8	у1:a	з:ударение предположительно; склонение по гуглу
с:Тит	у:2	т:с	р:м	о:о	и:1	у1:a
с:Тихвин	у:2	т:с	р:м	и:1	у1:a
с:Тихон	у:2	т:с	р:м	о:о	и:1	у1:a
с:Тихорецк	у:6	т:с	р:м	и:3	у1:a
с:Тобольск	у:4	т:с	р:м	и:3	у1:a
с:Того	у:2	т:с	р:ж	и:0	з:Тоголезская Республика
с:Тойла	у:2	т:с	р:ж	и:0	з:поселок в Эстонии
с:Тойота	у:4	т:с	р:ж	и:1	у1:a
с:Токио	у:2	т:с	р:м	и:0
с:Тольятти	у:5	т:с	р:м	и:0
с:Толя	у:2	т:с	р:м	рм:ж	о:о	и:2	у1:a
с:Томари	у:6	т:с	р:м	и:0	з:ударение по википедии: http://ru.wikipedia.org/wiki/Томари; предположительно не склоняется
с:Томас	у:2	т:с	р:м	о:о	и:1	у1:a
с:Тома	у:2	т:с	р:ж	о:о	и:1	у1:a
с:Томск	у:2	т:с	р:м	и:3	у1:a
с:Тони	у:2	т:с	р:м	о:о
с:Тоора-Хем	у:5	т:с	р:м	и:1	у1:a	з:ударение по википедии: http://ru.wikipedia.org/wiki/Тоора-Хем
с:Топки	у:5	т:с	мн	р:м	и:3	у1:b	з:есть деревня и город с разным ударением: http://ru.wikipedia.org/wiki/Топки
с:Торжок	у:5	т:с	р:м	и:3	у1:b	ч
с:Торонто	у:4	т:с	р:м	и:0
с:Тосно	у:2	т:с	р:м	и:0	з:http://ru.wikipedia.org/wiki/Тосно
с:Тося	у:2	т:с	р:ж	о:о	и:2	у1:a
с:тот	у:2	т:мс-п	и:1	у1:b
с:Тракай	у:5	т:с	р:м	и:6	у1:a	з:город в Литве
с:Трансаэро	у:6	т:с	р:ж	и:0
с:Транснефть	у:7	т:с	р:ж	и:8	у1:a
с:Трёхгорный	у:6	т:с	т2:п	р:м	и:1	у1:a	ч
с:Триполи	у:3	т:с	р:м	и:0
с:Три-Риверс	у:6.3	т:с	р:м	и:0
с:Три-Систерс	у:6.3	т:с	р:м	и:0
с:Тристан	у:6	т:с	р:м	о:о	и:1	у1:a
с:Троицк	у:3	т:с	р:м	и:3	у1:a
с:Трой	у:3	т:с	р:м	о:о	и:1	у1:a
с:Тросна	у:3	т:с	р:ж	и:1	у1:a
с:Трофим	у:5	т:с	р:м	о:о	и:1	у1:a
с:Троянка	у:4	т:с	р:ж	и:3	у1:a	ч
с:Туапсе	у:6	т:с	р:м	и:0
с:Тува	у:4	т:с	р:ж	и:1	у1:b
с:Туймазы	у:7	т:с	мн	р:м	и:1	у1:a
с:Тула	у:2	т:с	р:ж	и:1	у1:a
с:Тулуза	у:4	т:с	р:ж	и:1	у1:a
с:Тульчин	у:6	т:с	р:м	и:1	у1:a	з:http://ru.wikipedia.org/wiki/Тульчин
с:Тунис	у:4	т:с	р:м	и:1	у1:a
с:Тургояк	у:6	т:с	р:м	и:3	у1:b
с:Турин	у:2	т:с	р:м	и:1	у1:a
с:Туркменистан	у:11	т:с	р:м	и:1	у1:a
с:Туркмения	у:6	т:с	р:ж	и:7	у1:a
с:Туркс	у:2	т:с	р:м	и:1	у1:a
с:Туровец	у:6	т:с	р:м	и:5	у1:b	ч
с:Турция	у:2	т:с	р:ж	и:7	у1:a
с:Турья	у:2	т:с	р:ж	и:6	у1:a	ч
с:Тутаев	у:4	т:с	р:м	и:1	у1:a	з:город в России
с:Тушино	у:2	т:с	р:с	и:1	у1:a
с:Тыва	у:4	т:с	р:ж	и:1	у1:b
с:Тывров	у:2	т:с	р:м	и:1	у1:a	з:ударение: http://ru.wikipedia.org/wiki/Тывров
с:Тээли	у:5	т:с	р:м	и:0	з:ударение предположительно
с:Тюмень	у:4	т:с	р:ж	и:8	у1:a
с:Ува	у:3	т:с	р:ж	и:1	у1:c
с:Уве	у:1	т:с	р:м	о:о	и:0
с:Увильды	у:7	т:с	мн	р:м	и:1	у1:b
с:Уводь	у:1	т:с	р:ж	и:8	у1:a
с:Уганда	у:3	т:с	р:ж	и:1	у1:a
с:Углич	у:1	т:с	р:м	и:4	у1:a
с:Угловое	у:6	т:с	т2:п	р:с	и:1	у1:a
с:Удмуртия	у:4	т:с	р:ж	и:7	у1:a
с:Ужгород	у:1	т:с	р:м	и:1	у1:a
с:Узбекистан	у:9	т:с	р:м	и:1	у1:a
с:Уилкания	у:5	т:с	р:ж	и:7	у1:a	з:город в Австралии
с:Уилфрид	у:2	т:с	р:м	о:о	и:1	у1:a
с:Уильям	у:2	т:с	р:м	о:о	и:1	у1:a
с:УИН	у:2
с:УИН	у:2	т:с	р:м
с:УИС	у:2	т:с	р:ж
с:Уитни	у:2	т:с	р:ж	о:о
с:Уйское	у:1	т:с	т2:п	р:с	и:3	у1:a
с:Украина	у:5	т:с	р:ж	и:1	у1:a
с:Укрнафта	у:5	т:с	р:ж	и:1	у1:a	з:крупнейшая нефте- и газодобывающая компания Украины
с:Улан-уде	у:8.3	т:с	р:м	и:0
с:Улан-Удэ	у:8.3	т:с	р:м	и:0
с:Ульяна	у:4	т:с	р:ж	о:о	и:1	у1:a
с:Ульяновск	у:4	т:с	р:м	и:3	у1:a
с:Умань	у:1	т:с	р:ж	и:8	у1:a
с:Уна	у:1	т:с	р:ж	о:о	и:1	у1:a
с:Унеча	у:3	т:с	р:ж	и:4	у1:a
с:Уни	у:1	т:с	р:м	и:0	з:всё предположительно; http://ru.wikipedia.org/wiki/Уни
с:Уоллопс	у:2	т:с	р:м	и:1	у1:a
с:Уолтер	у:2	т:с	р:м	о:о	и:1	у1:a
с:Уппсала	у:5	т:с	р:ж	и:1	у1:a	фр:D0%A3%D0%BF%D0%BF%D1%81%D0%B0%D0%BB%D0%B0_)	слсч://ru.wikipedia.org/wiki/
с:Упсала	у:4	т:с	р:ж	и:1	у1:a	фр:D0%A3%D0%BF%D0%BF%D1%81%D0%B0%D0%BB%D0%B0_)	слсч://ru.wikipedia.org/wiki/
с:Уралвагонзавод	у:13	т:с	р:м	и:1	у1:a
с:Уралмаш	у:6	т:с	р:м	и:4	у1:a
с:Уралметаллургмонтаж	у:18.3	т:с	р:м	и:4	у1:a
с:Урал	у:3	т:с	р:м	и:1	у1:a
с:Урарту	у:3	т:с	р:с	и:0
с:Уренгой	у:6	т:с	р:м	и:6	у1:a
с:Урень	у:3	т:с	р:м	и:2	у1:a	з:ударение и склонение по википедии: http://ru.wikipedia.org/wiki/Урень
с:Уржум	у:4	т:с	р:м	и:1	у1:a
с:Урус-Мартан	у:10.3	т:с	р:м	и:1	у1:a	з:http://ru.wikipedia.org/wiki/Урус-Мартан
с:Усолье	у:3	т:с	р:с	и:6	у1:a	ч
с:Уссурийск	у:6	т:с	р:м	и:3	у1:a
с:Усть-Илимск	у:8	т:с	р:м	и:3	у1:a
с:Усть-Уйск	у:6.1	т:с	р:м	и:3	у1:a
с:Утёс	у:3	т:с	р:м	и:1	у1:a
с:Утрехт	у:1	т:с	р:м	и:1	у1:a	з:город в Нидерландах
с:Утулик	у:5	т:с	р:м	и:3	у1:a
с:Уфалей	у:5	т:с	р:м	и:6	у1:a
с:Уфа	у:3	т:с	р:ж	и:1	у1:b	фп:.м
с:УФСИН	у:4	т:с	р:ж
с:Ухта	у:4	т:с	р:ж	и:1	у1:d	фп:.м
с:Ухтохма	у:4	т:с	р:ж	и:1	у1:a
с:Учалы	у:5	т:с	мн	р:м	и:1	у1:b
с:Уч-Дере	у:7	т:с	р:м	и:0	з:поселок
с:Уэйн	у:2	т:с	р:м	о:о	и:1	у1:a
с:Уэльс	у:2	т:с	р:м	и:1	у1:a
с:Уютное	у:2	т:с	т2:п	р:с	и:1	у1:a
с:Фалёнки	у:4	т:с	мн	р:ж	и:3	у1:a	ч
с:Фатеж	у:2	т:с	р:м	и:7	у1:a
с:Фатимат	у:6	т:с	р:ж	о:о	и:0
с:Фауст	у:2	т:с	р:м	о:о	и:1	у1:a
с:Феликс	у:2	т:с	р:м	о:о	и:1	у1:a
с:Фелиция	у:4	т:с	р:ж	о:о	и:7	у1:a
с:Феодосий	у:5	т:с	р:м	о:о	и:7	у1:a	до:26
с:Феодосия	у:5	т:с	р:ж	и:7	у1:a
с:Феофан	у:5	т:с	р:м	о:о	и:1	у1:a
с:Фердинанд	у:7	т:с	р:м	о:о	и:1	у1:a
с:Феруза	у:6	т:с	р:ж	о:о	и:1	у1:b
с:Фёдор	у:2	т:с	р:м	о:о	и:1	у1:a
с:Фиат	у:3	т:с	р:м	и:1	у1:a
с:Фигерас	у:4	т:с	р:м	и:1	у1:a	з:город в Испании
с:Филадельфия	у:6	т:с	р:ж	и:7	у1:a
с:Филимон	у:6	т:с	р:м	о:о	и:1	у1:a
с:Филиппа	у:4	т:с	р:ж	о:о	и:1	у1:a
с:Филиппины	у:7	т:с	мн	р:ж	и:1	у1:a
с:Филиппов	у:4	т:с	р:м	о:о	и:1	у1:a
с:Филипп	у:4	т:с	р:м	о:о	и:1	у1:a
с:Филип	у:4	т:с	р:м	о:о	и:1	у1:a
с:Филлипов	у:5	т:с	р:м	о:о	и:1	у1:a
с:Филлис	у:2	т:с	р:ж	о:о
с:Фил	у:2	т:с	р:м	о:о	и:1	у1:a
с:Финляндия	у:5	т:с	р:ж	и:7	у1:a
с:Фиона	у:3	т:с	р:ж	о:о	и:1	у1:a
с:Флойд	у:3	т:с	р:м	о:о	и:1	у1:a
с:Флора	у:3	т:с	р:ж	о:о	и:1	у1:a
с:Флоренция	у:5	т:с	р:ж	и:7	у1:a
с:Флорида	у:5	т:с	р:ж	и:1	у1:a
с:Фольксваген	у:8	т:с	р:м	и:1	у1:a
с:Фома	у:4	т:с	р:м	рм:ж	о:о	и:1	у1:b	до:29
с:Форд	у:2	т:с	р:м	и:1	у1:a
с:Форос	у:4	т:с	р:м	и:1	у1:a
с:Фотошоп	у:6	т:с	р:м	и:1	у1:a
с:Франк	у:3	т:с	р:м	о:о	и:3	у1:a
с:Франсуа	у:7	т:с	р:м	о:о	и:0
с:Франция	у:3	т:с	р:ж	и:7	у1:a
с:Франческа	у:6	т:с	р:ж	о:о	и:3	у1:a	ч
с:Франческо	у:6	т:с	р:м	о:о	и:0
с:Фредерик	у:3	т:с	р:м	о:о	и:3	у1:a
с:Фредерик	у:7	т:с	р:м	о:о	и:3	у1:a
с:Фред	у:3	т:с	р:м	о:о	и:1	у1:a
с:Фрида	у:3	т:с	р:ж	о:о	и:1	у1:a
с:Фридрих	у:3	т:с	р:м	о:о	и:3	у1:a
с:Фриц	у:3	т:с	р:м	о:о	и:1	у1:a
с:Фрол	у:3	т:с	р:м	о:о	и:1	у1:b	з:http://www.imena.org/decl_mn.html
с:Фрунзе	у:3	т:с	р:м	и:0
с:Фрэнк	у:3	т:с	р:м	о:о	и:3	у1:a
с:ФСИН	у:3	т:с	р:ж
с:Фурманов	у:2	т:с	р:м	и:1	у1:a	з:город в России
с:Фьюджи	у:3	т:с	р:м	и:0
с:Хабаровск	у:4	т:с	р:м	и:3	у1:a
с:Хаббл	у:2	т:с	р:м	и:1	у1:a	з:телескоп
с:Хайнань	у:5	т:с	р:м	и:2	у1:a
с:Хайшат	у:5	т:с	р:ж	о:о	и:0
с:Хакасия	у:4	т:с	р:ж	и:7	у1:a
с:Хактаныр	у:7	т:с	р:м	о:о	и:1	у1:a
с:Хамовники	у:4	т:с	мн	р:м	и:3	у1:a
с:Ханкенди	у:8	т:с	р:м	и:0
с:Ханкенды	у:8	т:с	р:м
с:Ханна	у:2	т:с	р:ж	о:о	и:1	у1:a
с:Ханна	у:2	т:с	р:ж	о:о	и:1	у1:a
с:Ханты-Мансийский	у:11.5	т:п	и:3	у1:a	фз:^к	фн:^с	з:прилагательное от Ханты-Мансийск
с:Ханты-Мансийск	у:11.5	т:с	р:м	и:3	у1:a
с:Ханья	у:5	т:с	р:ж	и:6	у1:b	ч	з:ударение в Википедии двоякое
с:Харабали	у:8	т:с	мн	р:м	и:2	у1:b
с:Харитон	у:6	т:с	р:м	о:о	и:1	у1:a
с:Харманли	у:2	т:с	р:м	и:0
с:Харрис	у:2	т:с	р:м	о:о	и:1	у1:a
с:Харьков	у:2	т:с	р:м	и:1	у1:a
с:Хасавюрт	у:6	т:с	р:м	и:1	у1:a
с:Хасан	у:4	т:с	р:м	о:о	и:1	у1:a
с:Хейдок	у:2	т:с	р:м	и:3	у1:a
с:Хейнявеси	у:7	т:с	р:м	и:0	з:нас. пункт в Финляндии
с:Хелен	у:2	т:с	р:ж	о:о
с:Хеллоуин	у:7	т:с	р:м	и:1	у1:a
с:Хельмут	у:2	т:с	р:м	о:о	и:1	у1:a
с:Хельсинки	у:2	т:с	р:м	и:0
с:Херенд	у:2	т:с	р:м	и:1	у1:a	з:город в Венгрии
с:Херсонес	у:7	т:с	р:м	и:1	у1:a
с:Херцег-Нови	у:9.2	т:с	р:м	и:0	з:нас. пункт в Черногории
с:Химки	у:2	т:с	мн	р:ж	и:3	у1:a	ч
с:Химли	у:2	т:с	р:м	и:0
с:Хинкли	у:2	т:с	р:м	и:0
с:Хову-Аксы	у:9.2	т:с	р:м	и:0	з:ударение предположительно
с:Ходжа	у:5	т:с	р:м	рм:ж	о:о	и:4	у1:b
с:Хоккайдо	у:5	т:с	р:м	и:0
с:Хокли	у:2	т:с	р:м	и:0
с:Холли	у:2	т:с	р:ж	о:о
с:Холм-Жирковский	у:10.2	т:с	т2:п	р:м	и:1	у1:a
с:Холсворти	у:6	т:с	р:м	и:0
с:Холуй	у:2	т:с	р:м	и:6	у1:a	з:село
с:Хонда	у:2	т:с	р:ж	и:1	у1:a
с:Хонли	у:2	т:с	р:м	и:0
с:Хорватия	у:5	т:с	р:ж	и:7	у1:a
с:Хорли	у:2	т:с	р:м	и:0
с:Хосе	у:4	т:с	р:м	о:о	и:0
с:Хошимин	у:6	т:с	р:м	и:1	у1:a
с:Христос	у:6	т:с	р:м	о:о	и:1	у1:a
с:Хуан	у:3	т:с	р:м	о:о	и:1	у1:a
с:Хуанхэ	у:6	т:с	р:ж	и:0
с:Хуахин	у:5	т:с	р:м	и:1	у1:a
с:Хьюго	у:3	т:с	р:м	о:о	и:0
с:Хьюстон	у:3	т:с	р:м	и:1	у1:a
с:Хью	у:3	т:с	р:м	о:о	и:0
с:Хэллоуин	у:7	т:с	р:м	и:1	у1:a
с:Хэрдфордшир	у:2	т:с	р:м	и:1	у1:a
с:Хюндай	у:5	т:с	р:м	и:6	у1:a
с:Цаган-Аман	у:9.4	т:с	р:м	и:1	у1:a	з:ударение предположительно
с:ЦАР	у:2	т:с	р:ж	и:0
с:Царьград	у:7	т:с	р:м	и:1	у1:a
с:Цезарь	у:2	т:с	р:м	о:о	и:2	у1:a
с:Центробанк	у:8	т:с	р:м	и:3	у1:a
с:Цесис	у:2	т:с	р:м	и:1	у1:a	з:город в Латвии
с:Цеснабанк	у:7.2	т:с	р:м	и:3	у1:a
с:Цна	у:3	т:с	р:ж	и:1	у1:b
с:ЦСКА	у:4	т:с	р:м	и:0
с:Цюрих	у:2	т:с	р:м	и:3	у1:a
с:Чаа-Хольский	у:6	т:п	и:3	у1:a	гпр:Чаа-Холь	фз:^к	фн:^с
с:Чагандо	у:7	т:с	р:ж	и:0	з:провинция Кореи; ударение по Википедии
с:Чарли	у:2	т:с	р:м	о:о
с:Чарльз	у:2	т:с	р:м	о:о	и:1	у1:a
с:часто	у:2	т:н	и:0
с:Часучей	у:6	т:с	р:м	и:6	у1:a	з:ударение предположительно
с:Чебаркуль	у:7	т:с	р:м	и:2	у1:b
с:Чебоксары	у:7	т:с	мн	р:ж	и:1	у1:a
с:Чебурашка	у:6	т:с	р:м	рм:ж	о:о	и:3	у1:a	ч
с:Чегем	у:4	т:с	р:м	и:1	у1:a	з:город и река в Кабардино-Балкарии
с:Челтнем	у:2	т:с	р:м	и:1	у1:a
с:Челябинск	у:4	т:с	р:м	и:3	у1:a
с:Ченстохова	у:8	т:с	р:ж	и:1	у1:a	з:город в Польше
с:Череповец	у:8	т:с	р:м	и:5	у1:b	ч
с:Черкассы	у:5	т:с	мн	р:ж	и:1	у1:a
с:Черкесск	у:5	т:с	р:м	и:3	у1:a
с:Чернигов	у:5	т:с	р:м	и:1	у1:a
с:Черновцы	у:8	т:с	мн	р:м	и:5	у1:b	ч
с:Черногория	у:7	т:с	р:ж	и:7	у1:a
с:Черноморское	у:7	т:с	т2:п	р:с	и:3	у1:a
с:Черусти	у:2	т:с	мн	р:м	и:2	у1:a	з:склонение предположительно по гуглу; http://ru.wikipedia.org/wiki/Черусти
с:Чехия	у:2	т:с	р:ж	и:7	у1:a
с:Чехословакия	у:9	т:с	р:ж	и:7	у1:a
с:Чечено-Ингушетия	у:13.4	т:с	р:ж	и:7	у1:a
с:Чечня	у:5	т:с	р:ж	и:2	у1:b	ч
с:Чикаго	у:4	т:с	р:м	и:0
с:Чикой	у:4	т:с	р:м	и:6	у1:a	з:Красный Чикой
с:Чикола	у:6	т:с	р:ж	и:1	у1:b	з:http://ru.wikipedia.org/wiki/Чикола
с:Чили	у:2	т:с	р:сж	о:н	и:0
с:Чита	у:4	т:с	р:ж	и:1	у1:b
с:Чишмы	у:5	т:с	мн	р:м	и:1	у1:b	з:склонение по гуглу; ударение по википедии: http://ru.wikipedia.org/wiki/Чишмы
с:Чувашия	у:4	т:с	р:ж	и:7	у1:a
с:Чугуев	у:4	т:с	р:м	и:1	у1:a
с:Чукотка	у:4	т:с	р:ж	и:3	у1:a	ч
с:Чулпан	у:5	т:с	р:ж	о:о	и:0
с:Чулышман	у:7	т:с	р:м	и:1	у1:a
с:Чусовой	у:6	т:с	т2:п	р:м	и:1	у1:b
с:Чухлома	у:2	т:с	р:ж	и:1	у1:a
с:Шагане	у:6	т:с	р:ж	о:о	и:0
с:Шадринск	у:2	т:с	р:м	и:1	у1:a
с:Шалва	у:5	т:с	р:м	рм:ж	о:о	и:1	у1:b	фп:.м
с:Шали	у:4	т:с	р:м	и:0	з:ударение и склонение по википедии: http://ru.wikipedia.org/wiki/Шали
с:Шамиль	у:4	т:с	р:м	о:о	и:2	у1:a
с:Шанхай	у:5	т:с	р:м	и:6	у1:a
с:Шапокляк	у:7	т:с	р:ж	и:0
с:Шариф	у:4	т:с	р:м	о:о	и:1	у1:a
с:Шарлотта	у:5	т:с	р:ж	о:о	и:1	у1:a
с:Шарль	у:2	т:с	р:м	о:о	и:2	у1:a
с:Шарм-эль-Шейх	у:11	т:с	р:м	и:3	у1:a
с:Шарья	у:5	т:с	р:ж	и:6	у1:b	ч	фп:.м
с:Шатки	у:5	т:с	мн	р:м	и:3	у1:b	ч	з:ударенеи по википедии: http://ru.wikipedia.org/wiki/Шатки
с:Шатура	у:4	т:с	р:ж	и:1	у1:a
с:Шаффхаузен	у:6	т:с	р:м	и:1	у1:a	з:город в Швейцарии
с:Шахты	у:2	т:с	мн	р:ж	и:1	у1:a
с:Шахунья	у:4	т:с	р:ж	и:6	у1:a	ч
с:Шацк	у:2	т:с	р:м	и:3	у1:a
с:Шаян	у:3	т:с	р:м	и:1	у1:a	з:курорт в Закарпатье
с:Шведт	у:3	т:с	р:м	и:1	у1:a
с:Швейцария	у:6	т:с	р:ж	и:7	у1:a
с:Шверин	у:5	т:с	р:м	и:1	у1:a	з:город в Германии
с:Швеция	у:3	т:с	р:ж	и:7	у1:a
с:Шевроле	у:7	т:с	р:с	и:0
с:Шейла	у:2	т:с	р:ж	о:о	и:1	у1:a
с:Шелли	у:2	т:с	р:м	о:о	и:0
с:Шереметьево	у:6	т:с	р:с	и:1	у1:a
с:Шерил	у:2	т:с	р:ж	о:о
с:Шерлок	у:2	т:с	р:м	о:о	и:3	у1:a
с:Шигоны	у:4	т:с	мн	р:ж	и:1	у1:a	з:ударение предположительно; склонение по гуглу
с:Шон	у:2	т:с	р:м	о:о	и:1	у1:a
с:Шотландия	у:5	т:с	р:ж	и:7	у1:a
с:Шри-ланка	у:9	т:с	р:ж	и:3	у1:c	з:ударение по википедии: http://ru.wikipedia.org/wiki/Шри-Ланка
с:Штаты	у:3	т:с	мн	р:м	и:1	у1:a
с:Штормовое	у:8	т:с	т2:п	р:с	и:1	у1:a
с:Шумиха	у:4	т:с	р:ж	и:3	у1:a
с:Шуя	у:2	т:с	р:ж	и:6	у1:a
с:Шэрон	у:2	т:с	р:ж	о:о
с:Щебетовка	у:6	т:с	р:ж	и:3	у1:a	ч
с:Щёлкино	у:2	т:с	р:с	и:1	у1:a
с:Щёлково	у:2	т:с	р:с	и:3	у1:a
с:Щигры	у:5	т:с	мн	р:м	и:1	у1:b	з:ударение по википедии: http://ru.wikipedia.org/wiki/Щигры
с:Щучье	у:2	т:с	т2:мс	р:с	и:6	у1:a	ч
с:Ыб	у:1	т:с	р:м	и:1	у1:a	з:нас. пункт в Коми
с:Эбби	у:1	т:с	р:ж	о:о
с:Эбола	у:3	т:с	р:ж	и:1	у1:a
с:Эвелин	у:1	т:с	р:ж	о:о
с:Эверест	у:5	т:с	р:м	и:1	у1:a
с:Эврика	у:1	т:с	р:ж	о:о	и:3	у1:a
с:Эгер	у:1	т:с	р:м	и:1	у1:a	з:город в Венгрии
с:Эдвард	у:1	т:с	р:м	о:о	и:1	у1:a
с:Эдвин	у:1	т:с	р:м	о:о	и:1	у1:a
с:Эдгар	у:1	т:с	р:м	о:о	и:1	у1:a
с:Эдди	у:1	т:с	р:м	о:о	и:0
с:Эдинбург	у:6	т:с	р:м	и:3	у1:a
с:Эдит	у:3	т:с	р:ж	о:о	и:0
с:Эдмунд	у:4	т:с	р:м	о:о	и:1	у1:a
с:Эдуардо	у:4	т:с	р:м	о:о	и:0
с:Эдуард	у:4	т:с	р:м	о:о	и:1	у1:a
с:Эйвон	у:1	т:с	р:ж	з:компания - производитель косметики
с:Эквадор	у:6	т:с	р:м	и:1	у1:a
с:Элвин	у:1	т:с	р:м	о:о	и:1	у1:a
с:Электроугли	у:8.3	т:с	мн:от	р:м	и:2	у1:a
с:Элен	у:3	т:с	р:ж	о:о	и:0
с:Элеонора	у:6	т:с	р:ж	о:о	и:1	у1:a
с:Элизабет	у:3	т:с	р:ж	о:о
с:Элиза	у:3	т:с	р:ж	о:о	и:1	у1:a
с:Элиза	у:3	т:с	р:ж	о:о	и:1	у1:a
с:Элисон	у:1	т:с	р:ж	о:о
с:Элиста	у:6	т:с	р:ж	и:1	у1:b	фп:.м
с:Элис	у:1	т:с	р:ж	о:о	и:0
с:Элла	у:1	т:с	р:ж	о:о	и:1	у1:a
с:Эллен	у:1	т:с	р:ж	о:о
с:Эллис	у:1	т:с	р:ж	о:о	и:0
с:Элли	у:1	т:с	р:ж	о:о	и:0
с:Элтон	у:1	т:с	р:м	о:о	и:1	у1:a
с:Эльбрус	у:6	т:с	р:м	и:1	у1:a
с:Эльвира	у:5	т:с	р:ж	о:о	и:1	у1:a
с:Эльза	у:1	т:с	р:ж	о:о	и:1	у1:a
с:Эльмира	у:5	т:с	р:ж	о:о	и:1	у1:a
с:Эль-Пасо	у:6	т:с	р:м	и:0
с:Эля	у:1	т:с	р:ж	о:о	и:2	у1:a
с:Эмбер	у:1	т:с	р:ж	о:о
с:Эмили	у:1	т:с	р:ж	о:о
с:Эмиль	у:3	т:с	р:м	о:о	и:2	у1:a
с:Эмир	у:3	т:с	р:м	о:о	и:1	у1:a
с:Эми	у:1	т:с	р:ж	о:о
с:Эмма	у:1	т:с	р:ж	о:о	и:1	у1:a
с:Энгельс	у:1	т:с	р:м	и:1	у1:a
с:Энди	у:1	т:с	р:м	о:о
с:Эндрю	у:1	т:с	р:м	о:о
с:Энергомаш	у:8.3	т:с	р:м	и:4	у1:a
с:Энни	у:1	т:с	р:ж	о:о
с:Энн	у:1	т:с	р:ж	о:о
с:Энрико	у:4	т:с	р:м	о:о	и:0
с:Энтони	у:1	т:с	р:м	о:о
с:Эрика	у:1	т:с	р:ж	о:о	и:3	у1:a
с:Эриксон	у:1	т:с	р:м	о:о	и:1	у1:a
с:Эрик	у:1	т:с	р:м	о:о	и:3	у1:a
с:Эрин	у:1	т:с	р:ж	о:о
с:Эрих	у:1	т:с	р:м	о:о	и:3	у1:a
с:Эрнст	у:1	т:с	р:м	о:о	и:1	у1:a
с:Эр-Рияд	у:6	т:с	р:м	и:1	у1:a
с:Эртиль	у:4	т:с	р:м	и:2	у1:a
с:Эстергом	у:1	т:с	р:м	и:1	у1:a	з:город в Венгрии
с:Эстония	у:4	т:с	р:ж	и:7	у1:a
с:Эстосадок	у:8.1	т:с	р:м	и:3	у1:b	ч
с:Эсто-Садок	у:9.1	т:с	р:м	и:3	у1:b	ч
с:Эсфирь	у:4	т:с	р:ж	о:о	и:8	у1:a	з:библейский персонаж
с:Этан	у:1	т:с	р:м	о:о	и:1	у1:a
с:Этномир	у:6	т:с	р:м	и:1	у1:c	фп:.м	з:этнографический парк-музей в России
с:этот	у:1	т:мс-п	и:1	у1:a
с:Этьен	у:4	т:с	р:м	о:о	и:1	у1:a
с:Эфиопия	у:4	т:с	р:ж	и:7	у1:a
с:Эшли	у:1	т:с	р:ж	о:о
с:ЮАР	у:2	т:с	р:ж	и:0
с:Ювяскюля	у:1	т:с	р:ж	и:2	у1:a
с:Югла	у:1	т:с	р:ж	и:1	у1:a
с:Югославия	у:6	т:с	р:ж	и:7	у1:a
с:Южа	у:1	т:с	р:ж	и:4	у1:a
с:Южно-Сахалинск	у:11	т:с	р:м	и:1	у1:a
с:Юлиана	у:4	т:с	р:ж	о:о	и:1	у1:a
с:Юлиан	у:4	т:с	р:м	о:о	и:1	у1:a
с:Юлий	у:1	т:с	р:м	о:о	и:7	у1:a	до:26
с:Юлия	у:1	т:с	р:ж	о:о	и:7	у1:a
с:Юля	у:1	т:с	р:ж	о:о	и:2	у1:a
с:Юнистрим	у:7	т:с	р:м	и:1	у1:a
с:Юнона	у:3	т:с	р:ж	о:о	и:1	у1:a
с:Юра	у:1	т:с	р:м	рм:ж	о:о	и:1	у1:a
с:Юрга	у:4	т:с	р:ж	и:3	у1:b	фп:.м
с:Юрген	у:1	т:с	р:м	о:о	и:1	у1:a
с:Юрий	у:1	т:с	р:м	о:о	и:7	у1:a	до:26
с:Юрик	у:1	т:с	р:м	о:о	и:3	у1:a
с:Юрла	у:4	т:с	р:ж	и:1	у1:b
с:Юрт-Уйск	у:5.1	т:с	р:м	и:3	у1:a
с:Юрьев-польский	у:8.1	т:с	т2:п	р:м	и:3	у1:a
с:Юрьев-Польский	у:8	т:с	т2:п	р:м	и:3	у1:a
с:Юрья	у:4	т:с	р:ж	и:6	у1:b	з:ударение: http://ru.wikipedia.org/wiki/Юрья
с:Юрюзань	у:5	т:с	р:ж	и:8	у1:a
с:Юсуф	у:3	т:с	р:м	о:о	и:1	у1:a
с:Юта	у:1	т:с	р:ж	и:1	у1:a
с:Ява	у:1	т:с	р:ж	и:1	у1:a
с:Ягандо	у:6	т:с	р:ж	и:0	з:провинция Кореи; ударение по аналогии с Чагандо
с:Ягодное	у:1	т:с	т2:п	р:с	и:1	у1:a	ч
с:Ядвига	у:4	т:с	р:ж	о:о	и:3	у1:a
с:Яков	у:1	т:с	р:м	о:о	и:1	у1:a
с:Якутия	у:3	т:с	р:ж	и:7	у1:a
с:Якутск	у:3	т:с	р:м	и:3	у1:a
с:Якшур-бодья	у:11.4	т:с	р:ж	и:6	у1:b	ч	з:ударение и склонение предположительно
с:Ялта	у:1	т:с	р:ж	и:1	у1:a
с:Ямайка	у:3	т:с	р:ж	и:3	у1:a	ч
с:Ямало-Ненецк	у:8.3	т:с	р:м	и:3	у1:a
с:Ямал	у:3	т:с	р:м	и:1	у1:a
с:Яна	у:1	т:с	р:ж	о:о	и:1	у1:a
с:Яндекс	у:1	т:с	р:м	и:1	у1:a
с:Ян	у:1	т:с	р:м	о:о	и:1	у1:a
с:Януш	у:1	т:с	р:м	о:о	и:1	у1:a
с:Янцзы	у:5	т:с	р:ж	и:0
с:Япония	у:3	т:с	р:ж	и:7	у1:a
с:Ярко	у:1	т:с	р:м	о:о
с:Ярополк	у:5	т:с	р:м	о:о	и:3	у1:a
с:Ярослава	у:6	т:с	р:ж	о:о	и:1	у1:a
с:Ярославль	у:6	т:с	р:м	и:2	у1:a
с:Ярослав	у:6	т:с	р:м	о:о	и:1	у1:a
с:Яр-Сале	у:5	т:с	р:м	и:0	з:http://ru.wikipedia.org/wiki/Яр-Сале
с:Яша	у:1	т:с	р:м	рм:ж	о:о	и:4	у1:a
с:Яя	у:1	т:с	р:ж	и:2	у1:a
