# Copyright (C) 2003-2013  Juri Linkov <juri@jurta.org>
# License: GNU GPL 2 (see the file README)
# Version: 0.1.0

use utf8;
package Zaliz_Inflect;

=head1 NAME

Zaliz_Inflect - Словоизменение слов русского языка по словарю А.А.Зализняка
Zaliz_Inflect - Russian inflection from the dictionary by A.A.Zaliznyak

=head1 SYNOPSIS

Реализация правил, описанных в книге: Зализняк А. А. Грамматический словарь
русского языка: Словоизменение - 3-е изд. - М.: Рус.яз., 1987.

=cut

## Параметры

# $fic - feminine instrumental case:
# при ненулевом значении генерирует дополнительные формы
# творительного падежа с -ою, -ею, -ёю для слов женского рода
$fic = 1;

## Глобальные переменные

$vowels = "аеёиоуыэюя"; # гласные (vowel)
$consonants = "бвгджзйклмнпрстфхцчшщ"; # согласные (consonant)
$consonants2 = "бвгдзйклмнпрстфх"; # согласные без щипящих
$sch = "шжчщ"; # щипящие

## Парадигмы: соответствие части речи кодам склонений/спряжений

%paradigms =
(
 "с"      => ["ие","ре","де","ве","те","пе",
              "им","рм","дм","вм","тм","пм"],
 "п"      => ["пием","прем","пдем","пвемн","пвемо","птем","ппем",
              "пиеж","преж","пдеж","пвежн","пвежо","птеж","ппеж",
              "пиес","прес","пдес","пвесн","пвесо","птес","ппес",
              "пим" ,"прм" ,"пдм" ,"пвмн" ,"пвмо" ,"птм" ,"ппм" ,
              "кием","киеж","киес","кимм",
              "с"],
 "мс"     => ["и","р","д","в","т","п"],
 "мс-п"   => ["ием","рем","дем","вемн","вемо","тем","пем",
              "иеж","реж","деж","вежн","вежо","теж","пеж",
              "иес","рес","дес","весн","весо","тес","пес",
              "им" ,"рм" ,"дм" ,"вмн" ,"вмо" ,"тм" ,"пм" ,],
 "числ"   => ["и","р","д","вн","во","т","п"],
 "числ-п" => ["ием","рем","дем","вемн","вемо","тем","пем",
              "иеж","реж","деж","вежн","вежо","теж","пеж",
              "иес","рес","дес","весн","весо","тес","пес",
              "им" ,"рм" ,"дм" ,"вмн" ,"вмо" ,"тм" ,"пм" ,],
 "г"      => ["и",
              "пем","пеж","пес","пм",
              "н1е","н2е","н3е","н1м","н2м","н3м",
              "б1е","б2е","б3е","б1м","б2м","б3м",
              "!2е","!2м",
              "дн","дп",
              #"чнд",
              "чнд-пием","чнд-прем","чнд-пдем","чнд-пвемн","чнд-пвемо","чнд-птем","чнд-ппем",
              "чнд-пиеж","чнд-преж","чнд-пдеж","чнд-пвежн","чнд-пвежо","чнд-птеж","чнд-ппеж",
              "чнд-пиес","чнд-прес","чнд-пдес","чнд-пвесн","чнд-пвесо","чнд-птес","чнд-ппес",
              "чнд-пим" ,"чнд-прм" ,"чнд-пдм" ,"чнд-пвмн" ,"чнд-пвмо" ,"чнд-птм" ,"чнд-ппм" ,
              "чнд-кием","чнд-киеж","чнд-киес","чнд-кимм",
              #"чпд",
              "чпд-пием","чпд-прем","чпд-пдем","чпд-пвемн","чпд-пвемо","чпд-птем","чпд-ппем",
              "чпд-пиеж","чпд-преж","чпд-пдеж","чпд-пвежн","чпд-пвежо","чпд-птеж","чпд-ппеж",
              "чпд-пиес","чпд-прес","чпд-пдес","чпд-пвесн","чпд-пвесо","чпд-птес","чпд-ппес",
              "чпд-пим" ,"чпд-прм" ,"чпд-пдм" ,"чпд-пвмн" ,"чпд-пвмо" ,"чпд-птм" ,"чпд-ппм" ,
              "чпд-кием","чпд-киеж","чпд-киес","чпд-кимм",
              #"чнс",
              "чнс-пием","чнс-прем","чнс-пдем","чнс-пвемн","чнс-пвемо","чнс-птем","чнс-ппем",
              "чнс-пиеж","чнс-преж","чнс-пдеж","чнс-пвежн","чнс-пвежо","чнс-птеж","чнс-ппеж",
              "чнс-пиес","чнс-прес","чнс-пдес","чнс-пвесн","чнс-пвесо","чнс-птес","чнс-ппес",
              "чнс-пим" ,"чнс-прм" ,"чнс-пдм" ,"чнс-пвмн" ,"чнс-пвмо" ,"чнс-птм" ,"чнс-ппм" ,
              "чнс-кием","чнс-киеж","чнс-киес","чнс-кимм",
              #"чпс",
              "чпс-пием","чпс-прем","чпс-пдем","чпс-пвемн","чпс-пвемо","чпс-птем","чпс-ппем",
              "чпс-пиеж","чпс-преж","чпс-пдеж","чпс-пвежн","чпс-пвежо","чпс-птеж","чпс-ппеж",
              "чпс-пиес","чпс-прес","чпс-пдес","чпс-пвесн","чпс-пвесо","чпс-птес","чпс-ппес",
              "чпс-пим" ,"чпс-прм" ,"чпс-пдм" ,"чпс-пвмн" ,"чпс-пвмо" ,"чпс-птм" ,"чпс-ппм" ,
              "чпс-кием","чпс-киеж","чпс-киес","чпс-кимм"]
);

## Таблица стандартных окончаний
# (сгенерирована следующей командой)
# swiprolog -g "load_files(['main.pl','util.pl','zaliz.pl'],[silent(true)])" -t "print_all_wfi."

%wi_we_tab =
(
'ам1нб' => {'де' => 'ому','ие' => 'ый','пе' => 'ом','ре' => 'ого','те' => 'ым','ве' => 'ый','дм' => 'ым','им' => 'ые','пм' => 'ых','рм' => 'ых','тм' => 'ыми','вм' => 'ые',},
'ам1об' => {'де' => 'ому','ие' => 'ый','пе' => 'ом','ре' => 'ого','те' => 'ым','ве' => 'ого','дм' => 'ым','им' => 'ые','пм' => 'ых','рм' => 'ых','тм' => 'ыми','вм' => 'ых',},
'ам1ну' => {'де' => 'ому','ие' => 'ой','пе' => 'ом','ре' => 'ого','те' => 'ым','ве' => 'ой','дм' => 'ым','им' => 'ые','пм' => 'ых','рм' => 'ых','тм' => 'ыми','вм' => 'ые',},
'ам1оу' => {'де' => 'ому','ие' => 'ой','пе' => 'ом','ре' => 'ого','те' => 'ым','ве' => 'ого','дм' => 'ым','им' => 'ые','пм' => 'ых','рм' => 'ых','тм' => 'ыми','вм' => 'ых',},
'ам2нб' => {'де' => 'ему','ие' => 'ий','пе' => 'ем','ре' => 'его','те' => 'им','ве' => 'ий','дм' => 'им','им' => 'ие','пм' => 'их','рм' => 'их','тм' => 'ими','вм' => 'ие',},
'ам2об' => {'де' => 'ему','ие' => 'ий','пе' => 'ем','ре' => 'его','те' => 'им','ве' => 'его','дм' => 'им','им' => 'ие','пм' => 'их','рм' => 'их','тм' => 'ими','вм' => 'их',},
'ам2ну' => {'де' => 'ему','ие' => 'ий','пе' => 'ем','ре' => 'его','те' => 'им','ве' => 'ий','дм' => 'им','им' => 'ие','пм' => 'их','рм' => 'их','тм' => 'ими','вм' => 'ие',},
'ам2оу' => {'де' => 'ему','ие' => 'ий','пе' => 'ем','ре' => 'его','те' => 'им','ве' => 'его','дм' => 'им','им' => 'ие','пм' => 'их','рм' => 'их','тм' => 'ими','вм' => 'их',},
'ас1нб' => {'де' => 'ому','ие' => 'ое','пе' => 'ом','ре' => 'ого','те' => 'ым','ве' => 'ое','дм' => 'ым','им' => 'ые','пм' => 'ых','рм' => 'ых','тм' => 'ыми','вм' => 'ые',},
'ас1об' => {'де' => 'ому','ие' => 'ое','пе' => 'ом','ре' => 'ого','те' => 'ым','ве' => 'ое','дм' => 'ым','им' => 'ые','пм' => 'ых','рм' => 'ых','тм' => 'ыми','вм' => 'ых',},
'ас1ну' => {'де' => 'ому','ие' => 'ое','пе' => 'ом','ре' => 'ого','те' => 'ым','ве' => 'ое','дм' => 'ым','им' => 'ые','пм' => 'ых','рм' => 'ых','тм' => 'ыми','вм' => 'ые',},
'ас1оу' => {'де' => 'ому','ие' => 'ое','пе' => 'ом','ре' => 'ого','те' => 'ым','ве' => 'ое','дм' => 'ым','им' => 'ые','пм' => 'ых','рм' => 'ых','тм' => 'ыми','вм' => 'ых',},
'ас2нб' => {'де' => 'ему','ие' => 'ее','пе' => 'ем','ре' => 'его','те' => 'им','ве' => 'ее','дм' => 'им','им' => 'ие','пм' => 'их','рм' => 'их','тм' => 'ими','вм' => 'ие',},
'ас2об' => {'де' => 'ему','ие' => 'ее','пе' => 'ем','ре' => 'его','те' => 'им','ве' => 'ее','дм' => 'им','им' => 'ие','пм' => 'их','рм' => 'их','тм' => 'ими','вм' => 'их',},
'ас2ну' => {'де' => 'ему','ие' => 'ее','пе' => 'ем','ре' => 'его','те' => 'им','ве' => 'ее','дм' => 'им','им' => 'ие','пм' => 'их','рм' => 'их','тм' => 'ими','вм' => 'ие',},
'ас2оу' => {'де' => 'ему','ие' => 'ее','пе' => 'ем','ре' => 'его','те' => 'им','ве' => 'ее','дм' => 'им','им' => 'ие','пм' => 'их','рм' => 'их','тм' => 'ими','вм' => 'их',},
'аж1нб' => {'де' => 'ой','ие' => 'ая','пе' => 'ой','ре' => 'ой','те' => 'ою','те' => 'ой','ве' => 'ую','дм' => 'ым','им' => 'ые','пм' => 'ых','рм' => 'ых','тм' => 'ыми','вм' => 'ые',},
'аж1об' => {'де' => 'ой','ие' => 'ая','пе' => 'ой','ре' => 'ой','те' => 'ою','те' => 'ой','ве' => 'ую','дм' => 'ым','им' => 'ые','пм' => 'ых','рм' => 'ых','тм' => 'ыми','вм' => 'ых',},
'аж1ну' => {'де' => 'ой','ие' => 'ая','пе' => 'ой','ре' => 'ой','те' => 'ою','те' => 'ой','ве' => 'ую','дм' => 'ым','им' => 'ые','пм' => 'ых','рм' => 'ых','тм' => 'ыми','вм' => 'ые',},
'аж1оу' => {'де' => 'ой','ие' => 'ая','пе' => 'ой','ре' => 'ой','те' => 'ою','те' => 'ой','ве' => 'ую','дм' => 'ым','им' => 'ые','пм' => 'ых','рм' => 'ых','тм' => 'ыми','вм' => 'ых',},
'аж2нб' => {'де' => 'ей','ие' => 'яя','пе' => 'ей','ре' => 'ей','те' => 'ею','те' => 'ей','ве' => 'юю','дм' => 'им','им' => 'ие','пм' => 'их','рм' => 'их','тм' => 'ими','вм' => 'ие',},
'аж2об' => {'де' => 'ей','ие' => 'яя','пе' => 'ей','ре' => 'ей','те' => 'ею','те' => 'ей','ве' => 'юю','дм' => 'им','им' => 'ие','пм' => 'их','рм' => 'их','тм' => 'ими','вм' => 'их',},
'аж2ну' => {'де' => 'ей','ие' => 'яя','пе' => 'ей','ре' => 'ей','те' => 'ею','те' => 'ей','ве' => 'юю','дм' => 'им','им' => 'ие','пм' => 'их','рм' => 'их','тм' => 'ими','вм' => 'ие',},
'аж2оу' => {'де' => 'ей','ие' => 'яя','пе' => 'ей','ре' => 'ей','те' => 'ею','те' => 'ей','ве' => 'юю','дм' => 'им','им' => 'ие','пм' => 'их','рм' => 'их','тм' => 'ими','вм' => 'их',},
'км1нб' => {'ие' => '','им' => 'ы',},
'км1об' => {'ие' => '','им' => 'ы',},
'км1ну' => {'ие' => '','им' => 'ы',},
'км1оу' => {'ие' => '','им' => 'ы',},
'км2нб' => {'ие' => 'ь','им' => 'и',},
'км2об' => {'ие' => 'ь','им' => 'и',},
'км2ну' => {'ие' => 'ь','им' => 'и',},
'км2оу' => {'ие' => 'ь','им' => 'и',},
'кс1нб' => {'ие' => 'о','им' => 'ы',},
'кс1об' => {'ие' => 'о','им' => 'ы',},
'кс1ну' => {'ие' => 'о','им' => 'ы',},
'кс1оу' => {'ие' => 'о','им' => 'ы',},
'кс2нб' => {'ие' => 'е','им' => 'и',},
'кс2об' => {'ие' => 'е','им' => 'и',},
'кс2ну' => {'ие' => 'ё','им' => 'и',},
'кс2оу' => {'ие' => 'ё','им' => 'и',},
'кж1нб' => {'ие' => 'а','им' => 'ы',},
'кж1об' => {'ие' => 'а','им' => 'ы',},
'кж1ну' => {'ие' => 'а','им' => 'ы',},
'кж1оу' => {'ие' => 'а','им' => 'ы',},
'кж2нб' => {'ие' => 'я','им' => 'и',},
'кж2об' => {'ие' => 'я','им' => 'и',},
'кж2ну' => {'ие' => 'я','им' => 'и',},
'кж2оу' => {'ие' => 'я','им' => 'и',},
'мм1нб' => {'де' => 'ому','ие' => '','пе' => 'ом','ре' => 'ого','те' => 'ым','ве' => '','дм' => 'ым','им' => 'ы','пм' => 'ых','рм' => 'ых','тм' => 'ыми','вм' => 'ы',},
'мм1об' => {'де' => 'ому','ие' => '','пе' => 'ом','ре' => 'ого','те' => 'ым','ве' => 'ого','дм' => 'ым','им' => 'ы','пм' => 'ых','рм' => 'ых','тм' => 'ыми','вм' => 'ых',},
'мм1ну' => {'де' => 'ому','ие' => '','пе' => 'ом','ре' => 'ого','те' => 'ым','ве' => '','дм' => 'ым','им' => 'ы','пм' => 'ых','рм' => 'ых','тм' => 'ыми','вм' => 'ы',},
'мм1оу' => {'де' => 'ому','ие' => '','пе' => 'ом','ре' => 'ого','те' => 'ым','ве' => 'ого','дм' => 'ым','им' => 'ы','пм' => 'ых','рм' => 'ых','тм' => 'ыми','вм' => 'ых',},
'мм2нб' => {'де' => 'ему','ие' => 'ь','пе' => 'ем','ре' => 'его','те' => 'им','ве' => 'ь','дм' => 'им','им' => 'и','пм' => 'их','рм' => 'их','тм' => 'ими','вм' => 'и',},
'мм2об' => {'де' => 'ему','ие' => 'ь','пе' => 'ем','ре' => 'его','те' => 'им','ве' => 'его','дм' => 'им','им' => 'и','пм' => 'их','рм' => 'их','тм' => 'ими','вм' => 'их',},
'мм2ну' => {'де' => 'ему','ие' => 'ь','пе' => 'ём','ре' => 'его','те' => 'им','ве' => 'ь','дм' => 'им','им' => 'и','пм' => 'их','рм' => 'их','тм' => 'ими','вм' => 'и',},
'мм2оу' => {'де' => 'ему','ие' => 'ь','пе' => 'ём','ре' => 'его','те' => 'им','ве' => 'его','дм' => 'им','им' => 'и','пм' => 'их','рм' => 'их','тм' => 'ими','вм' => 'их',},
'мс1нб' => {'де' => 'ому','ие' => 'о','пе' => 'ом','ре' => 'ого','те' => 'ым','ве' => 'о','дм' => 'ым','им' => 'ы','пм' => 'ых','рм' => 'ых','тм' => 'ыми','вм' => 'ы',},
'мс1об' => {'де' => 'ому','ие' => 'о','пе' => 'ом','ре' => 'ого','те' => 'ым','ве' => 'о','дм' => 'ым','им' => 'ы','пм' => 'ых','рм' => 'ых','тм' => 'ыми','вм' => 'ых',},
'мс1ну' => {'де' => 'ому','ие' => 'о','пе' => 'ом','ре' => 'ого','те' => 'ым','ве' => 'о','дм' => 'ым','им' => 'ы','пм' => 'ых','рм' => 'ых','тм' => 'ыми','вм' => 'ы',},
'мс1оу' => {'де' => 'ому','ие' => 'о','пе' => 'ом','ре' => 'ого','те' => 'ым','ве' => 'о','дм' => 'ым','им' => 'ы','пм' => 'ых','рм' => 'ых','тм' => 'ыми','вм' => 'ых',},
'мс2нб' => {'де' => 'ему','ие' => 'е','пе' => 'ем','ре' => 'его','те' => 'им','ве' => 'е','дм' => 'им','им' => 'и','пм' => 'их','рм' => 'их','тм' => 'ими','вм' => 'и',},
'мс2об' => {'де' => 'ему','ие' => 'е','пе' => 'ем','ре' => 'его','те' => 'им','ве' => 'е','дм' => 'им','им' => 'и','пм' => 'их','рм' => 'их','тм' => 'ими','вм' => 'их',},
'мс2ну' => {'де' => 'ему','ие' => 'ё','пе' => 'ём','ре' => 'его','те' => 'им','ве' => 'ё','дм' => 'им','им' => 'и','пм' => 'их','рм' => 'их','тм' => 'ими','вм' => 'и',},
'мс2оу' => {'де' => 'ему','ие' => 'ё','пе' => 'ём','ре' => 'его','те' => 'им','ве' => 'ё','дм' => 'им','им' => 'и','пм' => 'их','рм' => 'их','тм' => 'ими','вм' => 'их',},
'мж1нб' => {'де' => 'ой','ие' => 'а','пе' => 'ой','ре' => 'ой','те' => 'ою','те' => 'ой','ве' => 'у','дм' => 'ым','им' => 'ы','пм' => 'ых','рм' => 'ых','тм' => 'ыми','вм' => 'ы',},
'мж1об' => {'де' => 'ой','ие' => 'а','пе' => 'ой','ре' => 'ой','те' => 'ою','те' => 'ой','ве' => 'у','дм' => 'ым','им' => 'ы','пм' => 'ых','рм' => 'ых','тм' => 'ыми','вм' => 'ых',},
'мж1ну' => {'де' => 'ой','ие' => 'а','пе' => 'ой','ре' => 'ой','те' => 'ою','те' => 'ой','ве' => 'у','дм' => 'ым','им' => 'ы','пм' => 'ых','рм' => 'ых','тм' => 'ыми','вм' => 'ы',},
'мж1оу' => {'де' => 'ой','ие' => 'а','пе' => 'ой','ре' => 'ой','те' => 'ою','те' => 'ой','ве' => 'у','дм' => 'ым','им' => 'ы','пм' => 'ых','рм' => 'ых','тм' => 'ыми','вм' => 'ых',},
'мж2нб' => {'де' => 'ей','ие' => 'я','пе' => 'ей','ре' => 'ей','те' => 'ею','те' => 'ей','ве' => 'ю','дм' => 'им','им' => 'и','пм' => 'их','рм' => 'их','тм' => 'ими','вм' => 'и',},
'мж2об' => {'де' => 'ей','ие' => 'я','пе' => 'ей','ре' => 'ей','те' => 'ею','те' => 'ей','ве' => 'ю','дм' => 'им','им' => 'и','пм' => 'их','рм' => 'их','тм' => 'ими','вм' => 'их',},
'мж2ну' => {'де' => 'ей','ие' => 'я','пе' => 'ей','ре' => 'ей','те' => 'ею','те' => 'ей','ве' => 'ю','дм' => 'им','им' => 'и','пм' => 'их','рм' => 'их','тм' => 'ими','вм' => 'и',},
'мж2оу' => {'де' => 'ей','ие' => 'я','пе' => 'ей','ре' => 'ей','те' => 'ею','те' => 'ей','ве' => 'ю','дм' => 'им','им' => 'и','пм' => 'их','рм' => 'их','тм' => 'ими','вм' => 'их',},
'см1нб' => {'де' => 'у','ие' => '','пе' => 'е','ре' => 'а','те' => 'ом','ве' => '','дм' => 'ам','им' => 'ы','пм' => 'ах','рм' => 'ов','тм' => 'ами','вм' => 'ы',},
'см1об' => {'де' => 'у','ие' => '','пе' => 'е','ре' => 'а','те' => 'ом','ве' => 'а','дм' => 'ам','им' => 'ы','пм' => 'ах','рм' => 'ов','тм' => 'ами','вм' => 'ов',},
'см1ну' => {'де' => 'у','ие' => '','пе' => 'е','ре' => 'а','те' => 'ом','ве' => '','дм' => 'ам','им' => 'ы','пм' => 'ах','рм' => 'ов','тм' => 'ами','вм' => 'ы',},
'см1оу' => {'де' => 'у','ие' => '','пе' => 'е','ре' => 'а','те' => 'ом','ве' => 'а','дм' => 'ам','им' => 'ы','пм' => 'ах','рм' => 'ов','тм' => 'ами','вм' => 'ов',},
'см2нб' => {'де' => 'ю','ие' => 'ь','пе' => 'е','ре' => 'я','те' => 'ем','ве' => 'ь','дм' => 'ям','им' => 'и','пм' => 'ях','рм' => 'ей','тм' => 'ями','вм' => 'и',},
'см2об' => {'де' => 'ю','ие' => 'ь','пе' => 'е','ре' => 'я','те' => 'ем','ве' => 'я','дм' => 'ям','им' => 'и','пм' => 'ях','рм' => 'ей','тм' => 'ями','вм' => 'ей',},
'см2ну' => {'де' => 'ю','ие' => 'ь','пе' => 'е','ре' => 'я','те' => 'ём','ве' => 'ь','дм' => 'ям','им' => 'и','пм' => 'ях','рм' => 'ей','тм' => 'ями','вм' => 'и',},
'см2оу' => {'де' => 'ю','ие' => 'ь','пе' => 'е','ре' => 'я','те' => 'ём','ве' => 'я','дм' => 'ям','им' => 'и','пм' => 'ях','рм' => 'ей','тм' => 'ями','вм' => 'ей',},
'см8нб' => {'де' => 'и','ие' => 'ь','пе' => 'и','ре' => 'и','те' => 'ем','ве' => 'ь','дм' => 'ям','им' => 'и','пм' => 'ях','рм' => 'ей','тм' => 'ями','вм' => 'и',},
'см8об' => {'де' => 'и','ие' => 'ь','пе' => 'и','ре' => 'и','те' => 'ем','ве' => 'и','ве' => 'ь','дм' => 'ям','им' => 'и','пм' => 'ях','рм' => 'ей','тм' => 'ями','вм' => 'ей',},
'см8ну' => {'де' => 'и','ие' => 'ь','пе' => 'и','ре' => 'и','те' => 'ём','ве' => 'ь','дм' => 'ям','им' => 'и','пм' => 'ях','рм' => 'ей','тм' => 'ями','вм' => 'и',},
'см8оу' => {'де' => 'и','ие' => 'ь','пе' => 'и','ре' => 'и','те' => 'ём','ве' => 'и','ве' => 'ь','дм' => 'ям','им' => 'и','пм' => 'ях','рм' => 'ей','тм' => 'ями','вм' => 'ей',},
'сс1нб' => {'де' => 'у','ие' => 'о','пе' => 'е','ре' => 'а','те' => 'ом','ве' => 'о','дм' => 'ам','им' => 'а','пм' => 'ах','рм' => '','тм' => 'ами','вм' => 'а',},
'сс1об' => {'де' => 'у','ие' => 'о','пе' => 'е','ре' => 'а','те' => 'ом','ве' => 'о','дм' => 'ам','им' => 'а','пм' => 'ах','рм' => '','тм' => 'ами','вм' => '',},
'сс1ну' => {'де' => 'у','ие' => 'о','пе' => 'е','ре' => 'а','те' => 'ом','ве' => 'о','дм' => 'ам','им' => 'а','пм' => 'ах','рм' => '','тм' => 'ами','вм' => 'а',},
'сс1оу' => {'де' => 'у','ие' => 'о','пе' => 'е','ре' => 'а','те' => 'ом','ве' => 'о','дм' => 'ам','им' => 'а','пм' => 'ах','рм' => '','тм' => 'ами','вм' => '',},
'сс2нб' => {'де' => 'ю','ие' => 'е','пе' => 'е','ре' => 'я','те' => 'ем','ве' => 'е','дм' => 'ям','им' => 'я','пм' => 'ях','рм' => 'ь','тм' => 'ями','вм' => 'я',},
'сс2об' => {'де' => 'ю','ие' => 'е','пе' => 'е','ре' => 'я','те' => 'ем','ве' => 'е','дм' => 'ям','им' => 'я','пм' => 'ях','рм' => 'ь','тм' => 'ями','вм' => 'ь',},
'сс2ну' => {'де' => 'ю','ие' => 'ё','пе' => 'е','ре' => 'я','те' => 'ём','ве' => 'ё','дм' => 'ям','им' => 'я','пм' => 'ях','рм' => 'ей','тм' => 'ями','вм' => 'я',},
'сс2оу' => {'де' => 'ю','ие' => 'ё','пе' => 'е','ре' => 'я','те' => 'ём','ве' => 'ё','дм' => 'ям','им' => 'я','пм' => 'ях','рм' => 'ей','тм' => 'ями','вм' => 'ей',},
'сс8нб' => {'де' => 'и','ие' => 'ь','пе' => 'и','ре' => 'и','те' => 'ем','ве' => 'ь','дм' => 'ям','им' => 'я','пм' => 'ях','рм' => 'ей','тм' => 'ями','вм' => 'я',},
'сс8об' => {'де' => 'и','ие' => 'ь','пе' => 'и','ре' => 'и','те' => 'ем','ве' => 'ь','дм' => 'ям','им' => 'я','пм' => 'ях','рм' => 'ей','тм' => 'ями','вм' => 'ей','вм' => 'ь',},
'сс8ну' => {'де' => 'и','ие' => 'ь','пе' => 'и','ре' => 'и','те' => 'ём','ве' => 'ь','дм' => 'ям','им' => 'я','пм' => 'ях','рм' => 'ей','тм' => 'ями','вм' => 'я',},
'сс8оу' => {'де' => 'и','ие' => 'ь','пе' => 'и','ре' => 'и','те' => 'ём','ве' => 'ь','дм' => 'ям','им' => 'я','пм' => 'ях','рм' => 'ей','тм' => 'ями','вм' => 'ей',},
'сж1нб' => {'де' => 'е','ие' => 'а','пе' => 'е','ре' => 'ы','те' => 'ою','те' => 'ой','ве' => 'у','дм' => 'ам','им' => 'ы','пм' => 'ах','рм' => '','тм' => 'ами','вм' => 'ы',},
'сж1об' => {'де' => 'е','ие' => 'а','пе' => 'е','ре' => 'ы','те' => 'ою','те' => 'ой','ве' => 'у','дм' => 'ам','им' => 'ы','пм' => 'ах','рм' => '','тм' => 'ами','вм' => '',},
'сж1ну' => {'де' => 'е','ие' => 'а','пе' => 'е','ре' => 'ы','те' => 'ою','те' => 'ой','ве' => 'у','дм' => 'ам','им' => 'ы','пм' => 'ах','рм' => '','тм' => 'ами','вм' => 'ы',},
'сж1оу' => {'де' => 'е','ие' => 'а','пе' => 'е','ре' => 'ы','те' => 'ою','те' => 'ой','ве' => 'у','дм' => 'ам','им' => 'ы','пм' => 'ах','рм' => '','тм' => 'ами','вм' => '',},
'сж2нб' => {'де' => 'е','ие' => 'я','пе' => 'е','ре' => 'и','те' => 'ею','те' => 'ей','ве' => 'ю','дм' => 'ям','им' => 'и','пм' => 'ях','рм' => 'ь','тм' => 'ями','вм' => 'и',},
'сж2об' => {'де' => 'е','ие' => 'я','пе' => 'е','ре' => 'и','те' => 'ею','те' => 'ей','ве' => 'ю','дм' => 'ям','им' => 'и','пм' => 'ях','рм' => 'ь','тм' => 'ями','вм' => 'ь',},
'сж2ну' => {'де' => 'е','ие' => 'я','пе' => 'е','ре' => 'и','те' => 'ёю','те' => 'ёй','ве' => 'ю','дм' => 'ям','им' => 'и','пм' => 'ях','рм' => 'ей','тм' => 'ями','вм' => 'и',},
'сж2оу' => {'де' => 'е','ие' => 'я','пе' => 'е','ре' => 'и','те' => 'ёю','те' => 'ёй','ве' => 'ю','дм' => 'ям','им' => 'и','пм' => 'ях','рм' => 'ей','тм' => 'ями','вм' => 'ей',},
'сж8нб' => {'де' => 'и','ие' => 'ь','пе' => 'и','ре' => 'и','те' => 'ью','ве' => 'ь','дм' => 'ям','им' => 'и','пм' => 'ях','рм' => 'ей','тм' => 'ями','вм' => 'и',},
'сж8об' => {'де' => 'и','ие' => 'ь','пе' => 'и','ре' => 'и','те' => 'ью','ве' => 'ь','дм' => 'ям','им' => 'и','пм' => 'ях','рм' => 'ей','тм' => 'ями','вм' => 'ей','вм' => 'ь',},
'сж8ну' => {'де' => 'и','ие' => 'ь','пе' => 'и','ре' => 'и','те' => 'ью','ве' => 'ь','дм' => 'ям','им' => 'и','пм' => 'ях','рм' => 'ей','тм' => 'ями','вм' => 'и',},
'сж8оу' => {'де' => 'и','ие' => 'ь','пе' => 'и','ре' => 'и','те' => 'ью','ве' => 'ь','дм' => 'ям','им' => 'и','пм' => 'ях','рм' => 'ей','тм' => 'ями','вм' => 'ей',},
);

=item article2paradigm -- convert article from Zaliznyak's dictionary to full paradigm

Преобразование информации о слове в полную парадигму слова.
Функция возвращет массив вариантов с полной информацией о слове
и хеш с парадигмой слова.

=cut

sub article2paradigm {
  my $article = shift;				# Dictionary article from zaliz.adb
  my @article = @{$article};
  my $article0 = $article[0];

  # Для слов без индекса и без исключений
  if((!defined $article0->{'и'} || defined $article0->{'и'} && $article0->{'и'} eq "0") && !defined($article0->{'искл'}))
    {
    # Если имя существительное не склоняется, то слово копируется во все парадигмы.
    if(defined $article0->{'т'} && $article0->{'т'} eq "с")
      {
      my %wfh; # word forms hash
      for my $parad (@{$paradigms{$article0->{'т'}}})
        {
        my %wf;
        $wf{'с'} = $article0->{'с'};
        $wf{'у'} = $article0->{'у'};
        push(@{$wfh{$parad}}, (\%wf));
        }
      return (\@article, \%wfh);
      }
    # Иначе слово не имеет парадигмы.
    else
      {
      return (\@article, undef);
      }
    }

  my %wfh; # word forms hash
  my @wi = map { get_all_wi($_) } @article;
  for my $wi (@wi)
    {
    # Если существительное неодушевленное и одушевленное,
    # то склоняются отдельно оба варианта.
    if($article0->{'т'} eq "с" && $wi->{'о'} eq "но")
      {
      # Temporarily change to inanimate and decline
      $wi->{'о'} = "н";
      my $wi2 = get_all_wi($wi);
      for my $parad (@{$paradigms{$wi2->{'т'}}})
        {
        push(@{$wfh{$parad}}, @{inflect($wi2, $parad)});
        }

      # Temporarily change to animate and decline
      $wi->{'о'} = "о";
      $wi2 = get_all_wi($wi);
      for my $parad (@{$paradigms{$wi2->{'т'}}})
        {
        push(@{$wfh{$parad}}, @{inflect($wi2, $parad)});
        }

      # Change back to inanimate and animate
      $wi->{'о'} = "но";
      }
    else
      {
      for my $parad (@{$paradigms{$article0->{'т'}}})
        {
        push(@{$wfh{$parad}}, @{inflect($wi, $parad)});
        }
      }

    # Слово с факультативной особенностью склонения склоняется отдельно
    if(defined $wi->{'осф'})
      {
      $wi->{'ос'} = $wi->{'осф'};
      delete $wi->{'осф'};
      for my $parad (@{$paradigms{$article0->{'т'}}})
        {
        push(@{$wfh{$parad}}, @{inflect($wi, $parad)});
        }
      $wi->{'осф'} = $wi->{'ос'};
      delete $wi->{'ос'};
      }

    ## сведения о глаголе противоположного вида
    #if(defined $article0->{'т'} && $article0->{'т'} eq "г" && defined $wi->{'гпр'})
    #  {
    #  $wi->{'гпр'} = verb_opposite($wi, \%wfh);
    #  }
    }

  # удаляются полные дубликаты созданных парадигм
  while(($key,$value) = each %wfh)
    {
    my @wfh = @$value;
    if(@wfh > 1)
		{
		my %saw;
		#@wfh = grep(!$saw{join("", %$_)}++, @wfh);
		@wfh = grep(!$saw{join(",",
				map {
					my %hash = %$_;
					map { $_ . "=>" . $hash{$_} } sort keys %hash
					} $_ )}++, @wfh);
		}
	$wfh{$key} = \@wfh;
	}

  (\@wi, \%wfh)
  }

=item get_all_wi -- get all word information

Предварительная подготовка всех данных, необходимых для склонения/спряжения.

=cut

sub get_all_wi {
  my $wi = shift;
  my %wi = %$wi;

  if($wi{'т'} ne "г") {
    # Склонение
    if(!defined $wi{'рм'} && defined $wi{'р'})
      { $wi{'рм'} = $wi{'р'} }
    if(!defined $wi{'т2'})
     { $wi{'т2'} = $wi{'т'} }
    $wi{'т2'} =~ s/^п$/а/;
    $wi{'т2'} =~ s/^мс-п$/м/;
    $wi{'т2'} =~ s/^мс$/м/;

    if(defined $wi{'ч2'} && $wi{'рм'} eq "м" && $wi{'и'} eq "3")
      {
      $wi{'ч'} = "";
      }

    my $wb = $wi{'с'};

    if(defined $wi{'мн'} && $wi{'мн'} ne ":" && $wi{'мн'} ne "от")
      {
      $wb = $wi{'мн'};
      $wb =~ tr/АЕЁИОУЫЭЮЯ/аеёиоуыэюя/;
      $wi{'у'} = raccent($wi{'мн'},"u");
      $wi{'у'} =~ s/\,.*//; # ударение для ё не нужно
      }

    if($wi{'т2'} =~ /^[см]/) {
      (defined $wi{'ч'}) && ($wb =~ /[^${vowels}йь]$/ || $wb =~ s/[йь]$//) &&
        (($wb,$wi{'сб2'}) = (rem_vowel($wb, \%wi),$wb)) || ($wb =~ s/[${vowels}йь]$//)
    }
    if($wi{'т2'} =~ /^[а]/) { # ($wi{'т2'} =~ /^[ам]/)
      if(!(defined $wi{'фн'} && $wi{'фн'} =~ /\^п/)) {
        ($wb =~ s/..ся$//) && ($wi{'ся'} = "",1) || ($wb =~ s/..$//)
      } # else rem_vowel ?
    }

    my ($exc, $excp);
    (defined($exc = $wi{'искл'})) && (defined($excp = $exc->{'б'})) && ($wb = $excp);

    $wi{'б'} = $wb;
    $wi{'о'} = "н" if !defined $wi{'о'};
    $wi{'и2'} = $wi{'и'} = "0" if !defined $wi{'и'} || $wi{'и'} eq "0";
    $wi{'и2'} = "1" if $wi{'и'} =~ /[1345]/;
    $wi{'и2'} = "2" if $wi{'и'} =~ /[267]/;
    $wi{'и2'} = "8" if $wi{'и'} =~ /[8]/;
    if($wi{'т2'} eq "с") {
      $wi{'сф'} = $wi{'т2'}.$wi{'рм'}.$wi{'и2'}.$wi{'о'};
    } elsif($wi{'т2'} ne "ч") {
      $wi{'сф'} = $wi{'т2'}."м".$wi{'и2'}.$wi{'о'};
    }
    if($wi{'у'} =~ /^(\d+)(.*)?$/) {
      $wi{'уо'} = $1; $wi{'уд'} = $2 if defined $2;
    }
  } else {
    # Спряжение
    my ($vv,       $i) =
       ($wi{'гв'}, $wi{'и'});
    $wi{'нсв'} = ($vv eq "нсв" || $vv eq "св-нсв");
    $wi{'св'} =  ($vv eq "св"  || $vv eq "св-нсв");

    # if(!defined $i) { return \%wi }

    $wi{'тс'} = ($i =~ /^[45]$/ ? 2 : 1);
    if($wi{'тс'} == 1) {
      $wi{'ок1'} = $wi{'ок3м'} = "ю";
      $wi{'ок3е'} = "е";
    } elsif($wi{'тс'} == 2) {
      $wi{'ок1'} = "ю";
      $wi{'ок3м'} = "я";
      $wi{'ок3е'} = "и";
    }

    my $wb = $wi{'б'} = $wi{'с'};
    ($wb =~ s/с[яь]$//) && (@wi{'б','ся'} = ($wb,""));
    my $wb1;
    my $wbi = $wb;
    $wbi =~ s/[тч][ьи]$//;

       $i == 1  &&  $wb =~ s/ть$//
    || $i == 2  && ($wb =~ s/овать$/у/
                ||  $wb =~ s/([${sch}ц])евать$/$1у/
                ||  $wb =~ s/([^${sch}ц])евать$/$1ю/)
    || $i == 3  && ($wb =~ s/уть$//
                && ($wi{'ок1'} = $wi{'ок3м'} = "у"))
    || $i == 4  && ($wb =~ s/ить$//
                && ($wb =~ /[$sch]$/ && (@wi{'ок1','ок3м'} = ("у","а")) || 1)
                && (defined ($wb1 = verb_ch3($wb,$wi{'ч3'})) &&
                    $wb1 =~ /[$sch]$/ && ($wi{'ок1'} = "у")))
    || $i == 5  && ($wb =~ s/[аяе]ть$//
                && ($wb =~ /[$sch]$/ && (@wi{'ок1','ок3м'} = ("у","а")) || 1)
                && (defined ($wb1 = verb_ch3($wb,$wi{'ч3'})) &&
                    $wb1 =~ /[$sch]$/ && ($wi{'ок1'} = "у")))
    || $i == 6  && ($wb =~ s/[ая]ть$//
                && ($wb =~ /[$sch]$/ && ($wi{'ок1'} = $wi{'ок3м'} = "у") || 1)
                && ((defined ($wi{'ч2'}) && ($wi{'ок1'} = $wi{'ок3м'} = "у"))
                || (defined ($wb1 = verb_ch3($wb,$wi{'ч3'})) && ($wb = $wb1) &&
                    $wb1 =~ /[$sch]$/ && ($wi{'ок1'} = $wi{'ок3м'} = "у"))))
    || $i == 7  && ($wb =~ s/([зс])т[иь]$/$1/
                && ($wi{'ок1'} = $wi{'ок3м'} = "у"))
                && (defined ($ch3 = $wi{'ч3'}) && $wb =~ s/[$consonants]$/$ch3/)
    || $i == 8  && ($wb =~ s/чь$//
                && ($wi{'ок1'} = $wi{'ок3м'} = "у")) && ($wb1 = $wb)
                && (defined ($ch3 = $wi{'ч3'}) && ($wb1 .= $ch3)
                    && ($wb = $wb1) && (($wb =~ s/г$/ж/) || ($wb =~ s/к$/ч/)))
    || $i == 9  && ($wb =~ s/ереть$/р/
                && ($wi{'ок1'} = $wi{'ок3м'} = "у"))
    || $i == 10 && ($wb =~ s/(о[лр])оть$/$1/)
    || $i == 11 && ($wb =~ s/ить$/ь/)
    || $i == 12 && ($wb =~ s/греть$/гре/ || $wb =~ s/петь$/по/ || $wb =~ s/брить$/бре/
                ||  $wb =~ s/ыть$/о/ || $wb =~ s/уть$/у/ || $wb =~ s/ить$/и/)
    || $i == 13 && ($wb =~ s/авать$/а/)
    || $i == 14 && ($wb =~ s/[ая]ть$//
                && ($wi{'ок1'} = $wi{'ок3м'} = "у")) && ($wb1 = $wb)
                && (defined ($ch3 = $wi{'ч3'}) && ($wb1 .= $ch3)
                    && ($wb = $wb1))
    || $i == 15 && ($wb =~ s/ть$/н/
                && ($wi{'ок1'} = $wi{'ок3м'} = "у"))
    || $i == 16 && ($wb =~ s/ть$/в/
                && ($wi{'ок1'} = $wi{'ок3м'} = "у"))
    ;

    @wi{'сби','сб1','сб3'} = ($wbi,($wb1 or $wb),$wb);

    if($wi{'сб'}) {
      $wi{'сб1'} = $wi{'сб3'} = $wi{'сб'};
    }

    # Исключения
    my ($exc, $excp);
    if(defined($exc = $wi{'искл'})) {
      if($wi{'св'}) {
        # дублируются все формы исключений будущего времени в настоящее
        foreach $key (sort(keys %{$exc})) {
          (($key2 = $key) =~ s/^б/н/) && ($exc->{$key2} = $exc->{$key});
        }
      }
      if(!defined($exc->{'н2е'}) &&
          defined($exc->{'н1е'}) && defined($excp = $exc->{'н3е'})) {
        my @wfh = map {
          my %h = %{$_}; $h{'с'} =~ s/т(с[ья])?$/"шь".(defined $1 && "ся")/e; \%h
        } @{$excp};
        $exc->{'н2е'} = \@wfh;
      }
      if(!defined($exc->{'н1м'}) &&
          defined($exc->{'н1е'}) && defined($excp = $exc->{'н3е'})) {
        my @wfh = map {
          my %h = %{$_}; $h{'с'} =~ s/т(с[ья])?$/"м".(defined $1 && "ся")/e; \%h
        } @{$excp};
        $exc->{'н1м'} = \@wfh;
      }
      if(!defined($exc->{'н2м'}) &&
          defined($exc->{'н1е'}) && defined($excp = $exc->{'н3е'})) {
        my @wfh = map {
          my %h = %{$_}; $h{'с'} =~ s/т(с[ья])?$/"те".(defined $1 && "сь")/e; \%h
        } @{$excp};
        $exc->{'н2м'} = \@wfh;
      }
      if(!defined($exc->{'н3м'}) &&
          defined($exc->{'н1е'}) && defined($excp = $exc->{'н3е'})) {
        my ($excp1, $j) = ($exc->{'н1е'}, 0);
        my @wfh = map {
          my %h = %{$_};
          if($h{'с'} =~ /[её]т(с[ья])?$/ && defined($excp1)) {
            $h{'с'} = defined($excp1->[$j]) && $excp1->[$j]->{'с'} || $excp1->[0]->{'с'};
            $h{'с'} =~ s/(с[ья])?$/"т".(defined $1 && $1)/e;
          } else {
            ($h{'с'} =~ s/([$sch])ит(с[ья])?$/"$1ат".(defined $2 && $2)/e)
         || ($h{'с'} =~ s/ит(с[ья])?$/"ят".(defined $1 && $1)/e);
          }
          ($h{'с'} =~ s/([$vowels])с[ья]$/$1сь/) || ($h{'с'} =~ s/с[ья]$/ся/);
          $j++; \%h
        } @{$excp};
        $exc->{'н3м'} = \@wfh;
      }
      if(!defined($exc->{'!2е'}) &&
          defined($exc->{'н1е'}) && defined($excp = $exc->{'н3м'})) {
        my @wfh = map {
          my %h = %{$_};
          ($h{'с'} =~ s/([$consonants])[юуяа]т(с[ья])?$/"$1и".(defined $2 && "сь")/e)
       && ($h{'у'} = length($h{'с'}) - (defined $2 && length($2) || 0))
       || ($h{'с'} =~ s/([$vowels])[юуяа]т(с[ья])?$/"$1й".(defined $2 && "ся")/e)
         # NB! исправленное правило:
         # на стр. 89: "ударение там же, где в 3 мн."
         # например: "обЯзывают" -> "обЯзывай"
         # но "поЮт" -> "пой": по правилу ударение должно быть на букве "й"!
         # поэтому здесь ударение сдвигается на одну букву влево
       && (($h{'у'} == length($h{'с'})) && ($h{'у'} = length($h{'с'}) - 1));
          \%h
        } @{$excp};
        $exc->{'!2е'} = \@wfh;
      }
      if(!defined($exc->{'!2м'}) && defined($excp = $exc->{'!2е'})) {
        my @wfh = map {
          my %h = %{$_}; $h{'с'} =~ s/(с[ья])?$/"те".(defined $1 && "сь")/e; \%h
        } @{$excp};
        $exc->{'!2м'} = \@wfh;
      }
      if(!defined($exc->{'дн'}) &&
          defined($exc->{'н1е'}) && defined($excp = $exc->{'н3м'})) {
        my ($excp1, $j) = ($exc->{'н1е'}, 0);
        my @wfh = map {
          my %h = %{$_};
          $h{'у'} = defined($excp1->[$j]) && $excp1->[$j]->{'у'} || $excp1->[0]->{'у'};
          ($h{'с'} =~ s/([$sch])[юуиа]т(с[ья])?$/"$1а".(defined $2 && "сь")/e)
       || ($h{'с'} =~ s/[юуиая]т(с[ья])?$/"я".(defined $1 && "сь")/e);
          ($wi{'св'}) && ($h{'ф'} = "фн");
          $j++; \%h
        } @{$excp};
        $exc->{'дн'} = \@wfh;
      }
      if(!defined($exc->{'чнд'}) &&
          defined($exc->{'н1е'}) && defined($excp = $exc->{'н3м'})) {
        my ($excp1, $j) = ($exc->{'н1е'}, 0);
        my @wfh = map {
          my %h = %{$_};
          ($h{'с'} =~ s/т(с[ья])?$/"щий".(defined $1 && "ся")/e);
          ($h{'с'} =~ /[ая]щий(с[ья])?$/) &&
            ($h{'у'} = defined($excp1->[$j]) && $excp1->[$j]->{'у'} || $excp1->[0]->{'у'});
          ($wi{'св'}) && ($h{'ф'} = "фн");
          $j++; \%h
        } @{$excp};
        $exc->{'чнд'} = \@wfh;
      }
      if(!defined($exc->{'чнс'}) && defined($exc->{'н1е'}) &&
          defined($exc->{'н3е'}) && defined($excp = $exc->{'н1м'})) {
        my ($excp1, $excp3, $j) = ($exc->{'н1е'}, $exc->{'н3е'}, 0);
        my @wfh = map {
          my %h = %{$_};
          my ($excpw3, $excpa3) = defined($excp3->[$j]) ?
            ($excp3->[$j]->{'с'}, $excp3->[$j]->{'у'}) :
              ($excp3->[0]->{'с'}, $excp3->[0]->{'у'});
          ($h{'с'} =~ s/(с[ья])?$/"ый".(defined $1 && "ся")/e);
          ($h{'с'} =~ /имый(с[ья])?$/) &&
            ($h{'у'} = defined($excp1->[$j]) && $excp1->[$j]->{'у'} || $excp1->[0]->{'у'});
          !(($excpw3 =~ /ит(с[ья])?$/) ||
            ($excpw3 =~ /[$vowels]ет(с[ья])?$/) &&
            ($excpa3 != length($excpw3)-1-(defined $1 && length($1) || 0)))
            && ($h{'ф'} = "фн");
          (($wi{'св'}) || ($wi{'гп'} ne "п")) && ($h{'ф'} = "фн");
          $j++; \%h
        } @{$excp};
        $exc->{'чнс'} = \@wfh;
      }
      if(!defined($exc->{'пес'}) &&
          defined($exc->{'пем'}) && defined($excp = $exc->{'пеж'})) {
        my @wfh = map {
          my %h = %{$_}; $h{'с'} =~ s/а(с[ья])?$/"о".(defined $1 && $1)/e; \%h
        } @{$excp};
        $exc->{'пес'} = \@wfh;
      }
      if(!defined($exc->{'пм'}) &&
          defined($exc->{'пем'}) && defined($excp = $exc->{'пеж'})) {
        my @wfh = map {
          my %h = %{$_}; $h{'с'} =~ s/а(с[ья])?$/"и".(defined $1 && $1)/e; \%h
        } @{$excp};
        $exc->{'пм'} = \@wfh;
      }
      if(!defined($exc->{'дп'}) && defined($excp = $exc->{'чпд'})) {
        my @wfh = map {
          my %h = %{$_}; $h{'с'} =~ s/й(с[ья])?$/(defined $1 && "сь")/e; \%h
        } @{$excp};
        $exc->{'дп'} = \@wfh;
      }
      if(!defined($exc->{'чпд'}) &&
          defined($exc->{'пеж'}) && defined($excp = $exc->{'пем'})) {
        my @wfh = map {
          my %h = %{$_};
          $h{'с'} =~ s/л(с[ья])?$/"вший".(defined $1 && "ся")/e ||
          $h{'с'} =~ s/(с[ья])?$/"ший".(defined $1 && "ся")/e;
          \%h
        } @{$excp};
        $exc->{'чпд'} = \@wfh;
      }
      if(!defined($exc->{'дп'}) &&
          defined($exc->{'пеж'}) && defined($excp = $exc->{'пем'})) {
        my @wfh = map {
          my %h = %{$_};
          $h{'с'} =~ s/л(с[ья])?$/"вши".(defined $1 && "сь")/e ||
          $h{'с'} =~ s/(с[ья])?$/"ши".(defined $1 && "сь")/e;
          \%h
        } @{$excp};
        $exc->{'дп'} = \@wfh;
      }
      if($wi{'св'}) {
        foreach $key (sort(keys %{$exc})) {
          (($key2 = $key) =~ s/^н/б/) && ($exc->{$key2} = delete $exc->{$key});
        }
      }
      $wi{'искл'} = $exc;
    }
  }
  \%wi
}

=item verb_ch3 -- convert verb base

Стандартные чередования согласных основы форм глаголов (стр.78).

=cut

sub verb_ch3 {
  my ($wb, $ch3) = @_;
     defined $ch3 && $wb =~ s/[$consonants]$/$ch3/
  || $wb =~ s/([бпвфм])$/$1л/
  || $wb =~ s/с[тк]$/щ/
  || substr($wb,-1,1) =~ tr/зсдтгкх/жшжчжчш/
  || ($wb = undef);
  $wb
}

=item inflect -- word inflection

Склонение или спряжение слова.

=cut

sub inflect {
  if($_[0]->{'т'} ne "г") {
    decline(@_);
  } else {
    conjugate(@_);
  }
}

=item decline -- declension

Склонение существительных, прилагательных, местоимений и числительных.

=cut

sub decline
  {
  my ($wi, $парадигма) = @_;
  my %wi = %$wi;     						# %wi (word information)
  my $word_ending;							# новое окончание словоформы
  my %wf;            						# %wf (word forms) - хеш всех словоформ (парадигмы)
  my @wfh;									# FIXME: used in parallel with %wf

  my $основа_слова = $wi{'б'};				# word base
  my $индекс_склонения = $wi{'и'};			# Zaliznyak's declension index
  my $дополнительный_индекс = $wi{'и2'};
  my $одушевлённость = $wi{'о'};			# animacy
  my $std_endings_key = $wi{'сф'};			# key to standard endings in from %wi_we_tab
  my $чередование = $wi{'ч'};				# alternation
  my $часть_речи = $wi{'т'};				# part of speach
  my $тип_склонения = $wi{'т2'};			# type of declension
  my $род = $wi{'рм'} || "м"; 				# род морфологический (gender)
  my $схема_ударения = $wi{'у1'};			# stress pattern

  my $ударное_окончание;					# "у" - ударное, "б" - безударное
  my $accent;								# новое ударение в словоформе

  # $exc (exception) - ислючения
  my ($exc, $excp);

  # сохранить начальное значение $парадигма
  my $po = $парадигма;

  # If this an adjective, drop split the long-short form indcator out into $adj_form.
  my $adj_form = ($часть_речи eq "п" && $парадигма =~ s/^([кп])(..)/$2/) && $1 || "";

  # Not a pronoun?
  if($тип_склонения =~ /^[ам]/)			# FIXME: no valid values start with 'а'
    {
    ($парадигма =~ s/([но])$//) && ($одушевлённость = $1) && (substr($std_endings_key, 3, 1) = $одушевлённость);

	# Short-form adjective
    if($adj_form eq "к")
      {
      (defined $wi{'у2'}) && ($схема_ударения = $wi{'у2'});
      substr($std_endings_key, 0, 1) = "к";
      if($тип_склонения eq "м")
        { $wf{'ф'} = "фн" } # для т:п т2:мс ч
      }

    # Построение сравнительной степени прилагательных (стр.35)
    if($парадигма eq "с")
      {
      if($тип_склонения eq "м")
        {
        $основа_слова =~ s/[${vowels}йь]$//;
        $wf{'ф'} = "фн";
        }
      if($основа_слова =~ /[^кгх]$/)
        {
        $word_ending = "ее";
		# FIXME: figure out what this does and translate to imperative construction
        ($схема_ударения eq "a" && !defined $wi{'у2'}) && ($ударное_окончание = "б") || ($ударное_окончание = "у");
        }
      else
        {
        # Consonant alternation in the last letter of the stem
        substr($основа_слова,length($основа_слова)-1,1) =~ tr/кгх/чжш/;
		# Compatative ending
        $word_ending = "е";
		# Accent on 2nd vowel?
        if(($основа_слова.$word_ending) =~ /([$vowels][^$vowels]*){2}$/)
          { $accent = length($`) + 1; }
        }
      }
    if($парадигма =~ /(..)(.)?/)
      {
      ($парадигма, $род) = ($1, ($2 or $род));
      substr($std_endings_key, 1, 1) = $род;
      }
    }

  # Винительный падеж (стр.38)
  if($парадигма eq "ве" && !(defined($exc = $wi{'искл'}) && defined($exc->{$po})))
    {
    if($род eq "с" || $род eq "м" && $одушевлённость eq "н")
      {
      $парадигма = "ие";
      $po =~ s/в(..?).?/и$1/;
      }
    elsif($род eq "м" && $одушевлённость eq "о")
      {
      $парадигма = "ре";
      $po =~ s/в(..?).?/р$1/;
      }
    }
  elsif($парадигма eq "вм" && !(defined($exc = $wi{'искл'}) && defined($exc->{$po})))
    {
    if($одушевлённость eq "н") { $парадигма = "им"; $po =~ s/в(.).?/и$1/ }
    elsif($одушевлённость eq "о") { $парадигма = "рм"; $po =~ s/в(.).?/р$1/ }
    }

  # Exceptions
  if(defined($exc = $wi{'искл'}))
    {
    if(defined($excp = $exc->{$po}))
      {
      @wfh = @{$excp};
      goto LABEL1;
      }
    elsif($парадигма eq "тм" && defined($excp = $exc->{(($часть_речи eq "п") && "${adj_form}дм$род" || "дм")}))
      {
      @wfh = map { my %h = %{$_}; $h{'с'} =~ s/$/и/; \%h } @{$excp};
      goto LABEL1;
      }
    elsif($парадигма eq "пм" && defined($excp = $exc->{(($часть_речи eq "п") && "${adj_form}дм$род" || "дм")}))
      {
      @wfh = map { my %h = %{$_}; $h{'с'} =~ s/м$/х/; \%h } @{$excp};
      goto LABEL1;
      }
    }

  if($тип_склонения eq "ч")			# тип склонения: числительных
    {
    $wf{'с'} = $wi{'с'};
    $wf{'у'} = $wi{'у'};
    $wf{'ф'} = "фн";
    return [\%wf];
    }

  if($индекс_склонения eq "0")		# нескольнаемое
    {
    $wf{'с'} = $wi{'с'};
    $wf{'у'} = $wi{'у'};
    return [\%wf];
    }

  if(defined $wi{'ч2'} && $род eq "с" && $индекс_склонения eq "8")
    {
    if($парадигма ne "ие")				# стр.53
      {
      $основа_слова .= "ен";
      }
    else
      {
      $wf{'с'} = $wi{'с'};
      $wf{'у'} = $wi{'у'};
      return [\%wf];
      }
    if($парадигма =~ /.м/)				# plural
      {
      substr($std_endings_key, 2, 1) = "1";
      }
    }

  # FIXME: this this right? # Схемы ударения: $wf{'у1'} - окончание ударное/безударное (у/б)
  if($adj_form ne "к" && $парадигма ne "с")
    {
    # схема ударения полных форм (стр.31)
    if($схема_ударения =~ /^a/ ||
        $схема_ударения eq "b1" && $парадигма eq "те" ||
        $схема_ударения eq "c"  && $парадигма =~ /.е/ ||
        $схема_ударения =~ /^d/ && $парадигма =~ /.м/ ||
        $схема_ударения eq "d1" && $парадигма eq "ве" ||
        $схема_ударения eq "e"  && ($парадигма =~ /.е/ || $парадигма eq "им") ||
        $схема_ударения =~ /^f/ && $парадигма eq "им" ||
        $схема_ударения eq "f1" && $парадигма eq "ве" ||
        $схема_ударения eq "f2" && $парадигма eq "те")
      { $ударное_окончание = "б" }		# stem-stressed
    else
      { $ударное_окончание = "у" }		# end-stressed
    }
  elsif($adj_form eq "к")				# short-form adjective
    {
    # схема ударения кратких форм (стр.33)
    if($схема_ударения =~ /^a/  ||
        $схема_ударения =~ /^c/  && !($парадигма eq "ие" && $род eq "ж"))
      { $ударное_окончание = "б" }
    else
      { $ударное_окончание = "у" }
    }

  # Номер характерного отклонения от стандартного склонения
  if(defined $wi{'ос'})
    {
    if($тип_склонения eq "с") {
      if($wi{'ос'} =~ /1/ && $парадигма eq "им") {
        if($род eq "м") {
          ($дополнительный_индекс eq "1") && ($word_ending = "а") || $дополнительный_индекс eq "2" && ($word_ending = "я");
        } elsif($род eq "с") {
          ($индекс_склонения =~ /[15]/) && ($word_ending = "ы") || ($word_ending = "и"); # TEST:
        }
      } elsif($wi{'ос'} =~ /2/ && $парадигма eq "рм") {
        if($род eq "м") {
          ($дополнительный_индекс eq "1") && ($word_ending = "",1) || ($дополнительный_индекс eq "2") && ($word_ending = "ь");
        } elsif($род eq "с") {
          ($дополнительный_индекс eq "1") && ($word_ending = "ов") ||
            ($дополнительный_индекс eq "2") && ($ударное_окончание eq "б" && ($word_ending = "ев") || ($word_ending = "ёв"));
        } elsif($род eq "ж")
            { $word_ending = "ей" }
      }
    } elsif($тип_склонения eq "а")
      {
      if($wi{'ос'} =~ /1/)
        {			# FIXME: awful!
        ($adj_form eq "к") && ($род eq "м") && ($парадигма eq "ие") &&
          ($основа_слова =~ s/н$//) && ($word_ending = "",1) && (undef $чередование,1);
        }
      elsif($wi{'ос'} =~ /2/)
        {			# FIXME: awful!
        ($adj_form eq "к") && ($основа_слова =~ s/н$//) && (undef $чередование,1) ||
        ($парадигма eq "с")  && ($accent = $wi{'уо'});		# ударение основное
        }
      }
    }

  # Дополнительные особенности окончаний субстантивного склонения
  # Отличия типов склонения (стр.29)
  if($тип_склонения eq "с" && !defined $word_ending) {
    if($индекс_склонения eq "4" && $парадигма eq "рм")
      {
      if($род eq "м")
        { $word_ending = "ей" }
      elsif($род eq "ж" || $род eq "с")
        {
        if($ударное_окончание eq "б")
          { $word_ending = "" }
        else
          { $word_ending = "ей" }
        }
      }
    if($индекс_склонения eq "6" || $индекс_склонения eq "7") {
      if($парадигма eq "рм")
        {
        if($род eq "м")
          {
          if($ударное_окончание eq "б")
            { $word_ending = "ев" }
          else
            { $word_ending = "ёв" }
          }
        elsif($род eq "ж" || $род eq "с")
          { $word_ending = "й" }
        }
      if($индекс_склонения eq "7" && ($парадигма eq "де" && $род eq "ж" || $парадигма eq "пе")) {
        if($ударное_окончание eq "б")
          { $word_ending = "и" }
        else
          { $word_ending = "е" }
      }
    }
  }

  if($тип_склонения eq "с" && defined $wi{'ч2'}) { # (стр.42)
    if($род eq "м") {
      if($индекс_склонения eq "1" && $парадигма =~ /^.м$/) {
        $основа_слова =~ s/ин$//;
        if($парадигма eq "им")
          { $word_ending = "е" }
        elsif($парадигма eq "рм")
          { $word_ending = "" }
        # Если в ед. числе ударение на "-ин", то при схеме ударения 'а'
        # оно переходит во мн. числе на один слог влево
        if($схема_ударения eq "a" && length($основа_слова) < $wi{'уо'} && $основа_слова =~ /[$vowels][^$vowels]*?$/) {
          $accent = length($`) + 1;
        }
      } elsif($индекс_склонения eq "3") {
        if($парадигма =~ /^.е$/) {
        } elsif($парадигма =~ /^.м$/) {
          undef $чередование; # hack to pass changing wb to wb2 for plurals
          if($основа_слова =~ s/ёно?к$/ят/ || $основа_слова =~ s/оно?к$/ат/) {
            substr($std_endings_key, 1, 2) = "с1";
          }
          if($основа_слова =~ s/ёноче?к$/ятк/ || $основа_слова =~ s/оноче?к$/атк/) {
            substr($std_endings_key, 1, 2) = "ж1";
          }
          ($парадигма =~ /^рм$/) && ($основа_слова =~ s/тк$/ток/);
        }
      }
    }
  }

  if(!defined $word_ending)
    {
    $word_ending = $wi_we_tab{$std_endings_key.$ударное_окончание}->{$парадигма};
    # Отличия типов склонения
    if($индекс_склонения eq "3")
      { $word_ending =~ s/^ы/и/ }
    elsif($индекс_склонения eq "4")
      {
      $word_ending =~ s/^ы/и/;
      $word_ending =~ s/^о/е/ if($ударное_окончание eq "б");
      }
    elsif($индекс_склонения eq "5")
      { $word_ending =~ s/^о/е/ if($ударное_окончание eq "б") }
    elsif($индекс_склонения eq "6" || $индекс_склонения eq "7")
      { $word_ending =~ s/ь/й/ }
    elsif($индекс_склонения eq "8" && $wi{'б'} =~ /[${sch}ц]$/)
      { $word_ending =~ s/^я/а/ }
    }

  # NB! Следующий блок должен быть расположен до нахождения ударения,
  # так как нужно знать беглую гласную для нахождения правильного ударения,
  # но в то же время он должен быть расположен после нахождения ударения,
  # так как для нахождения беглой гласной нужно знать ударение!
  if(defined $чередование && $word_ending =~ /^(й|ью?)?$/)
    {
    if(defined $wi{'сб2'})
      { $основа_слова = $wi{'сб2'} }
    else
      {
        $индекс_склонения eq "6" &&
          ($ударное_окончание eq "у" && $основа_слова =~ s/ь$/е/ ||
           $ударное_окончание eq "б" && $основа_слова =~ s/ь$/и/)
        || $основа_слова =~ s/[ьй]ц$/ец/
        || $ударное_окончание eq "у" && $основа_слова =~ s/[ьй]([$consonants])$/ё$1/
        || $ударное_окончание eq "б" && $основа_слова =~ s/[ьй]([$consonants])$/е$1/
        || $основа_слова =~ s/([кгх])([$consonants])$/$1о$2/
        || $основа_слова =~ s/([^${sch}ц])([кгх])$/$1о$2/
        || $основа_слова =~ s/ц$/ец/
        || $ударное_окончание eq "у" && $основа_слова =~ s/([${sch}ц])([$consonants])$/$1о$2/
        || $ударное_окончание eq "у" && $основа_слова =~ s/([$consonants])$/ё$1/
        || $ударное_окончание eq "б" && $основа_слова =~ s/([$consonants])$/е$1/;
        ($индекс_склонения eq "2" && $wi{'у1'} eq "a" && $word_ending eq "ь" &&
         ($род eq "ж" && $wi{'с'} =~ /ня$/ || $wi{'с'} =~ /ний$/) && ($word_ending = ""));
      } # elsif($род eq "м" && $word_ending eq "" && !defined $wi{'ч2'}) {
    }

  # Дополнительные правила об ударении (стр.34)
  if(!defined $accent)
    {
    if($ударное_окончание eq "б")		# stem stressed
      {
      # Если в исходной форме ударение на основе (не на окончании)
      if($wi{'у1'} =~ /^[ace]/ || $wi{'у1'} eq "b1")
        {
        # то ударение падает на тот же слог основы
        # NB! "b1" добавлено вопреки правилам,
        # т.к. в Т.ед. получалось бы "лЮбовью" вместо "любОвью":
        # стр.31: в b1 И.ед. ударение на окончании,
        # стр.32: в b1 Т.ед. ударение на основе,
        # стр.34: если в И.ед. ударение на окончании, то в Т.ед.
        #         на предпоследний слог основы, то есть "лЮбовью"
        $accent = $wi{'уо'}
        }
      else
        {
        print "\$основа_слова=$основа_слова\n";
        print "\$word_ending=$word_ending\n";
        print "\$тип_склонения=$тип_склонения\n";
        print "\$чередование=$чередование\n";
        # В словах схемы f или f1 - на первый слог основы
        if($wi{'у1'} =~ /^f/ && $основа_слова =~ /^[^$vowels]*?[$vowels]/)
          {
          $accent = length($&)
          }
        else
          {
          # Если основа содержит беглую гласную, то на предпоследний слог основы
          if(defined $чередование && $word_ending =~ /^(й|ью?)?$/ &&
              # ($род eq "с" || $род eq "ж" && $индекс_склонения ne "8") && $парадигма eq "рм" &&
              $основа_слова =~ /[$vowels][^$vowels]*?[$vowels][^$vowels]*?$/)
            {
            $accent = length($`) + 1
            }
          # Accent on the last vowel
          # FIXME: should this be case-insensitive? Try: Амга
          elsif($основа_слова =~ /[$vowels][^$vowels]*?$/)
            {
            $accent = length($`) + 1;
            }
          else
            {
			print "WARNING: unhandled case\n";
            $accent = "";
            }
          }
        }
      }
    else								# ending stressed
      {
      # Иначе если ударение внутри окончания
      # (если окончание не содержит гласной, то сдвигаем на один слог влево)
      if($word_ending !~ /[$vowels]/ && $основа_слова =~ /[$vowels][^$vowels]*?$/)
        { $accent = length($`) + 1 }
      # Иначе ударение падает на первый слог окончания
      # (за исключением следующего условия)
      else
        {
        if($тип_склонения eq "м" && $word_ending =~ /^([ое]го|[ое]му)$/)
          {
          $accent = length($основа_слова) + length($word_ending);
          }
        else
          {
          $accent = length($основа_слова) + 1;
          }
        }
      }
    }
  #print "\$accent=$accent\n\n";

  $wf{'у'} = $accent;

  if(defined $wi{'чё'}) {      # стр.34
    if(substr($основа_слова, $wi{'уо'}-1, 1) eq "ё" && $wf{'у'} != $wi{'уо'}) {
      substr($основа_слова, $wi{'уо'}-1, 1) =~ tr(ё)(е);
    }
    if($парадигма eq "рм" || substr($основа_слова, $wf{'у'}-1) !~ /.е/) {
      substr($основа_слова, $wf{'у'}-1, 1) =~ tr(е)(ё);
    }
  }

  $wf{'у'} .= $wi{'уд'} if defined $wi{'уд'}; # дополнительные ударения

  $основа_слова .= $word_ending;
  $основа_слова .= "ся" if(defined $wi{'ся'});
  $wf{'с'} = $основа_слова;

  $парадигма = $po;

  $wf{'ф'} = "фз" if($парадигма ne "ие" && defined $wi{'фз'} && $парадигма =~ /$wi{'фз'}/);
  $wf{'ф'} = "фп" if($парадигма ne "ие" && defined $wi{'фп'} && $парадигма =~ /$wi{'фп'}/);
  $wf{'ф'} = "фн" if($парадигма ne "ие" && defined $wi{'фн'} && $парадигма =~ /$wi{'фн'}/);
  $wf{'ф'} = "фн" if(defined $wi{'мн'} && $парадигма =~ /^.е/);
  $wf{'ф'} = $wi{'ф'} if(defined $wi{'ф'});

  @wfh = (\%wf);

  if(($парадигма eq 'пе') && ((defined $wi{'п2'}) || (defined $wi{'п2ф'})))
    {
    my $wf1 = inflect($wi, 'де')->[0];
    $wf1->{'с'} =~ s/ё/е/g;
    $wf1->{'у'} = length($wf1->{'с'});
    $wf1->{'п2'} = (defined $wi{'п2'}) && ($wi{'п2'}) || ($wi{'п2ф'});
    push(@wfh, $wf1);
    if(defined $wi{'п2ф'})
      {
      my %wf2 = %wf;
      $wf2{'п2'} = $wi{'п2ф'};
      push(@wfh, \%wf2);
      }
    }

  if(($парадигма eq 'ре') && (defined $wi{'р2'}))
    {
    my $wf1 = inflect($wi, 'де')->[0];
    $wf1->{'р2'} = $wi{'р2'};
    push(@wfh, $wf1);
    }

 LABEL1:

  if($fic && $род eq "ж" && $парадигма =~ /^п?те/) {
    my $i = 1;
    for my $wfhi (@wfh) {
      if($wfhi->{'с'} =~ /й$/) {
        my %wf1 = %{$wfhi};
        $wf1{'с'} =~ s/й$/ю/ && splice(@wfh,$i,0,\%wf1);
      } $i++;
    }
  }

  # сравнительная степень
  if($парадигма eq "с")
    {
    my $i = 1;
    for my $wfhi (@wfh) {
      if($wfhi->{'с'} =~ /ее$/)
        {
        my %wf1 = %{$wfhi};
        $wf1{'с'} =~ s/е$/й/ && splice(@wfh,$i,0,\%wf1);
        }
      $i++;
      }
    }

  if($парадигма =~ /^к/ && $схема_ударения =~ m([12]))
    {
    my %wi1 = %wi;
    ($схема_ударения eq "a1" && ($парадигма eq "киеж") ||
     $схема_ударения eq "c1" && ($парадигма eq "кимм") ||
     $схема_ударения eq "c2" && ($парадигма eq "киес"  || $парадигма eq "кимм")) &&
       ($wi1{'у2'} = "b") && (push(@wfh, @{inflect(\%wi1, $парадигма)})) ||
    ($схема_ударения eq "b1" && $парадигма eq "кимм") &&
       ($wi1{'у2'} = "a") && (unshift(@wfh, @{inflect(\%wi1, $парадигма)}));
    }

  \@wfh
  }

=item conjugate - спряжение глаголов (verb conjugation)

=cut

sub conjugate {
  my ($wi, $p) = @_;            # $p - парадигма
  my %wi = %$wi;
  my ($wb, $we);
  my %wf;

  my ($vv,       $sv,       $nsv,       $i) =
     ($wi{'гв'}, $wi{'св'}, $wi{'нсв'}, $wi{'и'});
  my ($u1,       $a) =
     ($wi{'у1'}, $wi{'у'});
  my $os  = (defined $wi{'ос'})  && $wi{'ос'}  || "0";
  my $osf = (defined $wi{'осф'}) && $wi{'осф'} || "0";
  my @wfh;

  $we = "";

  if($p eq "и") { $wf{'с'} = $wi{'с'}; $wf{'у'} = $wi{'у'}; return [\%wf] }

  # Исключения
  if(defined($exc = $wi{'искл'})) {
    if(($p ne "пем") && defined($excp = $exc->{$p})) {
      @wfh = @{$excp};
      goto LABEL2;
    }
  }

  # нет форм будущего несовершенного и настоящего совершенного
  if(!($nsv && $sv) && (($nsv && $p =~ /^б(..)$/) || ($sv && $p =~ /^н(..)$/))) {
    $wf{'с'} = ""; $wf{'у'} = 0; $wf{'ф'} = "фн"; return [\%wf];
  }

  if($p =~ /^(ч..)-(.*)/) { # "чнд","чпд","чнс","чпс"
    my ($p2,$s2) = ($1,$2);
    # swi - saved word information
    # swf - saved word forms
    my $swi2 = $wi{"swi$p2"};
    if(!defined $swi2) {
      my $wfs2 = $wi{"swf$p2"} || (inflect($wi, $p2) && $wi->{"swf$p2"});
      my @wfsh;
      for $wfp2 (@$wfs2) {
        my %wf2;
        my ($wfw2,$wfa2) = ($wfp2->{'с'},$wfp2->{'у'});
        @wf2{'с','у','т','и','у1'} = ($wfw2,$wfa2,'п',($p2=~/^ч.д/ && '4' || '1'),'a');
        (defined $wfp2->{'ф'}) && ($wf2{'ф'} = $wfp2->{'ф'});
        (defined $wfp2->{'з'}) && ($wf2{'з'} = $wfp2->{'з'});
        if($p2 eq "чпс") {
          ($wfw2 =~ /[аяе]нный$/) && (@wf2{'ч','ос'} = (1,2)) ||
          ($wfw2 =~ /ённый$/) && (@wf2{'ч','чё','ос','у2'} = (1,1,2,'b')) ||
          ($wfw2 =~ /тый$/) && defined $wi{'у2'} && $wi{'у2'} eq "c" && ($wf2{'у2'} = 'c');
        }
        push(@wfsh, get_all_wi(\%wf2));
      }
      $swi2 = $wi->{"swi$p2"} = \@wfsh;
    }
    @wfh = map { @{inflect($_, $s2)} } @$swi2;
    ($s2=~/^к/) && ($p2=~/^ч.д/) && (@wfh = map { ($_->{'ф'} = "фн"); $_ } @wfh);
    return \@wfh;
  }

  # currently exceptions not implemented
  if(!defined $i)
    {
    $wf{'с'} = $wi{'с'};
    $wf{'у'} = $wi{'у'};
    return [\%wf];
    }

  # $ae - ударное окончание: "у" - ударное, "б" - безударное (по умолчанию)
  # $ac (accent) - новое ударение в словоформе
  my ($ae, $ac) = ("б");

  # Личные формы настоящего времени несов.вида и буд.вр. сов.вида
  if($p =~ /^[нб](..)$/) {
    my $p2 = $1;
    $wb = ($p2 eq "1е" || $p2 eq "3м" && $wi{'тс'} == 1) && $wi{'сб1'} || $wi{'сб3'};
       $p2 eq "1е" && ($we = $wi{'ок1'}, $ae = "у")
    || $p2 eq "2е" && ($we = $wi{'ок3е'}."шь")
    || $p2 eq "3е" && ($we = $wi{'ок3е'}."т")
    || $p2 eq "1м" && ($we = $wi{'ок3е'}."м")
    || $p2 eq "2м" && ($we = $wi{'ок3е'}."те")
    || $p2 eq "3м" && ($we = $wi{'ок3м'}."т");
    ($u1 eq "c1") && ($p2 =~ /^[123]м$/) && ($ae = "у");
  }
  # Личные формы прошедшего времени
  elsif($p =~ /^п([ем][мжс]?)$/) {
    $wb = $wi{'сби'};
       (($i == 7 || $i == 8) && ($wb = $wi{'сб1'}, $wb =~ s/[тд]$//, 1))
    || (($i == 9) && ($wb =~ s/е$//, 1))
    || (($i == 3) && (defined $wi{'ч2'}) &&
        ($os !~ /5/ || $p ne "пем") && ($wb =~ s/ну$//));
    my $u2 = $wi{'у2'};
    (defined $u2) && ($u1 = $u2,1) || ($u1 = "a");
    $we = "л";
    ($wb =~ /[$consonants]$/) && ($we = "");
       $p eq "пеж" && ($wb .= "л", $we = "а", $ae = "у")
    || $p eq "пес" && ($wb .= "л", $we = "о")
    || $p eq "пм"  && ($wb .= "л", $we = "и");
  }
  # Повелительное наклонение
  elsif($p =~ /^!/) {
    $wb = ($i != 13) && ($wi{'тс'} == 1 && $wi{'сб1'} || $wi{'сб3'}) || $wi{'сби'};
    $we =
      ($wb =~ /[$vowels]$/)
        && ($i == 4 && ($u1 ne "a" || $wb =~ /^вы/) && "и"
        || "й")
      || ( $u1 ne "a" && "и"
        || ($wb =~ /^вы/ || $wb =~ /[$consonants]ь?[$consonants]$/ || $wb =~ /щ$/) && "и"
        || "ь");
    ($i == 11) && ($wb =~ s/ь$/е/) && ($we = "й");
    ($p =~ /^!2[ем]$/) && ($ae = "у");
    ($os =~ /2/) && ($we = (($wb =~ /[$vowels]$/) && "й" || "ь"));
    ($os =~ /3/) && ($we = (($p eq "!2е") && "и" || "ь"));
    ($osf =~ /3/) && (($p eq "!2е") && ($os !~ /3/) || ($p eq "!2м")) && ($we = "ь");
  }
  # Действительное причастие настоящего времени
  elsif($p eq "чнд") {
    if(!$nsv) { $wf{'ф'} = "фн" }
    $wb = $wi{'сб3'};
    $we = $wi{'ок3м'}."щий";
    $ae = "у" if $wi{'тс'} == 2;
  }
  # Деепричастие настоящего времени
  elsif($p eq "дн") {
    if(!($nsv && $i =~ /^([124-7]|1[0236])$/)) {
      # $wf{'с'} = ""; $wf{'у'} = 0; return [\%wf];
      $wf{'ф'} = "фн";
    }
    $wb = ($i == 13) && $wi{'сби'} || $wi{'сб3'};
    $we = ($wb =~ /[^$sch]$/) && "я" || "а";
    ($i == 13) && ($ac = $a) || ($ae = "у");
  }
  # Действительное причастие прошедшего времени
  elsif($p eq "чпд") {
    my $wf2 = $wi{"swfпем"} || (inflect($wi, "пем") && $wi->{"swfпем"});
    ($wb, $ac) = ($wf2->[0]->{'с'},$wf2->[0]->{'у'}); $wb =~ s/с[яь]$//;
    $wb =~ s/л$/в/; $we = "ший";
    ($i == 7) && $wi{'б'} =~ /сти$/ &&
      (defined $wi{'ч3'}) && ($wi{'ч3'} =~ /^[тд]$/) &&
        ($wb = $wi{'сб1'});
    ($os =~ /1/ || $osf =~ /1/) && ($i != 9) && ($ac = $a);
    ($os =~ /6/) && ($wb !~ /нув?/) && ($wb =~ s/в?$/нув/);
  }
  # Деепричастие прошедшего времени
  elsif($p eq "дп") {
    my $wf2 = $wi{"swfчпд"} || (inflect($wi, "чпд") && $wi->{"swfчпд"});
    ($wb, $ac) = ($wf2->[0]->{'с'},$wf2->[0]->{'у'}); $wb =~ s/с[яь]$//;
    ($wb =~ s/й$//);
  }
  # Страдательное причастие настоящего времени
  elsif($p eq "чнс") {
    if($nsv && $wi{'гп'} eq "п") {
      if($u1 eq "a"
          && ($i =~ /^([12]|12)$/ || $i eq "9" && $wi{'б'} =~ /ять$/)
          || $i == 13) {      # пустой блок
      } elsif($i == 4 || $i == 5 || $i == 7 || $i == 6
               && ($wi{'б'} =~ /ять$/ || defined $wi{'ч2'})) {
      } else { $wf{'ф'} = "фн" }
    } else { $wf{'ф'} = "фн" }
    $wb = ($i == 13) && $wi{'сби'} || $wi{'сб3'};
    $we = $wi{'ок3е'}."мый";
    ($i == 13) && ($ac = $a) || ($wi{'тс'} == 2) && ($ae = "у");
  }
  # Страдательное причастие прошедшего времени
  elsif($p eq "чпс") {
    if($wi{'гп'} eq "п" && !($nsv && defined $wi{'гпр'})) {
    } else { $wf{'ф'} = "фн" }
    if($i != 14 && $wi{'б'} =~ /[ая]ть$/) {
      $wb = $wi{'сби'};
      $we = "нный";
      if($wi{'б'} =~ /([$vowels][^$vowels]*)[$vowels][^$vowels]*$/ && $a == length($`) + length($1) + 1) {
        $ac = length($`) + 1;
        # substr($wb,$ac-1,1) =~ tr/е/ё/; # my own rule!
      } else { $ac = $a }
    } elsif($i == 4 || $i == 5 && $wi{'б'} =~ /еть$/) {
      $wb = $wi{'сб1'};
      $we = "енный";
      if($i == 4) { $ae = "б" }
      elsif($i == 5) {
        # так же как 3 & 10
        if($wi{'сби'} =~ /([$vowels][^$vowels]*)[$vowels][^$vowels]*$/ && $a == length($`) + length($1) + 1) {
          $ac = length($`) + 1
        } else { $ac = $a }
      }
    } elsif($i == 1 && ($wi{'б'} =~ /одолеть$/ || $wi{'б'} =~ /печатлеть$/)) {
      $wb = $wi{'с'}; $wb =~ s/еть$//;
      $we = "енный"; $we =~ s/^е/ё/; $ac = length($wb) + 1
    } elsif($i == 7 || $i == 8) {
      $wb = $wi{'сб3'};
      $we = "енный";
      my $u2 = $wi{'у2'};
      (defined $u2) && ($u1 = $u2,1) || ($u1 = "a");
    } elsif($i == 3 || $i == 10) {
      $wb = $wi{'сби'};
      $we = "тый";
      # так же как 5
      if($wi{'сби'} =~ /([$vowels][^$vowels]*)[$vowels][^$vowels]*$/ && $a == length($`) + length($1) + 1) {
        $ac = length($`) + 1
      } else { $ac = $a }
    } elsif($i =~ /^(9|1[12456])$/) {
      my $wf2 = $wi{"swfпем"} || (inflect($wi, "пем") && $wi->{"swfпем"});
      ($wb, $ac) = ($wf2->[0]->{'с'},$wf2->[0]->{'у'}); $wb =~ s/с[яь]$//;
      $wb =~ s/л$//; $we = "тый";
    } else {
      $wb = $wi{'сби'}; $we = "нный"; $wf{'ф'} = "фн"
    }
    (defined $wi{'гпс'}) && ($wb =~ s/[$consonants]$/$wi{'гпс'}/);
    ($os =~ /7/) && (($wb.$we) =~ /[$vowels]нный$/) && #(print "!:($wb.$we)\n") && ($ae = "у");
      ($ac = length($`) + 1) && ($we =~ s/^е/ё/); # copy from next
    ($os =~ /8/) && (($wb.$we) =~ /([$vowels][^$vowels]*){3}$/) &&
      ($ac = length($`) + 1);
  }

  if(!defined $ac) {
    $ac = $a;
    if(($u1 eq "a") || ($u1 =~ /^c/) && ($ae eq "б")) { # ($u1 eq "c")
        ($ac >= length($wb)) && ($wb =~ /[$vowels][^$vowels]*?$/) && ($ac = length($`) + 1)
    } else {
         ($we =~ /[$vowels]/)         && ($ac = length($wb) + length($`) + 1)
      || ($wb =~ /[$vowels][^$vowels]*?$/) && ($ac = length($`) + 1);
         ($we =~ s/^е/ё/);
      ($p eq "чнс") && ($wb =~ /[$consonants]$/) && ($we =~ s/^ё/о/)
    }
  }

  $wb .= $we;

  ($os =~ /1/) && ($p =~ /^п([ем][мс]?)$/ || ($p =~ /^ч.с$/)) &&
    (substr($wb,0,$ac-1) =~ /[$vowels][^$vowels]*$/) && ($ac = length($`) + 1);
  ($os =~ /4/) && ($p eq "чнд") &&
    (substr($wb,0,$ac-1) =~ /[$vowels][^$vowels]*$/) && ($ac = length($`) + 1);

  if(defined $wi{'чё'} && ($p =~ /^п([ем][мжс]?)/ || $p =~ /^[чд]п[дс]?$/)) {
    my $jo = ($i == 9) && $wi{'б'} =~ /ереть$/ && (length($`) + 1)
      || $wi{'б'} =~ /е[^е]*$/ && (length($`) + 1);
    if($jo == $ac) {
      substr($wb,$jo-1,1) =~ tr/е/ё/
    }
  }

  (defined $wi{'чо'}) && ($p eq "чпс") && ($wb =~ s/цеванный/цованный/);

  # Звёздочка при цифре (стр.79)
  if(defined $wi{'ч'}) {
    if($wb =~ /^(во|в|и|ни|пора|ра)[зс]/) {
      ($wb =~ s/^(во|в|и|ни|пора|ра)[зс]([$consonants][ь$consonants].*)/$1зо$2/) && $ac++;
    } else {
      ($wb =~ s/^(в|над|об|от|под|пред|с)([$consonants][ь$consonants].*)/$1о$2/) && $ac++;
    }
  }

  ($p eq "!2м") && ($wb .= "те");

  (defined $wi{'ся'}) && ($wb =~ /[$vowels]$/ && ($wb .= "сь") || ($wb .= "ся"));

  $wf{'с'} = $wb;
  $wf{'у'} = $ac;

  @wfh = (\%wf);

 LABEL2:
  for my $wfhi (@wfh) {
    $wfhi->{'ф'} = "фз" if(defined $wi{'фз'}  && $p =~ /$wi{'фз'}/);
    $wfhi->{'ф'} = "фп" if(defined $wi{'фп'}  && $p =~ /$wi{'фп'}/);
    $wfhi->{'ф'} = "фн" if(defined $wi{'фн'}  && $p =~ /$wi{'фн'}/);
    $wfhi->{'ф'} = "фн" if(defined $wi{'гбл'}
                           && !($p eq "б3е" || $p eq "н3е") && ($p ne "пес"));
    $wfhi->{'ф'} = $wi{'ф'} if(defined $wi{'ф'});
  }

  if($p eq "дп") {
    if($os =~ /9/) {
      my %wf1 = %{inflect($wi, "дн")->[0]};
      $wfh[0]->{'з'} = "устар."; delete($wf1{'ф'});
      unshift(@wfh, \%wf1);
    }
    my %wf2 = (defined $wfh[1]) ? %{$wfh[1]} : %{$wfh[0]}; # %wf
    (($i == 9) && (!defined $wi{'ся'}) && $sv) &&
      (@wf2{'с','у'} = ($wi{'с'},$wi{'у'})) &&
      ($wf2{'с'} =~ s/ть$/в/) && unshift(@wfh, \%wf2);
    ($wf2{'с'} =~ s/вши$/в/) && unshift(@wfh, \%wf2);
  }

  if($u1 =~ /c[12]/ && ($p =~ /^п[ем][мжс]?$/)) {
    my %wf1 = %wf;
    (($u1 eq "c1") && ($p eq "пес") ||
     ($u1 eq "c2") && ($p =~ /^п[ем][мс]?$/)) &&
       ($wf1{'с'} =~ /[$vowels][^$vowels]*$/) && ($wf1{'у'} = length($`) + 1) &&
         (($p eq "пем") && ($wf1{'з'} = "устар.") || 1) && push(@wfh, \%wf1)
  }

  # save word forms
  ($p eq "пем" || $p =~ /^ч/) && ($wi->{"swf$p"} = \@wfh); # $p eq "чпд"

  # исключение для "пем"
  if(defined($exc = $wi{'искл'})) {
    if(($p eq "пем") && defined($excp = $exc->{$p})) {
      return $excp;
    }
  }

  \@wfh
}


=item rem_vowel - remove vowel

Удаление беглой гласной.

=cut

sub rem_vowel {
  my ($wb, $wi) = @_;
  my %wi = %$wi;
  my $t2 = defined $wi{'т2'} && $wi{'т2'} || "";
  my $gm = defined $wi{'рм'} && $wi{'рм'} || "";
    if($t2 eq "м" || $gm eq "м" || $gm eq "ж" && $wi{'и'} eq "8") {
      $wb =~ s/о([^$vowels]+)$/$1/
      || $wb =~ s/и([^$vowels]*)$/ь$1/ # s/и([^$vowels]+)$/ь$1/
      || $wb =~ s/([$vowels])[её]([^$vowels]+)$/$1й$2/
      || $wi{'и'} eq "6" && ($gm eq "м" || $t2 eq "м") && $wb =~ s/[её]$/ь/
      || $wi{'и'} eq "3" && ($gm eq "м" || $t2 eq "м") && $wb =~ s/([$consonants2])[её]([^$vowels]+)$/$1ь$2/
      || $wb =~ s/л[её]([^$vowels]+)$/ль$1/
      || $wb =~ s/[её]([^$vowels]+)$/$1/;
    }
  $wb
}

# raccent - reversed accent
sub raccent {
  my $word = shift;
  my $acc = "0";         # by default
  my $acctype = shift;   # 0 or 1 or a or u
  my $rword = reverse $word;

  return $word unless $acctype eq "u"; # TODO: $acctype = 0 or 1 or a

  if(($word !~ m([АЕЁёИОУЫЭЮЯ])) && ($word =~ m([аеёиоуыэюя]))) {
    return length($`) + 1
  }

  while ($rword =~ m([АЕЁёИОУЫЭЮЯ])g) {
    my $accn = length($word) - length($`);
    $acc .= "." . $accn;
    substr($word,$accn-1,1) =~ tr(АЕЁИОУЫЭЮЯ)(аеёиоуыэюя);
  }
  $rword = reverse $word;
  while ($rword =~ m(ё)g) {
    my $accn = length($word) - length($`);
    $acc .= "," . $accn;
    substr($word,$accn-1,1) =~ tr(ё)(е);
  }
  $acc =~ s(^0?\.)();
  $acc
}

1;
